{
  "baslik": "Dark Web ve Deep Web Nedir?",
  "url": "https://berqnet.com/blog/dark-web-ve-deep-web-nedir",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nDark Web ve Deep Web Nedir?\n\nİnternet uçsuz bucaksız bir gökyüzü… Hemen hemen her gün bu uçsuz bucaksız gökyüzüne bakmak için başınızı kaldırıyorsunuz ancak sadece sınırlı bir kısmını görebiliyorsunuz. Peki, ya göremediğiniz kısımlarında neler gizli olabilir? Görünmeyen alanlarında sizi neler bekliyor? Bu yazıda gökyüzünün, yani internetin görünmeyen kısımlarına bir göz atacağız.\n\n\n\n\nİnternetin görünmeyen kısımları deyince, karşımıza iki kavram çıkıyor: Deep Web ve Dark Web... Öncelikle bu iki kavramı tanımaya çalışalım.\nDeep Web Nedir?\n\nDeep Web kavramını, Türkçeye çevirmek istersek Derin Web (Derin İnternet) olarak düşünebiliriz. Adından da anlaşılacağı gibi internetin göremediğimiz kısımlarını, derinlerini ifade eder. Arama motorları ile yaptığımız aramalarda karşımıza çıkmayan, yani arama motorları tarafından indekslenmeyen her şey Deep Web tanımına dâhildir.\nİnterneti, sekiz dilimli büyük boy bir pizza gibi düşünün. Arama motorları tarafından listelenen siteleri bir dilim olarak düşünürsek, işte geriye kalan yedi dilimlik pizza Deep Web’i oluşturur. Bir başka deyişle, sekiz dilimlik bir pizzaya sahip olsanız bile, bunun sadece bir dilimini tüketiyorsunuzdur aslında. Peki neden? Şimdi bu sorunun yanıtına bakalım.\nDeep Web’in Seviyeleri\nDeep Web ve Dark Web kavramlarını daha iyi anlayabilmek için internetin katmanlarına bir göz atmak faydalı olacaktır. İnternetin kabul edilen sekiz katmanı bulunmaktadır.\n\nSeviye 0 - Common Web: Bu katmanı, gün içinde kullandığınız internet olarak düşünebilirsiniz.\nSeviye 1 - Surface Web: Arama motorları üzerinden basit aramalar yaparak ulaştığınız siteler, bu katmanda yer alır.\nSeviye 2 - Bergie Web: Arama motorları ile erişilemeyen ftp server, indekslenmeyen porno içerikler vb. bu katmanda bulunur.\n\n\nseviyeden itibaren Deep Web başlar. Bundan sonraki seviyeler için vekil sunucu olarak adlandırılan proxy kullanmak gerekecektir.\n\n\nSeviye 3 - Deep Web: Bu seviye, Proxy seviyesi ve Tor seviyesi şeklinde ikiye ayrılır.\n\nProxy seviyesi: Bu seviyedeki siteler .onion uzantısı taşımayan, arama motorları tarafından yasaklanmış, yasa dışı içeriklere yer verir.\nTor seviyesi: .onion uzantılı siteleri bulunduran, dizinler üzerinden yönlendirilen içerikler bu katmandadır. Gizli devlet belgeleri, silah ve bomba gibi eğitimler, yasa dışı araştırmalar vb içerikler bu seviyede yer alır.\n\nSeviye 4 - Charter Web: Bu seviye de ikiye ayrılır: Tor seviyesi ve özel erişim seviyesi\n\n            Tor Seviyesi: Tor tarayıcısı kullanmak dışında ek bir işleme gerek duymaksızın erişilen siteleri barındırır. Burada da milyonluk bahis sonuçları, silah kaçakçılığı, çok yüksek bütçeli satışlar, yasaklanmış kitaplar, filmler, müzikler, illegal deneyler gibi içeriklerin olduğu belirtilmektedir.\n            Özel Erişim Seviyesi: Erişim yapabilmek için Tor tarayıcılarının da yetmediği, .clos uzantılı sitelerin bulunduğu ve ancak Closed Shell System isimli özel bir yöntem ile ulaşılabilen sitelerin bulunduğu seviyedir. Wikileaks belgelerinin de buradan çıktığı söylenir.\n\nSeviye 5 - Marianas Web: Bu seviyenin varlığına dair bazı şüpheler vardır çünkü henüz ulaşılamamıştır. Ulaşabilmek için kuantum teknolojisi ile çalıştırılan bilgisayarları ve interneti gerektirdiği söylenmektedir. İsmini dünyanın en derin noktası olarak bilinen Marianas Çukuru’ndan almaktadır.\n\n\nSeviye 6: Bilinen en tehlikeli seviye olarak kabul edilir. En gelişmiş teknoloji ile denense bile, halen bu seviyeye ulaşılabilmiş değil.\n\n\nSeviye 7 - The Fog/Virus Soup: Hakkında hiçbir bilginin bulunmadığı bir başka seviye de burasıdır. Savaş bölgesi olarak adlandırılır. Bu ismin verilmesinin sebebi, ola ki bir gün bu seviyeye ulaşılırsa, bir üst seviye olan 8. seviyeye çıkılmasının önüne geçilmesi için bu seviyedeki herkesin birbiri ile savaşacak olmasıdır.\n\n\nSeviye 8 - The Primarch System: En düz tabiriyle, internetin en son noktası olduğu söylenebilir. Hiç kimsenin ya da herhangi bir hükümetin dahi bilmediği Primarch sistem tarafından kontrol edilmektedir. Bu sisteme İnternetin Tanrısı adı verilmiştir.\n\nDeep Web için tehlikelidir demek, tam anlamıyla doğruyu yansıtmaz. Ancak yukarıda da gördüğümüz gibi tehlikeli olan kısımlarını da göz ardı edemeyiz.\nDeep Web’e Giriş Nasıl Yapılır?\nSizin de fark etmiş olacağınız gibi, aslında gün içinde farkında olmadan Deep Web’e giriyoruz. Bankacılık işlemlerimizi yapmak için ya da e-postalarımıza bakmak için kullandığımız sayfalar, Deep Web’in parçalarıdır. Elbette ki Deep Web sadece bunlarla sınırlı değildir.\nDeep Web’in tehlikeli, adından da anlaşılacağı gibi karanlık bir yüzü var ki o da Dark Web olarak tanımlanmaktadır. Her ne kadar Deep Web ve Dark Web iki ayrı kavram olsalar da günümüzde zaman zaman bu iki kavram karıştırılmakta ve birbirinin yerine kullanılabilmektedir. İkisinin arasındaki farkı şu şekilde özetleyebiliriz: Biraz önce bahsettiğimiz gibi, arama motorlarında görüntülenmeyen her şey Deep Web’i içerir. Dark Web de Deep Web’in bir parçasıdır ancak daha tehlikeli ve yasa dışı işlemlerin yapıldığı bir bölümdür.\nPizza örneğimize geri dönersek, kalan yedi dilimi Deep Web olarak tanımlamıştık. Bu yedi dilimin sadece bir dilimi Dark Web’tir.\nDark Web (Karanlık Web) Nedir?\nÖzel bilgilerin paylaşıldığı, sansürden uzak ve bu sebeplerle yasa dışı faaliyetlerin sıklıkla görüldüğü bir alandır. Burada yasa dışı faaliyetler ile anlatılmak istenen, uyuşturucu ticaretinden yasa dışı ürünlerin satışına, kiralık katilden sahte pasaportlara, pornografik içeriklerden terör propagandasına, illegal deneylerden gizli devlet belgelerine kadar uzanan her şeydir. İnternetin sadece özel tarayıcılar ile girilebildiği bu kısmında kişiler anonim kalır.\nHer ne kadar Dark Web’te karanlık işler dönse de bu alana girmek yasa dışı değildir ama tehlikeli olduğunu unutmamak gerekir. Dark Web’e Tor (The Onion Routing) adı verilen özel bir tarayıcı ile girilebilir. Bu tarayıcı, kullanıcılara .onion kayıt operatörünü barındıran web siteleri üzerinde gezinme imkanı sunar. Tor sayesinde konumunuz anlık olarak değiştirildiğinden aynı anda hem Meksika’dan hem de İtalya’dan giriş yapmış gibi gözükürsünüz.\nDark Web’e Girmek Tehlikeli mi?\nTor isimli özel tarayıcıyı kullanmak yasalara aykırı olmasa da Dark Web konusunda yeterince bilgi ve deneyim sahibi değilseniz, pek çok tehlikeye açık bir hale gelirsiniz.\nDark Web, tepeden tırnağa kötü amaçlı yazılımlarla doludur. Dolayısıyla Dark Web’e giriş yaptığınız anda siber saldırıların hedefi haline gelebilirsiniz. Bu kötü amaçlı yazılımları, tuş kaydediciler, fidye yazılımları, kimlik bilgilerinizi ele geçiren yazılımlar, botnet vb. olarak sıralayabiliriz.\nDark Web, siber saldırıların yanı sıra dolandırıcılık faaliyetlerinin de oldukça yüksek olduğu bir alandır. Buradan bir ürün satın alsanız da o ürünün size ulaşıp ulaşmayacağından asla emin olamazsınız. Bu denli tehlikeli ve yasa dışı bir alan olması gerekçesi ile elbette ki devlet izlemesi altındadır. Yetkililer, özel yazılımlar sayesinde buradaki sitelere sızarak gerek müşterilerin gerekse sitede bulunan kişilerin kimliklerini tespit etmektedirler. Bu nedenle sadece meraktan Dark Web üzerindeki bir siteye girmiş veya izlemiş olsanız dahi bu durum, sizi şüpheli konumuna getirilebilir.\nAsla unutmamanız gereken bir gerçek vardır ki Dark Web üzerinde bulunan içeriklerin neredeyse tamamına yakını yasa dışıdır. Nasıl ki hırsızların, dolandırıcıların, tacizcilerin ya da katillerin bulunduğu bir odada bulunmak her türlü tehlikeyi de beraberinde getirmeye müsaitse, bu tür kişilerin kol gezdiği sanal ortamlarda bulunmak da aynı risklere gebedir.\nTüm bu tehlikelere rağmen insanlar Dark Web’i ziyaret etmeye devam ediyor. Bunun sebebinin tek bir açıklaması olabilir: Merak. Bilinmeyene, görünmeyene ya da karanlık olan şeylere duyulan meraktan Dark Web de nasibini alıyor.\n\n17 Eylül 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Oltaya Gelmeyin! Oltalama Dolandırıcıları Nasıl Teşhis Edilir?",
  "url": "https://berqnet.com/blog/oltaya-gelmeyin",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nOltaya Gelmeyin! Oltalama Dolandırıcıları Nasıl Teşhis Edilir?\n\nTeknoloji bazen şaşırtıcı bazen de endişe verici bir şekilde gelişirken tüm yaşamı kapsayan bir bütünlük içerir. Kişisel ilişkilerden çalışma programlarına, ofis ortamlarından eğitimlere kadar pek çok alanda faydalanılan teknoloji, sıklıkla gözü pek korsanların ilgi odağı olur.\n\n\n\n\nPek çok kuruluşun ve kişinin özel verilerine erişimin son derece kolay yapıldığı çağımızda siber riske maruz kalmak her an herkesin baş etmek zorunda kalacağı bir tehdit olabilir. Dolayısıyla ister küçük bir işletme, ister milyon dolarlık bir şirket olun, dolandırıcıların oltasına yakalanabilirsiniz. Doğru zamanda doğru tedbirleri almazsanız hedef olabilir, dahası her şeyinizi bir anda kaybedebilirsiniz.\nHangi Durumlarda Siber Riske Maruz Kalma İhtimaliniz Artar?\nGenel olarak bir işletmenin dijital operasyonları ne kadar kapsamlı ve karmaşıksa içerdiği siber saldırı riski de o kadar yüksek olur. Siber saldırılarda oltaya gelmenizi kolaylaştıran bazı unsurlar şöyledir;\n\nUzaktan çalışma sistemi ile sisteme giriş yapabilen çalışan veya müşterileriniz varsa,\nŞirkete ait cihaz ve bilgisayarları seyahat ederken kullanırsanız,\nAğdaki yönetici ayrıcalıklarına çalışan erişimi sağlanırsa,\nParolaların düzenli olarak değiştirilmediği durumlarda,\nSon 12 ayda şirketin yaşadığı güvenlik açığı problemlerinin varlığı,\nBilinmedik sitelere özel bilgileri girme veya bilinmeyen maillere tıklama gibi durumlarda da siber riske maruz kalınacağı aşikârdır.\n\nBu nedenlerle siber tehditler nasıl tanınır ve siber saldırı ile karşılaşıldığında nasıl tepki verilir gibi soruların yanıtları konusunda şirket çalışanları eğitilmelidir.\nOltalama Saldırısı Aşamaları Nelerdir?\nHerhangi bir şirket veya özel kişilik için siber saldırı aşamaları bilgi sistemleri saldırısı olarak görülen Kill Zinciri olarak değerlendirilir. Lockheed Martin’in geliştirdiği orijinal adıyla Cyber Kill Chain aşamaları şöyle izah edilir:\nKeşif Aşaması:\nHackerın saldıracağı kişi veya kurum hakkında veri toplaması aşamasıdır.\nSilahlanma Aşaması:\nHedefi etkisiz hale getirmek veya aradan çıkarmak için hackerın kötü amaçlı bir yazılım oluşturmasıyla açıklanan aşamadır.\nUlaştırma Aşaması:\nE-posta veya tıklama yöntemiyle saldırganın giriş yapacağı sisteme erişmesi için gönderdiği linklerin tıklanması aşamasıdır.\nSömürme Aşaması:\nKötü amaçlı yazılım mağdurun bilgisayarına kurularak aksaklıklar istismar edilir. Malware ve diğer yazılımlar arka planda çalışmaya başlar.\nKomut ve Kontrol Aşaması:\nHedef kurum veya kişinin uzaktan kontrolü sunucu ve ağ aracılığıyla sağlanır.\nÖldürme Zinciri Aşaması:\nBilgi hırsızlığı veya öldürme zinciri aşamasını gerçekleştirerek kötü amaçlı işlemler gerçekleştirilir. Aşamalar siber güvenlik eğitimleri ile önlenebilir veya aşamalar ilerlemeden önlenebilir.\nOltalama Saldırısı Nedir, Nasıl Önlenir?\nEn sık rastlanılan dolandırıcılık türlerinden biri olan oltalama saldırıları, kanuni olmayan yöntemlerle bilgilerinizi ele geçiren siber suçlar arasındadır. Yetersiz kalan hukuki yaptırımlar gereği interneti kullanan herkesin bilinçli olması önerilir. Farklı bir adresten veya tanınan bir adresin kopyası olarak kişi veya kurumlara ulaşarak tıklama alma sonucu verilere ulaşan siber korsan dolandırıcılar insanları tuzağa düşürmeyi başardıklarında şifre, kredi kartı, banka hesabı gibi maddi kaynaklara erişim imkânı bulurlar. Özellikle şifrelerin güçsüz oluşturulması, güvenlik duvarı çözümleri kullanılması ve antivirüs çözümlerin devre dışı kalması gibi durumlarda bireylerin ağına veya kişisel hesabına erişmek suretiyle iletişime geçmeye çalışırlar. Yemleme olarak da adlandırılan bu saldırı yöntemine karşı hazırlıklı olmanız gerekir. Peki, oltalama saldırılarına karşı nasıl önlemler alabilirsiniz? İlk olarak parola yöneticinizi güçlü şifrelerle desteklemeniz gerekir. Google “password manager” programı ile kendinize daha güvenilir parolalar seçebilirsiniz. Çevrimiçi hesapların her biri için benzersiz parolalar kullanmanız siber saldırılar karşısında daha güçlü durmanızı sağlar. Tüm internet ağında aynı şifreyi kullanmak hackerlar karşısında sizi savunmasız bırakır. Parolanız oltalama (phishing) yöntemiyle dolandırıcıların eline geçerse sizin kimliğinize bürünebilir ve tüm hesaplarınız tehlikeye düşebilir. \nDolayısıyla şifre hatırlatma programlarının kullanılmaması, maillerin dikkatli açılması, özel verilerin internette gönderilen formlara doldurulmaması, çekiliş tuzaklarına düşülmemesi gibi önlemler birincil koruma sağlayabilir. Ancak kalıcı ve güvenilir bir koruma için firewall kullanımının yaygın hale gelmesi önemlidir. Firewall bilinçli bir şekilde tarafınıza ulaştırılan oltalama (phishing) saldırılarından bilgisayarınızı ve ağınızı korumakla görevlidir. \nHerkes İçin Siber Güvenlik\nHer daim hazır ve pusuda bekleyen korsanların tatil kampanyaları ve çekiliş yalanlarıyla insanları tuzaklarına düşürme gibi çabaları özellikle insanları uyarmak için basın tarafından ele alınmıştır. Siber güvenlik ürünleri ile öne çıkan Berqnet şirketi raporlarında analiz edilen global Cybersecurity Threatscape Q4 2020 raporu; dünya genelindeki e-ticaret sektörüne yönelik saldırıların, 2020 yılının son çeyreğinde bir önceki yıla nazaran yüzde 56 arttığını öne sürmektedir. 130 bin kullanıcıyı Maldiv tatili hilesiyle tuzağa düşüren korsanların aynı hile ile insanları kandırdığı konusuna haberlerde yer verilmiştir. Dolayısıyla internet kullanıcılarının bilinçsiz olduğunu öne süren güvenlik ürünleri markası Berqnet’in başlattığı sosyal sorumluluk projesi ile hacker tuzaklarının insanlara anlatılması hedeflenmektedir. \n‘Herkes İçin Siber Güvenlik’ sloganıyla herkesicinsiberguvenlik.net bağlantısında halkı bilinçlendiren ücretsiz eğitim ile bilinçsizlikten doğan güvenlik açıklarının kapatılması amaçlanmaktadır. Eğitimde edindiğiniz bilgileri tescil etmek isterseniz ücretsiz sertifika programına dahi kayıt olabilirsiniz. \nBerqnet’in Oltalama Saldırıları Üzerindeki Etkisi\nBilgisayarlara kurulan ana güvenlik duvarları ile aynı bilgisayara bağlı olan tüm ağ ve ağa bağlı bilgisayarları koruyabilirsiniz. Fakat daha karmaşık ağ ve bilgisayar saldırılarında zararlı yazılımları tespit eden, uyarı veren veya zararlı yazılıma denk geldiğinde temizleyen güvenlik cihazlarına ihtiyaç olabilir. Bu gibi ciddi durumlarda koruyuculuk hizmeti ile hackerlar ile savaşan Berqnet ürün ailesi, veri ve sistem güvenliğini her ölçekteki işletmeler için yeterli performans sağlar. Benzersiz ağ koruma özelliklerini tek kutuda sunan Berqnet, 5651 sayılı Kanun’un izin verdiği ölçüde işletmenizin kayıtlarını tutabilir. Kolay kurulum ve kullanım özellikleri ile dikkat çeken Berqnet, dünyanın en pratik firewall’u olma iddiasıyla benzersiz bir deneyim sunar. İnternetsiz hiç bir işlemin yapılmadığı günümüzde adeta bir zorunluluk olarak değerlendirilen güvenlik unsuru, kurumsallıktan bireyselliğe kadar tüm alanlarda önemli bir ayrıntı olarak dikkat çeker. İtibar kaybından, fidye ve para konularına kadar çeşitli alanlarda mağduriyet yaratan oltalama saldırısı yapan hackerlar, yerli ve milli olmasıyla dikkat çeken Berqnet’in hem çözüm sunan hem de eğiten güçlü altyapısı ile baş etmekte zorlanabilir. \nSiber tehditlere doğru ve güçlü güvenlik önlemleri alarak ağ teknolojilerini koruyan Berqnet, nitelikli ağ kullanımı ve bağlantıları ile güvenlik ekosistemi oluşturur. Ücretsiz ve sınırsız destek ile tüm işletme ve bireysel kullanıcılarının yanında olan Berqnet, oltalama tehditlerine karşı etkin koruma sağlayarak firewall ihtiyaçlarınıza çözüm üretir. Ayrıca dünya çapında yapılan araştırmalara göre çalışanların %21’i haftada en az 5 saat boyunca ilgisiz nedenlerle şirketlerin internetini kullandığı bilinir. Bu durumun önüne geçerek çalışan verimliliğini artırmak için çalışanların girdiği siteleri de web filtreleme özelliği sayesinde kontrol edebilir, izin formatını kendiniz yönetebilirsiniz. Küçük ölçekli işletmelere, orta ölçekli işletmelere ve büyük işletmelere yönelik ürünleri bulunan Berqnet’in hem çalışan verimliliğini artıran hem de saldırılardan koruyan yeni nesil güvenlik sistemleri ile tanışmanız gerekir. VPN, antivirüs, güvenli internet paylaşımı, kullanıcı dostu arayüzü ile çalışırken daha güvende hissetmek istemez misiniz? O halde yılın en iyi yerli güvenlik yazılımı olan Berqnet ile tanışarak kamu veya özel kurumunuz için korsan saldırılara aldırış etmeyebilirsiniz. \n\n21 Eylül 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Exploit Nedir, Ne Amaçla Kullanılır? Exploit Saldırıları ve En Etkili Korunma Yöntemi",
  "url": "https://berqnet.com/blog/exploit",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nExploit Nedir, Ne Amaçla Kullanılır? Exploit Saldırıları ve En Etkili Korunma Yöntemi\n\nDijital dünyada Exploit kelimesi yazılım, program, bilgisayar ya da dijital bir sistem üzerinde sistem açıklarını kullanan, kod hatalarından faydalanan, planlanmamış ve istenmeyen hatalar oluşturmak için hazırlanmış programlar ve kodlara verilen isimdir.\n\n\n\n\nBu tür kodlar ve programlar sisteme izinsiz giriş yapmayı, yetkili bir kullanıcı oluşturmayı, sistemi devre dışı bırakmayı sağlar. Çeşitli çalışma prensiplerine sahip Exploit'ler, sistemle iletişime geçerek sistemin zayıf noktalarından yararlanır ve istenilen amaca hizmet eder. Dijital güvenlik açısından büyük bir risk oluşturan bu kodlar ve programlar dijital sistemlere yapılan saldırılarda çok sık kullanılır. Yazılım ve dijital güvenlik uzmanları bu saldırıları tespit ederek ve istenmeyen işlemlerin gerçekleşmesini engelleyerek sistemlerin sağlıklı işleyişini sağlamaktadır.\nExploit Çeşitleri ve Çalışma Prensipleri\nExploit kodları ve yazılımları çalışma prensipleri, etki alanlarına göre sınıflandırılmaktadır. Sistemle iletişime geçmeye yarayan exploit'ler bu iletişimi farklı biçimlerde gerçekleştirir. Başlıca exploit çeşitleri şunlardır:\n\nRemote Exploit:Remote exploit'ler sistemle yerel ağlardan ya da internet gibi bir dijital ağdan iletişime geçer. Uzak bir exploit, ağ üzerinden çalışmakta ve güvenlik açıklarını kullanarak sisteme erişim imkânı kazanmaktadır.\nLocal Exploit:Yerel exploit'ler sistem içinde bulunan, sistemdeki yetkili kullanıcı özelliklerine ulaşmak için tasarlanmış zararlı yazılım ve kodlardır. Bu exploit'ler *.gif, *.exe benzeri dosyaların çalıştırılmasıyla devreye girer. Yerel bilgisayarda yüklü olan yazılım sayesinde exploit'te bulunan Shellcode’u çalıştırır ve zararlı kod enjekte eder. Bu sayede saldırgan sistemde yönetici hakkına sahip olarak sistem üzerinde değişiklik yapabilir.\nClient Side Exploit: Client uygulamaları ile iletişime geçen exploit'ler ağ üzerinden sistemle iletişime geçer. Bunların kullanımı için kullanıcıların veya client uygulamasının tetikleme yapması gerekmektedir. Genelde sosyal mühendislik atakları ile etkileşim sağlanır.\nDos- Exploit: Denial of Service (Dos) exploit'ler ilk tanınan zararlı kodlardandır, sistemi yavaşlatır ya da durdurmaya yarar.\nCommand-Execution-Exploit: Saldırganca kontrol edilen bu exploit'ler bir program kodunu sisteme uygulamaya imkân vermektedir. Zararlı kodun doğru çalışabilmesi için saldırgan hedef uygulamayı iyi bilmelidir. Bu bilgiler açık bir program kodu kaynağından ya da test edilerek alınabilir. Bundan sonra saldırgan kendi kodunu uygulamada en yararlı bölüme yerleştirerek çalıştırır. Hedef alınan sistemde yönetici kullanıcı hakları kazanılır ve sistem tam anlamıyla yönetilebilir.\nSQL-Injection Exploit: Structured Query Language (SQL) veri tabanlarında veri silme, veri çekme ve değiştirme işlemlerini yapan basit yapılı bir dildir. Tüm web uygulamalarında veri tabanı desteği bulunur ve uygulamalar veri tabanı ile bu dil sayesinde iletişime geçer. Örneğin bir web sitesine mesaj bırakıldığında bu mesaj veri tabanına yazılır, mesaj onaylandığında o alan güncellenmiş olur. Yöneticiler veritabanı kayıtlarını silerek web uygulamalarında rahatlıkla değişiklik yapabilmektedir. SQL injection yöntemiyle saldırgan, iletişim sağlayan SQL cümleciğini değiştirerek, araya sıkıştırılan herhangi bir meta karakter ile SQL injection sağlanır. SQL injection sayesinde birçok veri bilgisi değiştirilebilir, önemli güvenlik açıkları oluşturulur.\nZero Day Exploit: “Zero Day attack nedir?” sorusunun cevabı, yamasız işletim sistemi ve program üreticisi tarafından yaması yayımlanmamış uygulamalar üzerinden yapılan exploit saldırısı olarak verilebilir. Saldırganlar yazdıkları ya da buldukları exploit'leri sistemlere istedikleri zaman girebilmek için yayımlamayı seçerler. Son derece etkili saldırılardır, geliştirici ve üreticiler güvenlik açığı için yeni bir yama yayımlamadıkları sürece işe yaramaktadır.\n\nExploit'lerin Çalışma Mantığı ve Exploit Açıkları Nasıl Kapanır?\n\nBir exploit dijital sistemlerdeki açıklardan yararlanarak belli bir amaç dâhilinde tasarlanır. Bazı exploit'ler sisteme uzaktan bağlanmakla yetinirken, bazıları sistemi devre dışı bırakmak amacıyla düzenlenmiştir. Saldırganlara amaçları doğrultusunda fayda sağlayan etkili exploit'ler sisteme giriş ya da sistemde yetkili kullanıcı oluşturmak için tasarlanmıştır. Zararlı kodlar ve yazılımlar sayesinde dijital sisteme düşük seviyeli bir kullanıcı ile giriş yapmak, daha sonra sistemde yetkileri yükseltmek ve yetkili bir kullanıcı oluşturma olasılığı bulunmaktadır. Günümüzde kullanılan exploit'ler çoğunlukla yazılım exploit'leridir. Bu yazılımlar işletim sistemi ya da üçüncü parti bir yazılımdaki açıkları değerlendirerek saldırganın amacına hizmet eder.\nZararlı yazılımlar ve kodlar ile meydana gelen sistem zaaflarını engellemek için işletim sistemi ya da uygulamalar üzerinde yamalar yapılması gerekir. Program sahipleri ve işletim sistemi yazılımcıları kodlarda düzenleme yaparlar ve bunları yama paketi olarak son kullanıcıya sunarlar. Böylelikle işletim sistemi ya da programlar güncel tutularak istenmeyen saldırılara karşı güvenlik açıkları kapatılır. Örneğin Windows işletim sisteminin güvenlik açığından yararlanan bir exploit için Microsoft şirketi durum değerlendirmesi yapar ve güvenlik açığı için bir yama yayımlar. Bu yama kurulduğunda artık Windows işletim sistemi saldırganın tasarladığı exploit'ten etkilenmez.\nZero Day exploit yaması bulunmayan işletim sistemlerine ve programlara saldırması açısından son derece etkilidir. Çok fazla kullanılan exploit'ler giriş yöntemlerinin anlaşılması ile tanımlanır. Güvenlik yazılım uzmanları sistemleri inceler ve zaafları tespit eder, güvenlik açıkları yamalar ile kapatılır. Zero Day exploit'ler yeraltı pazarları, kirli pazar olarak bilinen Underground Marketlerde paylaşılır ve satılır. Bu exploit'ler hem saldırganlar hem de güvenlik uzmanları tarafından satın alınabilir, ciddi rakamlarla bu piyasalarda işlem görürler.\nExploit'ler herhangi bir işletim sistemi ve program için yazılabilir. Windows, Unix, MacOs, Linux, Adobe Flash, Java, Adobe Reader benzeri işletim sistemi ve programlar için tasarlanan exploit'ler mevcuttur. Bu işletim sistemlerinin ve programların güvenlik açıklarına yönelik üretilen zararlı kodlar ve yazılımlar sistemle ve programla etkileşime geçerek saldırganın amacına hizmet eder. Bu exploit'ler herhangi bir donanım ya da dijital sistem için de üretilebilir.\nPivoting yöntemi ile bir sistemi ele geçiren saldırgan bu sistem üzerinden farklı sistemlere de saldırabilir. Güvenlik engellerini aşmak için kullanılan bu yöntemle, önce networke giriş izni bulunan bir makine ele geçirilir, sisteme giriş sağlanır ve sistem üzerinden diğer makinelere sızma sağlanır. Bu sayede saldırganlar çok güvenli sanılan sanal ağlara ulaşma imkânı bulur ve amaçlarına yönelik her türlü zararlı yazılımı, kodu işletim sistemlerine ve programlara ekler.\nExploit Saldırılarından Nasıl Korunulur?\nExploit saldırılarından korunmak, bilgisayarları ve verileri güvende tutmak için bireyler ve kuruluşlar en iyi siber güvenlik uygulamalarını takip etmelidir. Alınacak önlemler arasında şunlar sayılabilir:\n\nYazılımları ve işletim sistemlerini güncel tutma: Yazılımların ve işletim sistemlerinin yeni sürümlerinde tanımlanmış güvenlik açıklarına karşı güvenlik yamaları sunulur. Güncelleştirmeler sayesinde daha güvende olmak mümkündür.\nSadece gerekli uygulamaları kullanma: Her yeni uygulama sistemde güvenlik açığı oluşmasına neden olabilir. Sadece ihtiyaç duyulan uygulamaları kullanmak sistem ağının daha az riskle karşılaşmasına yardımcı olacaktır.\nEtkili bir güvenlik duvarı kullanma: Güvenlik duvarı sistemin exploit saldırılarına karşı korunmasını sağlayacaktır. Güvenlik duvarı yalnızca gerekli işlemlere izin verir, bu şekilde maksimum koruma sağlar.\nKuruluş kullanıcılarını eğitme: İnsan hatalarından kaynaklı riskler için çalışanlar ve sistem kullanıcıları eğitilmelidir. Dijital tehditlerden korunmak adına kullanıcıların gerekli bilgi ve alışkanlıkları edinmeleri gerekir.\nAntivirüs yazılım çözümü kullanma: Tam koruma sağlayan, etkili antivirüs yazılımları dijital sistemleri bilinen ve henüz tespit edilmemiş tehditlere karşı güvende tutmaya yardımcı olacaktır.\n\nGüvenlik duvarı ile desteklenen işletim sistemleri ve yazılımlar en az riske maruz kalacak, sistemin güven içinde kullanılmasını sağlayacaktır.\nBerqnet Güvencesi ile Exploit Saldırılarından Korunma\nExploit saldırıları karşısında etkili bir çözüm olan Berqnet, dünyanın en kolay kurulan ve fonksiyonel bir biçimde yönetilen güvenlik duvarı cihazıdır. 2013 yılında profesyonel Ar-Ge kadrosu ile firmaların siber güvenlik ihtiyaçlarına çözümler üretmek amacıyla Ar-Ge çalışmalarına başlayan Berqnet, 2015 yılında ilk güvenlik yazılımı ürün ailesini piyasaya sürmüştür. Berqnet, kurumların ve işletmelerin veri-sistem güvenliğini korumak üzere LOGO Siber Güvenlik ve Ağ Teknolojileri A.Ş. çatısı altında faaliyetlerine devam etmektedir. Berqnet Güvenlik Duvarı serisi, veri güvenliği, yasallık, verimlilik ilkeleri ve yerel işletmelerin özel kullanım ihtiyaçları göz önünde bulundurularak geliştirilmiştir. TESİD tarafından KOBİ Kategorisinde En Yenilikçi Ürün ödülüne layık görülen Berqnet, BTVizyon tarafından da yılın en iyi güvenlik yazılımı unvanını almıştır. Berqnet, bağımsız güvenlik analiz şirketi Corvues Security Consultancy tarafından internet taraması, beyaz kutu, gri kutu, kara kutu derin tarama yöntemleri ile ilgili olarak test edilmiş, tüm güvenlik analizlerinden başarıyla geçmiş ve güvenlik alanında doğru seçim olduğunu belgelenmiştir.\n\n6 Kasım 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "XSS Zafiyeti (Cross-Site Scripting) nedir?",
  "url": "https://berqnet.com/blog/xss-zafiyeti-cross-site-scripting",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nXSS Zafiyeti (Cross-Site Scripting) nedir?\n\nXSS zafiyeti olarak da bilinen siteler arası komut dosyası oluşturma, bir saldırganın, güvenlik açığı bulunan bir web uygulamasına...\n\n\n\n\nSaldırgan, bu güvenlik açığı ile web tarayıcısında kötü amaçlı komut dosyalarını çalıştırmayı amaçlar. XSS güvenlik açıkları, en yaygın web güvenlik sorunları arasındadır. Kötü amaçlı komut dosyaları gönderen web uygulamalarını hedefleyen bir kod enjeksiyon güvenlik saldırısıdır. Siteler arası komut dosyası çalıştırma; oturumların ele geçirilmesine, hassas verilerin açığa çıkmasına ve daha kötü sonuçlara yol açabilir. XSS saldırıları, uygulamanın ana bilgisayarının kendisini hedeflemek yerine, genellikle uygulamanın kullanıcılarını doğrudan hedefler.\nXSS Nasıl Çalışır?\nXSS zafiyetinde, savunmasız bir web sitesi üzerinden kötü amaçlı içerik JavaScript kullanılarak ve manipüle edilerek kullanıcılara saldırılır. Bir web sayfası veya uygulaması, HTML kodunu dinamik olarak oluşturmak için temizlenmemiş kullanıcı girdisi kullanıyorsa XSS'ye karşı savunmasızdır. Bu girdi kötü amaçlı bir komut dosyası içeriyorsa, sayfa koduna eklenir ve tarayıcı tarafından geçerli bağlamda yürütülür. Bu durumda çok çeşitli komut dosyası tabanlı saldırılara yol açar. CSS, VBScript, ActiveX ve Flash üzerinden XSS saldırıları yapılması olasıdır. Ancak, modern XSS zafiyetinde JavaScript son derece yaygındır, çünkü JavaScript çoğu tarama deneyimi için temel oluşturur. ''XSS nasıl çalışır?'' sorusunun cevabını detaylı şekilde aşağıdaki maddelerde bulabilirsiniz:\n\nSiber suçlular hedef web sitelerini seçer ve kullanıcı girdisini kabul eden savunmasız işlevlerinin kapsamını belirler. Örnekler arama çubukları, oturum açma formları ve yorum kutularıdır.\nSeçtikleri işleve kötü amaçlı kod girerler. Kötü amaçlı kod, diğerleri arasında HTML veya JavaScript gibi programlama dili kullanılarak yazılabilir.\nKötü amaçlı kod, işlevden kaynaklanan web sayfasına eklenir. O web sayfasının bir parçası haline gelerek onu tehlikeye atar.\nKodun nasıl enjekte edildiğine bağlı olarak, kötü niyetli içerik gerçek web sayfasının kendisinde bile olmayabilir, bunun yerine yalnızca web sitesinin bir parçası gibi görünen geçici bir öge olabilir. Bu, gerçekte olmadığı halde web sitesinin tehlikede olduğu yanılsamasını yaratabilir.\nKullanıcılar, siber suçlular tarafından bu sayfaya bağlanarak güvenliği ihlal edilen web sayfasının kurbanı olabilirler.\n\nJavaScript Nedir ve Siber Suçlu JavaScript ile Ne Yapabilir?\nJavaScript, web sayfalarını dinamik ve daha etkileşimli hale getirmek için yaygın olarak kullanılan metin tabanlı bir programlama dilidir. JavaScript, görüntü karuselleri, bir web sayfasında medya oynatma ve geri sayımları ve zamanlayıcıları görüntüleme gibi özellikler için işlevsellik sunar. Her gün kullanabileceğiniz Twitter özet akışınızı yenileme veya Amazon'daki arama kutusu JavaScript'e örnek olarak verilebilir. JavaScript, web sayfalarını kullanıcı odaklı olacak bir şekilde geliştirir ve kullanıcıların siteye geri gelmesini sağlayabilir. Bu programlama dili; HTML içeriğini, özellik değerlerini, stillerini değiştirebilir; aynı zamanda HTML ögelerini gizleyebilir veya gösterebilir.\nBu programlama dilinin avantajları şu şekilde sıralanabilir:\n\nSayfayı sunucuya göndermeden önce kullanıcı girişini doğrulamaya imkân tanır. Bu, sunucu trafiğinden tasarruf sağlayarak sunucunuza daha az yük binmesi anlamı taşır.\nZiyaretçilere anında geri bildirim olanağı sağlar.\nKullanıcılara artırılmış etkileşim sunar.\nWeb sitesine zengin arayüz sağlamak için sürükle, bırak bileşenleri ve kaydırıcılar gibi ögeleri eklemeye olanak verir.\n\nJavaScript, kötü amaçlı içeriğin bir parçası olarak kullanıldığında tehlikeli olabilir. Bunlar:\n\nKötü amaçlı JavaScript, web sayfasının erişebildiği her şeye erişmeye imkân tanır. Bu sayede saldırgan, bir kullanıcının tüm oturum bilgilerini elde ederek, o kullanıcı adına işlemler yapabilir. Birçok hassas veriye erişim sağlayabilir.\nJavaScript, tarayıcı DOM okuyabilir ve üzerinde değişiklikler yapabilir. Bu yalnızca JavaScript'in çalıştığı sayfada olasıdır.\nModern tarayıcılardaki JavaScript, HTML5 API'lerini kullanabilir. Örneğin; kullanıcının konumu, kamerası ve dosyalarına ulaşabilir. Bu API'lar genellikle, kullanıcı katılımı gerektirir ve saldırgan bunu başarmak için sosyal mühendisliği kullanabilir. Bu durum siber suçluların, çerez hırsızlığı, Truva atı yerleştirme, tuş günlüğü, kimlik avı hırsızlığı gibi büyük saldırıları yapabilmesine fırsat verir.  XSS zafiyetleri, ciddi saldırılar için son derece uygun bir ortam yaratır.\n\nXSS Saldırı Türleri Nelerdir?\nEn yaygın üç XSS saldırısı türü bulunmaktadır. Bunlar:\n\nKalıcı XSS:Depolanmış XSS olarak da bilinen bu güvenlik açığı, güvenilmeyen veya doğrulanmamış kullanıcı girişi bir hedef sunucuda depolandığında ortaya çıkar. Kalıcı XSS için ortak hedefler arasında mesaj forumları, yorum alanları veya ziyaretçi günlükleri yer alır; bu, kimliği doğrulanmış veya doğrulanmamış diğer kullanıcıların saldırganın kötü amaçlı içeriğini görüntüleyeceği herhangi bir özelliktir. Sosyal medya sitelerinde ve üyelik gruplarında yaygın olarak bulunan herkesin görebileceği profil sayfaları, kalıcı XSS için iyi bir örnektir. Saldırgan, profil kutularına kötü amaçlı komut dosyaları girebilir ve diğer kullanıcılar profili ziyaret ettiğinde, tarayıcıları kodu otomatik olarak yürütür.\nYansıtıcı XSS:Kullanıcı girdisinin hemen geri gönderilmesini içerir. Çoğu durumda, yansıtıcı XSS saldırıları, hedeflenen kullanıcıya gönderilen kimlik avı e-postalarına veya kısaltılmış veya başka şekilde gizlenmiş URL'lere dayanır. Mağdur, bağlantıyı ziyaret ettiğinde, komut dosyası tarayıcılarında otomatik olarak yürütülür. Arama sonuçları ve hata mesajı sayfaları, yansıtılan XSS için iki ortak hedeftir.\nDOM Tabanlı XSS: Genellikle zarar verici bir komut dosyası içeren kötü amaçlı bir URL aracılığıyla teslim edildiğinden yansıyan XSS ile bazı benzerliklere sahiptir. Saldırı DOM veya Belge Nesne Modeli değiştirilerek tamamen tarayıcıda yürütülür. Bu durum, sayfada bulunan JavaScript'in kullanıcı girişini düzgün bir şekilde sterilize etmedeki başarısızlığını hedefler.\n\nXSS Zafiyeti Nasıl Önlenir?\nSiteler arası komut dosyası çalıştırmanın önüne geçmek basit değildir. Güvenlik açığının türü, kullanıcı girdisi gibi birçok etkene bağlıdır. Web uygulamalarınızın güvenliğini sağlamak için dikkat etmeniz gereken bazı genel stratejik temeller bulunur. Bunlar:\n\nWeb uygulamanızın güvenli kalmasını sağlamak için, uygulamayı oluşturmak ile ilgili tüm kişilerin güvenlik açığı risklerinin farkında olması önemlidir. Geliştiricilerinize ve personelinize uygun güvenlik eğitimlerini sağlamalısınız.\nHerhangi bir kullanıcı girişi, bir XSS riski barındırır. Bu nedenle tüm kullanıcı girişlerini güvenilmeyen olarak kabul etmelisiniz. Bu nedenle tüm kullanıcılardan gelen girişleri, genel girişlere yaklaştığınız şekilde yaklaşmalısınız.\nKullanıcı girişleri için; HTML çıkışı, JavaScript çıkışı, CSS çıkışı, URL çıkışı uygun bir çıkış ve kodlama tekniği kullanmalısınız. Çıkış için mevcut kitaplıkları kullanmalı ve gerekmedikçe kendi kitaplıklarınızı yazmamalısınız.\nHTML içermesi gereken kullanıcı girişleri geçerli etiketleri kırabileceğinden kodlama yapmaya izin vermez. Bu nedenle doğrulanmış ve güvenilir bir kitaplık kullanılması önem taşır.\nXSS güvenlik açığının zararlarını en aza indirmek için HttpOnly bayrağını ayarlamalısınız. HttpOnly bayrağı sayesinde tanımlama bilgilerine siber saldırgan JavaScript aracılığıyla erişim sağlayamaz.\nAyrıca bir XSS güvenlik açığının sonuçlarını minimum seviyeye indirmek için İçerik Güvenliği Politikası (CSP)kullanmalısınız. CSP, XSS ve bazı saldırı çeşitlerini algılamaya ve azaltmaya destek olan ek güvenlik katmanıdır. CSP, web siteniz için bir kapı bekçisidir.\n\nXSS güvenlik açıkları, geliştiriciler tarafından veya harici kitaplıklar ve yazılımlar aracılığıyla oluşabilir. Berqnet firewall ürünleri gibi ileri düzey siber koruma özellikleri sunan cihazlarla web uygulamalarınızı kontrol altında tutmalı ve denetlemelisiniz.\nXSS Zafiyeti Sonuçları Nelerdir?\nBir XSS saldırısının sonucu, türü fark etmeksizin aynıdır. Saldırıların arasındaki fark, yükün sunucuya nasıl ulaştığıdır. XSS, son kullanıcı için, bir sıkıntıdan tam hesap uzlaşmasına kadar önem derecesinde değişen çeşitli sorunlara neden olabilir. En şiddetli XSS saldırıları, kullanıcının oturum çerezinin ifşa edilmesini içerir ve saldırganın kullanıcının oturumunu ele geçirmesine olanak tanır. Diğer zararlı saldırılar; son kullanıcı dosyalarının ifşa edilmesini, Truva atı programlarının yüklenmesini, kullanıcıyı başka bir sayfaya, siteye yönlendirmeyi veya içeriğin sunumunu değiştirmeyi içerir. Başarılı bir siteler arası komut dosyası saldırısı, çevrimiçi bir işletmenin itibarı ve müşterileriyle olan ilişkisi için yıkıcı sonuçlar doğurabilir. Bir saldırganın bir basın bültenini veya haber ögesini değiştirmesine izin veren bir XSS güvenlik açığı, bir şirketin hisse senedi fiyatını etkileyebilir veya tüketici güvenini azaltabilir. Örneğin; ilaç, kimya ya da eczacılık alanındaki bir sitedeki XSS zafiyeti, siber saldırganın doz bilgisini değiştirerek aşırı doza yol açmasına neden olabilir.\nBerqnet XSS Açıklarından Kurtulmak İçin Neler Yapar?\nGüvenli kodlama uygulamaları, XSS güvenlik açıklarının ortaya çıkmasını önlemeye yardımcı olabilir. Berqnet, işletmelerin iş operasyonları için kritik olan yazılımların korunmasına yardımcı olan lider uygulama güvenliği çözümleri sunar. Firewall sistemi; tüm ağ trafiğini kontrol eder, filtrelerden geçirir ve bu trafik içerisindeki zararlı eylemleri durdurmayı hedefler. Şirket içi ya da dışı ağlardan gelebilecek olan saldırılara karşı koruma ve denetleme sağlar. Kurallara uymayan dolaşımı engeller ve sadece izin verilen trafiğin geçebileceği bir yapı oluşturur.\nBerqnet firewall cihazları, bir uygulama için kontrol ve veri akışını hızlı bir şekilde tarayabilir, XSS zafiyetlerini, şirket içinde oluşturulan veya üçüncü taraflardan edinilen kod kusurlarını doğru bir şekilde belirleyebilir. Berqnet, web uygulamalarını test eder, internete yönelik uygulamaları keşfeder ve envanterini çıkarır. SQL enjeksiyon açıkları, CSRF saldırıları, LDAP enjeksiyonları ve mobil uygulama kusurları dahil olmak üzere güvenlik açıklarını tarar. Web uygulamalarını verimli bir şekilde tarar, güvenlik açıklarını bulur ve geliştiricilere, uygulamanız yayınlanmadan önce sorunları çözmeleri için rehberlik eder.\nWeb uygulamalarınızı saldırı riskine sokan güvenlik açıklarını hızla bulmak ve düzeltmek, siber saldırılara maruz kalmamak için Berqnet firewall cihazlarını detaylı bir şekilde inceleyebilirsiniz. Siz de sınırlı zamanınızda çok fazla vakit harcamadan işlerinize odaklanmak ve güvenin verdiği huzurun tadını çıkarmak istiyorsanız bizimle iletişime geçebilirsiniz.\nXSS Zafiyeti Hakkında Sık Sorulan Sorular\nXSS güvenlik açıkları ne kadar yaygındır? XSS güvenlik açıkları çok yaygındır ve XSS, muhtemelen en sık görülen web güvenlik açığıdır.\nSiteler Arası Komut Dosyası Nasıl Keşfedilir? Siteler arası komut dosyası çalıştırmayı keşfetmek için manuel sızma testi yapabilir veya önce bir güvenlik açığı tarayıcısı kullanabilirsiniz. Bir güvenlik açığı tarayıcısı kullanmanız, penetrasyon testçilerinizin daha zorlu güvenlik açıklarına odaklanabilmesine fırsat tanır. Bu da size daha çok zaman ve para kazandırır.\nXSS ve CSRF arasındaki fark nedir? XSS, bir web sitesinin kötü amaçlı JavaScript manipülesine neden olmayı içerirken; CSRF, kurban bir kullanıcıyı yapmak istemediği eylemleri gerçekleştirmeye teşvik etmeyi içerir.\nXSS ve SQL enjeksiyonu arasındaki fark nedir?\nXSS, diğer uygulama kullanıcılarını hedefleyen bir istemci tarafı güvenlik açığı iken; SQL enjeksiyonu, uygulamanın veri tabanını hedefleyen sunucu tarafı bir güvenlik açığıdır.\nJava'da XSS'yi nasıl önleyebilirim?\nGirdilerinizi izin verilen karakterlerden oluşan bir beyaz listeyle filtreleyerek çıktınızı HTML kodlamak için Google Guava gibi bir kitaplık kullanabilir veya JavaScript bağlamları için JavaScript Unicode çıkışlarını kullanabilirsiniz.\nSiteler Arası Komut Dosyasına Karşı Nasıl Korunulur?\nWeb sitenizi veya web uygulamanızı düzenli olarak taramanız gerekir. Ardından, geliştiricilerinizin güvenlik açığını ortadan kaldırmak için kodu düzeltmesi gerekir. Ayrıca web uygulaması güvenlik duvarları ile saldırıları daha zor hale getirebilirsiniz.\n\n3 Kasım 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "İnternetten Güvenli Alışveriş Nasıl Yapılır?",
  "url": "https://berqnet.com/blog/internetten-guvenli-alisveris-nasil-yapilir",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nİnternetten Güvenli Alışveriş Nasıl Yapılır?\n\nHızla yaygınlaşan internet alışverişi, veri güvenliği ve dijital dolandırıcılık konularını gündeme getirmiştir. Hızlı ve daha tasarruflu alışveriş imkânı sunan online alışverişlerde, bazı önemli noktalara dikkat ederek güvenliğinizi sağlayabilirsiniz.\n\n\n\n\nEvden alışverişin rahatlık, hız, gönderim kolaylığı gibi pratik avantajları vardır. Ayrıca günün her saati ya da dünyanın her yerinden alışveriş yapabilmek gibi sınırsız özgürlükler de sunar. Özellikle pandemi döneminde, kalabalıktan uzak, evden alışveriş yapma imkanı sunduğu için tüketicinin birincil tercihi online alışveriş olmuştur. Bunun yanı sıra internetten yapılan alışverişe özel kampanyalar, indirim kuponları ve hediyeleri sunan alışveriş siteleri de tüketiciyi online alışverişe yönlendiren motivasyonlardır. Online alışveriş her zaman en kolay ve çabuk yöntem olsa da her online alışveriş güvenli alışveriş anlamına gelmez.\nŞirketler ve bireysel kullanıcılar için dijitalleşmenin hızla ilerlediği sanal dünyada önlem almak dolandırıcılara karşı korunmanıza yardımcı olabilir. İnternet alışverişinde yaşanan problemlerin yanı sıra şirketler için siber saldırı tehdidi de bulunmaktadır. Şirketinizin sanal ortamda bilgi ve veri güvenliğini sağlamak için çeşitli yöntemlere başvurabilir, donanım sistemleri sayesinde internet üzerinden gelebilecek tehlikelere karşı önlem alabilirsiniz.\nİnternet Alışverişinde Kişisel Veri Güvenliğinin Önemi\nBireysel kullanıcılar ve şirketler için pratik alışveriş yöntemlerinden biri olan internet alışverişi, her geçen gün daha yoğun şekilde tercih edilmektedir. Alışveriş yaparken kredi kartı kullanımının artması ile birlikte online alışveriş de yükselişe geçmiştir. İnternetten alışveriş yapan birçok kullanıcı için siber tehditler önemli problemler arasında yer alır. Kişisel veri güvenliği açısından dijital dünyada yapılan her işlemde dikkatli olmak tehditlere karşı koruma sağlayabilir. Kredi kartları aracılığı ile yapılan internetten alışverişlerde bazı önlemler sizi karşılaşabileceğiniz istenmeyen durumlara karşı koruyabilir. Sahte internet siteleri, veri güvenliğini sağlamayan ve kart bilgilerini çalan sistemler, virüs saldırıları gibi birçok yöntem kişisel veri güvenliğini tehdit etmektedir\nİstatistik Verileri ile Alışveriş ve Siber Saldırılar\nBankalararası Kart Merkezi tarafından yayımlanan kart ile satış raporları, online alışveriş konusunda da fikir vermektedir. Buna göre 2021 yılı Temmuz ayına kadar yerli kartlarla yurt içinde ve dışında yaklaşık 790 milyon adet işlem yapılmıştır. Bankalararası Kart Merkezinin “İnternetten Yapılan Kartlı Ödeme İşlemleri” araştırmalarına göre 2019 - 2020 yılları arasında işlem adedi açısından %41’lik bir artış görülmektedir. 2020 yılından 2021 yılı Temmuz ayına kadar olan artış ise %21’dir. Bu artışın en önemli nedenlerinden birisi de internet üzerinden alışverişin artması olmuştur. Öte yandan, internet suçları kapsamında, Interpol tarafından yayımlanan bir siber suçlar raporuna göre de evde kalınan dönemlerin henüz başında kaydedilen siber ataklar, bir önceki döneme göre %569 oranında artış göstermiştir. Bu dramatik artış, domain kayıtlarında kötü amaçlı yazılım ve kimlik avı gibi siber saldırıları da kapsamaktadır. Bunun yanı sıra, saldırganlar promosyon maske, dezenfektan gibi yanıltıcı yönlendirmelerle de oltalama saldırısı yapmaya çalışmışlardır.\nAvantajlı ve hızlı olsa da alışverişin güvenlikli olmaması tüketiciyi durdurur. Bu nedenle online siteler, kendi bütçelerine ve yapılarına göre çeşitli siber güvenlik önlemleri almaktadır. Üstelik sızma (penetrasyon) testi gibi çeşitli testlerle kendi açıklarını kontrol edip güncelleme yaparlar. Ancak, tüketicinin de alışveriş yaptığı online sitenin güvenli olup olmadığını kontrol etmesi önem taşır. Her gün karşınıza çıkan binlerce sitenin güvenilir olup olmadığından nasıl emin olabilirsiniz? Güvenli siteyi dolandırıcı olandan nasıl ayırabilirsiniz? Sosyal mühendislik gerektirmeyen basit, pratik birkaç detaya dikkat ederek sahtekarlardan kendinizi korumanız çok kolaydır.\nSiber Suçlular Nasıl Başarılı Olabiliyor?\nOnline alışveriş siteleri, çevrimiçi alışverişi tüketicinin beğeni kriterlerinden kredi kartı bilgilerine kadar tüm datayı saklayacak şekilde güvenlikli hale getirir. Buna rağmen, tüketicinin kendi oluşturduğu açıklar nedeni ile sitenin güvenlik problemleri olduğu algısı da oluşabilir. Siber suçlular da aslında tüketicinin oluşturduğu açıklara güvenerek saldırı organize eder.\nKimlik avı yapan kişiler, bir bilinmeze güvenir: Size gönderdikleri e-mail adresi sahte mi gerçek mi? Güvenilir olmayan e-mail adreslerine tıklamanızı ve mail göndermenizi bekler. Böylelikle bilgileriniz karşı tarafın eline geçmiş olur.\nHesabın ele geçirilmesi için belirlediğiniz parola da önemlidir. Bunun yanı sıra tüm hesaplarda aynı parolayı kullanmanız onlar için biçilmiş kaftandır. Kişisel hesaplarınıza hangi ağı kullanarak girdiğiniz de önemlidir. Tüketicinin oluşturacağı her türlü güvenlik açığı ile siber saldırganın banka hesabı ve şifrelere ihtiyacı olmaz, tüketicinin kimlik bilgileri dolandırıcının bir dizi finansal işlemi yapabilmesi için yeterlidir.\nİnternetten Güvenli Alışveriş Nasıl Yapılır?\nOnline alışveriş yapan kullanıcıların sıklıkla karşılaştığı siber tehditlerden biri sahte sitelerdir. Dijital dolandırıcılar kendilerine ait olmayan ürünleri, tamamen gerçek görünen profesyonel siteler üzerinden satışa çıkararak birçok kişiyi mağdur etmektedir. Ürün ve hizmetleri satmak için hazırlanan sahte internet siteleri, çoğunlukla itibar gören önemli markaların siteleri ile benzer şekilde hazırlanır. Kullanıcıya güven veren tasarımlarda hazırlanan sitelerde kredi kartı bilgileri çalınabilir, kişisel bilgileriniz ile ilgili sorular sorularak veri güvenliği tehdit edilebilir. Alışveriş yaptığınız internet sitesinin güvenli olduğundan emin olmak için öncelikle doğru arama motorlarını kullanmanız gerekir. Güvenilir arama motorlarını tercih ederek daha doğru sonuçlara ulaşabilirsiniz. İnternetten alışveriş yaparken şunlara dikkat ederek kişisel verilerinizin güvenliğini sağlayabilirsiniz:\n\nAlışveriş yaptığınız site ile ilgili yorumlara göz atarak farklı kullanıcıların gerçek deneyimlerine ulaşabilirsiniz.\nSatın almayı düşündüğünüz ürünün fiyatı gereğinden fazla ucuz ise siteye şüpheyle yaklaşabilirsiniz.\nAlışveriş sitesinde iletişim bilgilerinin gerçek olup olmadığını kontrol ederek satıcı firma hakkında bilgi edinebilirsiniz.\nAlışverişinizi güvenli bilgisayarlar ve internet bağlantılarından yapmaya özen gösterebilirsiniz.\n\n1- URL Tamamlama Özelliğine Dikkat Edin\nBerqnet’e göre, çalışan kişilerin %21’i, haftada ortalama 5 saat, işlerinin haricindeki sitelere de giriş yaparlar. Bu girişlere, daha önceden ziyaret edilen siteler de dâhildir. İnternette daha önceden yazmış olduğunuz URL adresleri, bilgisayarınız tarafından otomatik olarak tamamlanır. Bu tamamlama, kimi zaman, bir açık yakalamış ve o URL’yi kendi adresine yönlendirmiş siber dolandırıcılar tarafından kullanılır. Bu durum, sizin o adrese gitmenize ve orada kendi bilgilerinizi vermenize neden olur. Bu nedenle adres tamamlayıcı kullanmadan, alışveriş yapacağınız sitenin adresini tam olarak browser’a yazmanız önemlidir. Ayrıca, siber güvenlik açıkları bulan dolandırıcılar, kimi zaman e-mailler göndererek bazı siteler için link verebilirler. Bu durumda da siteye girmek için bu linki kullanmak yerine verilen sitenin ismini browser’a direkt yazmanız da güvenlik açığından kurtulmanızı sağlayacaktır.\n2- Sanal Kart ile Alışveriş Yapın\nSiber suçluların sizin hesaplarınıza en kolay şekilde erişim sağlayabilecekleri yöntem, kredi kartı bilgilerinizi ele geçirmek için yazdıkları karmaşık kodlardır. Online alışverişlerde güvenli bir şekilde hesabınızı korumak için normal kredi kartı yerine geçici kredi kartı numarası edinebilirsiniz. Düzenli ödeme yapmadığınız tüm işlemler için bu kartları kullanabilirsiniz. Bankalar, konuyla ilgili olarak çeşitli hizmetler vermektedir. Kimi uygulamalarda, geçici kredi kartı yerine sanal kredi kartı ya da sanal hesap ile de aynı güvenlik önlemini almanızı sağlarlar. Sanal hesaplar da her kullanım için rastgele bir hesap numarası oluşturur ve bir sonraki satın alma işleminde geçersiz olur. Böylelikle bilgisayar korsanları sizin kart numaranıza ulaşamaz. Bunun yanı sıra başka bir önlem olarak, sanal kartınızın limitini alışveriş yapacağınız miktar kadar ayarlayıp alışverişinizi tamamladıktan sonra kartınızın limitini sıfırlayabilirsiniz.\n3- Sanal POS Uygulamasını Tercih Edin\nİnternet alışverişini kullanıcılar için daha güvenli hale getiren sanal POS uygulaması tüm güvenilir firmalar tarafından tercih edilir. Alışveriş yaptığınız internet sitesinde mutlaka online ödeme özelliği bulunup bulunmadığına bakmalısınız. BDDK lisanslı ödeme hizmetleri sunan şirketler ve bankalar, internet sitelerinde satış yapan kişileri sanal POS vermeden önce ayrıntılı şekilde araştırır. Bankalar ile anlaşması olmayan kişiler çoğunlukla kapıda ödeme seçeneğini kullanmaktadır. Sahte ve yanlış ürün gönderimi riski taşıyan kapıda ödeme seçeneği çoğunlukla güvenilmez firmalar tarafından tercih edilir. Ödeme yöntemleri konusunda dikkatli davranarak dijital dolandırıcılara karşı önlem alabilirsiniz.\n4- 3D Secure Sistemini Kullanın\nKredi kartı ile yapılan online alışveriş, çeşitli güvenlik sistemleri aracılığı ile daha doğru şekilde tamamlanabilir. 3D Secure sistemi, kredi kartı ödemelerini güvence altına alan ve yaygın şekilde kullanılan yöntemlerden biridir. Kartınızdan para çekilmeden önce bankanız tarafından size onay şifresi gönderen sistem, kart ile yapılan tüm alışverişlerden haberdar olmanıza yardımcı olur. Telefonunuza gelen onay kodunu 3D Secure sistemine girmeden kartınızda para çekilmesine engel olan sistem, online alışverişlerde güvenliği sağlar.\n5- Alışveriş Yaptığınız Sitenin Gerçekliğinden Emin Olun\nİnternet alışverişi yaptığınız sitenin gerçek bir site olup olmadığını öğrenmenin en iyi yolu, siteyi devlet verileri üzerinden sorgulamaktır. Bunun için sitenin ismini e-ticaret bilgi sistemi içindeki “Kayıtlı Site Sorgula” satırına yazarak arama yapabilirsiniz. Sitenin doğrulanmış olduğuna dair yeşil tik’i gördükten sonra alışverişinizi sürdürebilirsiniz. Bunun yanı sıra, siteye girdiğinizde imla hatalarına, abartılı ifadelere, çok yıldızlı yorumlara da dikkat etmeniz önemlidir.\n \n \n6- SSL Sertifikasını Kontrol Edin\nKart güvenliğini sağlamanın bir diğer yolu ise SSL sertifikasıdır. Dijital bir sertifika olan SSL, web sitelerinin kimliğini doğrular. Şifreli bağlantı sayesinde internet sitesinde girdiğiniz kişisel ve kart bilgileriniz güvenli şekilde korunur. Kredi kartlarının başkaları tarafından kopyalanmasını engelleyen sisteme ek olarak sanal kart kullanımına geçebilirsiniz. Yüksek limitli bir kredi kartı yerine yalnızca internet alışverişlerinde kullanabileceğiniz sanal kart ile dijital dolandırıcılık riskini minimuma indirebilirsiniz. Ayrıca güvendiğiniz ve herkese açık olmayan bilgisayarları kullanmak da kişisel veri güvenliğini sağlamanın önemli aşamalarından biridir. İnternet kafe gibi herkese açık bilgisayarların yer aldığı alanlarda şifrenizi ve kart bilgilerinizi paylaşmamaya dikkat edebilirsiniz.\n7- Kullandığınız Bilgisayarı ve E-mail Adresini İzole Edin\nEğer evde birden fazla bilgisayar varsa bir tanesini sadece online alışveriş ve internet bankacılığı için kullanabilirsiniz. Bu bilgisayar ile internette gezinme, dosya indirme, e-mailleri kontrol etme, sosyal ağlarda vakit geçirme gibi etkinlikleri yapmayarak, bir çeşit izolasyon sağlayabilirseniz virüs ve çeşitli saldırılardan uzaklaşmış da olursunuz. Aynı şekilde, sadece bu işler için oluşturduğunuz bir e-mail adresi de işe yarayacaktır. Diğer internet sitelerine bu bilgiyi vermeyeceğiniz için bir çeşit izolasyon sağlamış olursunuz.\n8- Güvenli Şifreler Belirleyin\nGüçlü şifreler kullanmak her zaman güvenlikte kalmanızı sağlar. Basit şifreler her zaman ele geçirilir, hele ki sizinle bağlantılı (evlilik tarihi, çocukların doğum tarihi gibi) bilgiler siber saldırganlar için bulunmaz nimettir. Bir hesabınızın şifresini ele geçirdikten sonra sizinle bağlantılı tüm hesaplarda aynı şifreyi denerler. Bu nedenle de her hesabınızın şifresini ayrı tutmanız önemlidir. Güçlü şifrelerin akılda kalması zor olduğu için parola yöneticisi kullanabilirsiniz.\n9- VPN Kullanın\nHerkese açık Wi-Fi ağlarından bankacılık işlemleri ya da online alışveriş yapmanız, doğrudan güvenlik açığı demektir. Kafe, alışveriş merkezi, Wi-Fi hizmeti bulunan toplu taşıma araçları gibi ortak kullanılan internet bağlantı ağları, şifreli olsa bile, güvenlik önlemlerine korunaklı olmaz. Bu nedenle kişisel verilerinizi kullanarak girdiğiniz tüm siteler, başkaları tarafından kolaylıkla görülebilir ve ağdaki veri gidiş gelişlerine karşı korsan yazılım kodlamış kişi kişisel bilgilerinizi kolaylıkla ele geçirebilir. Eğer böyle bir ortamda kişisel bilgilerinizin olduğu herhangi bir hesaba girmek zorunda kalırsanız, bağlandığınız ağ için bir VPN sunucusu kullanın. VPN sunucusu, girdiğiniz sitelerle bilgisayarınız arasında güçlü bir şifre oluşturur.\nİşletmenizi ve itibarınızı korumak ve tüm korsan saldırılarından korunmak için Berqnet’in firewall cihazını kullanabilir, siber güvenliğinizi yüzde 100 sağlama alabilirsiniz. Siber güvenliğinizin sürekliliği için Berqnet ile iletişime geçebilirsiniz.\nFirewall Cihazı ile Kurumsal İnternet Ağı Güvenliği\nBilgisayar sistemlerine güvenlik duvarı hizmeti sunan sistemler firewall olarak adlandırılır. Güvenliği yüksek oranda sağlayan sistem, gelen ve giden ağ verilerini düzenli olarak denetleyerek, kötü amaçlı etkinlikleri engeller. Ağ güvenliği konusunda kullanıcılara yardımcı olan sistem, çeşitli cihazlar ve donanımlar ile oluşturulur. Dijital güvenliği sağlamak için şirketlerin ve kullanıcıların tercih ettiği yöntemlerden biri de firewall cihazı kullanmaktır. İnternet bağlantısı ile işlem yapan kullanıcıların güvenliklerini sağlamak firewall cihazının temel görevleri arasında yer alır. Firewall, internet ağına kötü niyetli bir giriş tespit ettiğinde korunaklı bir tabaka sağlayarak trafiği engeller. Ev ve şirket ağlarında kullanım için elverişli olan güvenlik duvarı ile hem sistemlerinizi hem de kişisel verilerinizi etkili şekilde koruyabilirsiniz.\nŞirketler İçin Firewall Cihazı Kullanmanın Avantajları\nÖzellikle şirketlerde firewall cihazı kullanımı oldukça yaygındır. Dijital saldırganları engellemek için kullanılan cihazlar, yalnızca erişim izni verdiğiniz ağ trafiklerine müsaade ederek ayrıcalıklı bir kullanım sağlar. Şirketlerde firewall cihazı kullanmanın avantajları şu şekilde sıralanabilir:\n\nŞirket personelinin internet gezintilerinin güvenlik altına alınmasını sağlar.\nBilgisayar sistemlerine ve ağa virüs ve trojan gibi zararlı saldırıları engeller.\nŞirketin iç ağına sızmak isteyen siber saldırganlar için etkili güvenlik önlemi oluşturmanız için idealdir.\nKablosuz ağlar üzerinden gelen saldırıların önlenmesine yardımcı olur.\nKamera ve mikrofon gibi sistemleri güvenli hale getirerek istenmeyen sızıntıları engeller.\n\nHacker saldırıları, siber saldırılar ve virüs yazılımları internet ortamında her an karşılaşma riskinin bulunduğu durumlardır. Yalnızca şahısların kişisel verilerinin güvenliği değil kurum ve kuruluşların da bu saldırılara karşı korunması gerekir. Havaalanı, kafe, restoran, yazılım şirketleri, hastane gibi internet ağlarının kullanıldığı birçok alanda siber saldırı tehdidi sürekli olarak devam eder. Ağ modeline bir firewall cihazı yerleştirerek veri ve sistem güvenliğini doğru şekilde sağlayabilirsiniz. Küçük, orta ve büyük ölçekli işletmeler için hayati önem taşıyan firewall cihazı internetin kontrol altına alınmasına ve verimli şekilde kullanılmasına destek olur. Gereksiz trafiği engelleyerek hem gelen hem de giden ağ trafiğini sizin belirlediğiniz kurallara uygun şekilde yönetir.\nİhtiyaçlarınıza En Uygun Firewall Cihazı Modelleri\nİşletmeler için yasaların belirlediği sınırlar doğrultusunda, internet güvenliğini sağlamak işleyişin devam edebilmesi açısından oldukça önemlidir. Doğru şekilde dizayn edilmiş yazılımlar ve güvenlik cihazları ile siber saldırı nedeniyle oluşabilecek kayıpların önüne geçebilirsiniz. Güvenlik politikalarına uygun firewall cihazlarını pratik şekilde internet ağınızla entegre edebilir, kullanıcı dostu arayüz sayesinde etkin şekilde kullanabilirsiniz.\n\nİşletmenizi ve İtibarınızı Siber Tehditlere Karşı Berqnet'le Koruyun!\n\n\n\n\n\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n\nAydınlatma metnini kabul ediyorum.\n\n\n\n\n\n\nWeb Sitesi Gizlilik Koşulları\nBu Web Sitesi Gizlilik Koşulları (“Gizlilik Koşulları”) www.berqnet.com’dan (“Web Sitesi”) faydalandığınız süreçte paylaştığınız ve/veya elde edilen bilgilerinizin gizliliğine ilişkindir.\nWeb Sitesi’ni kullanmanız, Gizlilik Koşulları’nı okuduğunuz ve kabul ettiğiniz anlamına gelir. Gizlilik Koşulları’nda öngörülen yükümlülükleri yerine getiremeyeceğinizi düşünüyorsanız, Web Sitesi’ni kullanmayınız. Bu Gizlilik Koşulları, Web Sitesi Kullanım Koşulları’nın (“Kullanım Koşulları”) eki ve ayrılmaz bir parçasıdır.\nBu Gizlilik Koşulları’nda; Logo Siber, aşağıda künye bilgileri yer alan şirketi ifade eder.\nVeri Sorumlusu : Logo Siber Güvenlik ve Ağ Teknolojileri A.Ş.\nAdres : Gebze Organize Sanayi Bölgesi, Şahabettin Bilgisu Cad. No:\n609 Gebze/Kocaeli\nMERSİS No : 0609048425600015\nTicaret Sicil No : 19067\nTelefon : +90 850 577 23 77\nWeb Sitesi : www.berqnet.com\n \n     1. KULLANICI BİLGİLERİ\nWeb Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen kimlik ve iletişim bilgisi dahil her türlü bilgiye ilişkin sorumluluk münhasıran ilgili Kullanıcı’ya aittir. Kullanıcı, Web Sitesi’ne ilettiği/gönderdiği her türlü bilginin güvenilirliğini, doğruluğunu, üçüncü şahısların haklarını ihlal etmediğini, yasalara aykırı olmadığını beyan ve garanti etmiştir.\n     2. BİLGİLERİN KORUNMASI\nLogo Siber, Web Sitesi’ndeki tüm sayfaların güvenliği için azami gayret göstermektedir. Web Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen verilerin gizliliğini, güvenliğini ve bütünlüğünü korumak için çeşitli teknik ve yönetimsel uygulamalardan yararlanılmaktadır.\n     3. KİŞİSEL VERİLER\n3.1 Toplanan ve İşlenen Kişisel Veriler\n6698 sayılı Kişisel Verilerin Korunması Kanunu (“Kanun”) uyarınca, kimliği belirli veya belirlenebilir gerçek kişiye ilişkin her türlü bilgi kişisel veridir (“Kişisel Veri”). Kullanıcıların Web Sitesi’ni ziyaret etmesi, kullanması, Web Sitesi üzerinden sunulan Hizmetler’den faydalanması ya da Web Sitesi’nin güvenliğinin sağlanması için ad, soyad, telefon numarası, e-posta adresi, firma, veri numarası, fatura bilgileri ve görev bilgisi, IP bilgileri, Cihaz Donanım ve Lisans Bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, cihaz tipi, kullanım tarih ve saati ve benzeri Kişisel Verileri Web Sitesi’ne iletilmiş, gönderilmiş, yüklenmiş, kaydedilmiş ve/veya girilmiş olabilir. Kullanıcılar; bu Kişisel Verilerin, Kullanım Koşulları’nda belirtilen şartlarla Logo Siber’e açık olacağını dikkate alarak bu bilgileri açıklamış olduklarını ve Web Sitesi’ne bizzat Kullanıcı tarafından iletilmiş ya da çerezler aracılığıyla toplanan her tür Kişisel Veri’nin Logo Siber’e karşı gizliliğini yitirdiğini kabul etmiş sayılırlar.\n3.2 Özel Nitelikli Kişisel Veriler\nLogo Siber, Kullanıcılar’dan yasalar gerektirmediği sürece herhangi bir şekilde ve kesinlikle; ırk, etnik köken, siyasi düşünce, felsefi inanç, din, mezhep veya diğer inançlar, kılık ve kıyafet, dernek, vakıf ya da sendika üyeliği, sağlık, cinsel hayat, ceza mahkûmiyeti ve güvenlik tedbirleriyle ilgili veriler ile biyometrik ve genetik verileri talep etmemektedir. Bu bilgilerin Web Sitesi’ne veya Web Sitesi üzerinden verilmiş, kaydedilmiş veya ifşa edilmiş olmasından dolayı Logo Siber’in bir sorumluluğu yoktur.\n3.3 Kişisel Verilerin Toplanması ve Kaydedilmesi\nLogo Siber Kişisel Verileri; bizzat Kullanıcılar’ın Web Sitesi üzerinden/aracılığıyla iletmesi, yüklemesi veya kaydetmesi suretiyle ve/veya çerezler aracılığıyla toplayabilmektedir.\n3.4 Kişisel Veri İşleme Amaçları ve Faaliyeti\nLogo Siber Kişisel Verileri,\n\nWeb Sitesi’ne erişimin sağlanması, Kullanıcılar’ın Kullanım Koşulları’na uygun olarak Web Sitesi ve Hizmetler’den yararlanmasının temin edilmesi,\nWeb Sitesi’nin ve Hizmetler’in geliştirilmesi,\nWeb Sitesi’nin güvenliğinin sağlanması, Web Sitesi’ne yönelik potansiyel risklerin tespiti ve engellenmesi,\nKullanıcılar’ın kullanım analizi, Web Sitesi ve Hizmetler’in kullanım analizine ve Kullanıcılar’ın tercihlerine göre kişiselleştirilmesi;\nWeb Sitesi’nin reklamlar yoluyla geliştirilmesi amacıyla, kişiselleştirilmiş reklam imkanlarının sunulması,\nHizmetler ve Logo Siber’in faaliyet alanıyla ilgili olarak reklam, pazarlama vb. faaliyetlerin gerçekleştirilmesi,\nKullanıcılar ile Web Sitesi kullanımı ve Hizmetler’den yararlanılması kapsamında iletişim sağlanması, elektronik ileti veya ticari elektronik ileti gönderilmesi,\nBaşvuru, bildirim, soru ve/veya taleplere cevap verilmesi, cevap sürecinde gerekli iç araştırmaların yapılması, başvuru kayıtlarının tutulması\nTelefonla pazarlama, tanıtım, iletişim vb. faaliyetlerde kullanılması\n\ngibi Kullanıcılar’ın Web Sitesi’nden etkin bir biçimde faydalanmasına yönelik amaçlar doğrultusunda kullanabilir, işleyebilir, saklayabilir, veri tabanlarında tasnif edebilir, Logo Siber’in faaliyet alanındaki işlerin ve/veya hizmetlerin amaçlarıyla uyumlu olarak kullanabilir, mevzuata uygun olarak yurt içine ya da yurt dışına transfer edebilir, üçüncü şahıslarla paylaşabilir, veri tabanında tasnif edebilir, veri tabanındaki verilerden yararlanabilir.\n     3.5 Kişisel Verilerin Aktarılabileceği Üçüncü Kişiler ve Aktarım Amaçları\n\nHukuken Yetkili Özel Hukuk Kişileri: Hukuken Logo Siber’den bilgi ve/veya belge talep etmeye yetkili özel hukuk kişilerine, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olarak Kişisel Veri aktarılabilir.\nKamu Kurum ve Kuruluşları: Yasal olarak yetkili kamu kurum ve kuruluşlarına, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olmak üzere Kişisel Veri aktarılabilir.\nWeb Sitesi Aracılığıyla Bağlantı Sağlanan Üçüncü Taraflar: Web Sitesi; üçüncü şahıslar tarafından işletilen web sitesi, ürün ve hizmetler içerebilir ve bunlara bağlantı sağlanabilir. Kullanıcılar’ın kendi tercihi ile bu web sitesi, ürün ve hizmetlerden faydalanmayı seçmesi durumunda Kişisel Verileri, ilgili üçüncü şahıs kişi ve/veya kuruluşlara aktarılabilir.\n\n     3.6 Logo Siber Tarafından İşlenen Kişisel Verilere ve Kişisel Verileri İşlenen Gerçek Kişilere İlişkin Kategorizasyon\nLogo Siber tarafından işlenebilecek Kişisel Veriler ve bu verilerin sahibi gerçek kişiler aşağıda detaylı olarak açıklanmış ve kategorize edilmiştir.\nBu kategorizasyonda Başvuran; Logo Siber’e yazılı veya elektronik olarak başvurarak soru, talep, öneri, şikayet, başvuruları ileten gerçek kişi Kullanıcılar’ı ifade eder. Bu madde anlamında başvurular Kişisel Verilere yönelik hakların kullanılması amacıyla yapılabileceği gibi, Web Sitesi üzerindeki formlar doldurularak Logo Siber ile iletişime geçilmesi, bunlar üzerinden Hizmet talep edilmesi suretiyle de gerçekleşebilir.\nKişisel Veri\n \nAçıklama\nVeri Sahibi\nKimlik Bilgisi\n:\nNüfus cüzdanı, ehliyet, pasaport gibi belgeler üzerinde yer alan ad-soyad gibi bilgilerdir.\nBaşvuran\nİletişim Bilgisi\n:\nVeri sahibi ile iletişim kurulmasını sağlayacak telefon numarası, adres, e-posta adresi gibi bilgilerdir.\nBaşvuran\nTemsilci Bilgisi\n:\nVeri sahibinin varsa veli, vasi, vekil, avukat gibi her türlü yasal temsilcilerine ilişkin bilgilerdir.\nBaşvuran\nDijital Veriler\n:\nVeri sahibinin Web Sitesi üzerinden veya aracılığıyla iletilmiş, göndermiş, yüklemiş, kaydetmiş ve/veya girmiş ve/veya çerezler aracılığıyla toplanan;  IP bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, kullanım tarih ve saati gibi verileridir.\nKullanıcılar\nBaşvuru Bilgisi\n:\nVeri sahibinin Logo Siber’e ilettiği herhangi bir soru, talep, öneri, şikayet veya başvurusu sebebiyle verdiği bilgiler, bunlara ilişkin değerlendirmeler ve Logo Siber nezdinde tutulan kayıtlardır.\nBaşvuran\n     4. GİZLİLİK KOŞULLARININ İHLALİ\n4.1 Logo Siber, Gizlilik Koşulları’na uyulmaması ya da kuralları ihlal etme girişiminde bulunulması durumunda, ihlal tam olarak gerçekleşsin ya da gerçekleşmesin, önceden haber vermeksizin Kullanıcıların Web Sitesi’ne erişimini askıya alma, sonlandırma veya varsa üyeliği iptal etme hakkını saklı tutar. Bu kural, Gizlilik Koşulları’nın Kullanıcılar tarafından dolaylı ihlali ya da ihlal girişimi olması durumu için de geçerlidir.\n4.2 Logo Siber’in burada yazılı herhangi bir hukuki hakkı ya da tedbiri kullanmaması ya da uygulamaması, Logo Siber’in Gizlilik Koşulları ya da yasadan doğan haklarından vazgeçtiği ya da ihlali kabul ettiği anlamına gelmez.\n     5. GİZLİLİK KOŞULLARININ TAKİBİ/DEĞİŞİKLİK\nLogo Siber, herhangi bir zamanda önceden haber vermeksizin Gizlilik Koşulları’nda değişiklik yapma ya da ek koşullar getirme hakkına sahiptir. Kullanım sırasında toplanan bilgilerin niteliklerinden, nasıl kullanıldığından, bu bilgilerin üçüncü şahıslar ile hangi durumlarda paylaşıldığından ve gerekli tüm gizlilik koşullarından haberdar olunması için yapılan değişiklikler Web Sitesi’nde sunulacak ve yayınladıkları tarihte yürürlüğe girecektir.  Gizlilik Koşulları’nın düzenli olarak takibi ve okunması Kullanıcıların sorumluluğundadır. Web Sitesi’ni yapılabilecek bu tarz bir değişiklikten sonraki kullanım, Gizlilik Koşulları’ndaki değişiklilerin kabul edildiği anlamına gelir.\n     6. AÇIK SİSTEM\nKullanıcılar; internet ortamının güvenilir bir ortam olmadığını, internet ortamında iletişimin riskli olduğunu, kişisel veriler, şifreler vb. de dâhil her türlü bilginin üçüncü şahısların hukuka aykırı fiillerinin muhatabı olabileceğini bilmekte ve kabul etmektedir. Logo Siber, Web Sitesi’nin güvenli olduğu yönünde ve/veya kötü niyetli hareketlerle ilgili olarak hiçbir garanti vermemektedir.\n     7. WEB SİTESİ YARDIMCI PROGRAMLARI\nWeb Sitesi’nden daha kolay yararlanabilmeniz için bazı “çerez”lerden yararlanılabilir, bunlar vasıtasıyla Kullanıcılar’a bazı bilgiler gönderilebilir veya bazı Kullanıcı bilgileri toplanabilir. Çerezlerle ilgili veri toplanmasının istenmediği durumlarda, kullanıcıların veri toplanmasını engelleme hakkı mevcuttur.\n     8. BİLGİ VE İLETİŞİM\nGizlilik Koşullarına ilişkin sorularınız için bize 0850 577 23 77 nolu telefondan ulaşabilirsiniz.\n\n\n\n\n\n\n\n\n\n\nÜrünle ilgili önemlli gelişme ve haberleri almak istiyorum.\n\n\n\n\n\n\n\n\nGÖNDER\n\n\n\n\n\nBerqnet firewall cihazı modelleri, farklı boyutlardaki işletmelere ağ güvenliği konusunda ayrıcalıklı ve ideal çözümler sunmaktadır. Küçük, orta ve büyük ölçekli işletmelere uygun Berqnet firewall cihaz modellerini yakından inceleyerek 8 GB ile 64 GB arasında değişen dâhili saklama alanına sahip olanları güvenle tercih edebilirsiniz. USB kullanarak saklama alanını genişletebilir, yönetim ve kurulum konusunda pratiklik sağlayan özellikleri değerlendirebilirsiniz.\n\n20 Ekim 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "SQL Injection Nedir, Nasıl Çalışır, Nasıl Engellenir?",
  "url": "https://berqnet.com/blog/sql-injection",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nSQL Injection Nedir, Nasıl Çalışır, Nasıl Engellenir?\n\nSQL injection, veri tabanı altyapısına sahip tüm sistemlerde en yaygın görülen siber güvenlik tehdididir. Böyle bir altyapıya sahipseniz mutlaka gerekli önlemleri almalısınız.\n\n\n\n\nKurumunuza ait veriyi korumak, kurumsal verinin bütünlüğünü sağlamak için altyapınızı bu zafiyete karşı korumalısınız.\nABD’de bulunan Açık Web Uygulama Güvenliği Projesi (OWASP) Vakfı tarafından her sene siber güvenlik tehdidi olarak yılın top 10 listesi yayımlanmaktadır. 2020 yılında üçüncü sırada listelenen SQL injection, web sitesi güvenlik açıkları arasında saldırganların en çok tercih ettiği siber saldırı yöntemlerinden biridir.\nSQL Injection Nedir?\nSQL injection nedir diye soracak olursanız, web uygulamasının yaptığı SQL sorgusuna müdahale edilerek veri tabanında bulunan verilere yetkisiz erişme yöntemi cevabı uygun olacaktır. Bu güvenlik açığı, normalde görülmesi imkânsız verilerin görüntülenmesine izin verir.\nBir müşteri sisteme girerken kendi kullanıcı adı ve şifresini vererek, giriş izni alır. Bu izin sadece kendi verilerini görmeye yetki verir. SQL injection yönteminde ise bir saldırgan bununla birlikte diğer kullanıcıların ve web uygulamasının diğer verilerine erişebilir. Buradaki SQL injection açığı ile saldırgan verileri transfer edebilir, değiştirebilir, silebilir. Yani eriştiği tüm verileri manipüle edebilir hale gelir.\nWeb tabanlı uygulamalarda karşımıza çıkan bu güvenlik açığı, veri hırsızlarının başvurduğu en temel yöntemlerden biridir. Bir web sitesinde herhangi bir form doldururken, arka planda veri tabanına bir SQL sorgusu iletilir. Burada veri tabanı ile bir iletişim sağlanır. Birazdan bahsedilecek güvenlik önlemleri alınmamış ise aynı iletişim kanalından farklı bir SQL sorgusu ile veri tabanı manipülasyona açık hale gelmiş olur. SQL injection açığı denilen bu durumda kolaylıkla verileriniz başka yere transfer edilir.\nKonuyu daha iyi anlamak için SQL nedir sorusunun cevabını öğrenerek devam edebilirsiniz. SQL, Structured Query Language kelimelerinin baş harflerinden oluşur. Türkçe ifadesiyle yapılandırılmış sorgu dili olan SQL; MySQL, MSSQL, Oracle gibi veri tabanlarından veri çekmeye ve işlemeye yardımcı olan bir sorgulama dilidir. Bu sayede veri tabanı tablolarında var olan veri hakkında anlaşılır bilgiler elde edersiniz. Bunun yanında mevcut veride değişiklik yaparsınız.\nÖrneğin, bir müşterinin sistemde kayıtlı cep telefonu numarasını öğrenmek için web uygulamasına giriş yaptığınızda, arka planda cep telefonu bilgisi için veri tabanında SQL sorgusu çalışır. SQL sayesinde verinin ne olduğu, veri giriş-çıkışı, veriden anlamlı bilgiler üretme işlemleri kolaylıkla yapılmış olur.\nSQL Injection Nasıl Çalışır?\nSQL injection yöntemi, web sitenizdeki herkese açık olarak sunulan giriş, iletişim gibi formlarda etkilidir. Kodlaması yanlış ya da eksik yapılan formlarda girilen bir metnin veya sorgu dizisinin, yabancı birisi tarafından veri tabanına yetkisiz erişim imkânı sağlar. Web sitenizde bulunan bu tarz formlar bu şekilde bir saldırıya açıktır. Bu sayfaların güvenliğini önemsemelisiniz. Bu sayfalardaki en ufak bir zafiyet, şirketiniz için geri dönülemez veri ihlallerine sebep olabilir.\n2020 yılında milyonlarca üyesi olan ücretsiz resim stok sitesi Frepik kullanıcılarının verileri SQL injection hack yöntemiyle çalındı. Şirket 8 milyon kullanıcının verilerinin çalındığını, verilerin arasında yaklaşık 3,5 milyon kullanıcının şifresinin olduğunu bildirdi. KOBİ ya da kurumsal bir firma olun, böyle bir durum yaşamak ister misiniz?\nBu konuyu SQL injection örnek sorgular ile daha iyi anlayabilirsiniz. Kullanıcı adı ve şifre ile oturum açması sağlanan bir uygulama giriş sayfanız var diyelim. Burada bir kullanıcının “ahmet” kullanıcı adı ile birlikte “ahm.135” şifresini kullanarak uygulamaya giriş yaptığını varsayın. Bu durumda uygulama aşağıdaki sorguyu sorup, doğru cevap alırsa kullanıcıya giriş izni verir.\n\nBir hacker, bu sorgudaki parola sorgusunu kaldırarak giriş yapmayı dener. Bu şekilde veri tabanına sızma girişiminde bulunur. Oturum açma ekranındaki POST isteğini aşağıdaki sorguyla düzenleyip gönderirse veri tabanına yönetici rolüyle erişir.\n\nBuna benzer başka SQL injection örnek sorguları da yapılarak veri ihlalleri ile karşı karşıya kalabilirsiniz. Örneğin bir e-ticaret sitenizde filtreleme esnasında aşağıdakine benzer bir sorgu döner.\n\nSaldırgan bu sorgunun yanına UNION komutunu ekleyerek farklı tablolardan veri çekmeye çalışır.\n\nGördüğünüz gibi web uygulamanızda SQL injection açığı varsa sistemde kayıtlı kullanıcı adları, şifreler ve diğer kişisel veriler bu şekilde kolay bir şekilde erişime açık olur.\nSQL Injection Nasıl Engellenir?\nFirewall şirketlerinin IT departmanlarında Kasım 2017 ila Mart 2019 arasında toplanan verilere göre her üç siber saldırıdan ikisinin SQL injection yöntemine ait olduğu görülüyor. Hackerların en çok tercih ettiği bu saldırı karşısında bir takım önlemler almanız mümkün. İşte karşınızda SQL injection nasıl engellenir sorusunun cevabı:\n\nBilgi teknolojileri altyapınızda fiziksel cihazlarınkiler dâhil tüm yazılımların güncel olmasına dikkat edin.\nWeb uygulamanızdaki tüm formlarda ben robot değilim doğrulamasını sağlayın.\nUygulama kullanıcılarına çift faktörlü giriş yapmalarını zorlayın.\nWeb uygulaması üzerinde gerçekleşen şüpheli sorguları ve istekleri analiz edebilen web tabanlı bir firewall (WAF) yazılımını devreye alın.\nUygulamanızın arka planda sorduğu soruları gözden geçirin. Özellikle NULL karakterlerin yer aldığı sorguları tekrar düzenleyin.\nSisteminizdeki kullanıcıları gözden geçirin. Yönetici ve tam yetkili rolündeki kullanıcı adlarında ‘administrator’, ‘admin’, ‘yönetici’ gibi akla gelebilecek kullanıcıları devre dışı bırakın. Ayrıca yetkili rolündeki kullanıcı adlarının gerçek isim veya uygulama ismi olmasına dikkat edin.\nUygulamanın hızlı olması için kullanılan sorgu dizesi birleştirme yöntemi her zaman iyi fikir olmayabilir. Mümkün mertebe bu dize birleştirmelerden uzak durun veya bu sorguyu yetkiye bağlayın.\nIT altyapınız üzerinde yapılan tüm hareketleri merkezi log toplama veri tabanında toplayın. Şüpheli işlemler için anlık alarm tanımlayın ve yetkili kullanıcıya e-posta gönderimi sağlayın.\nDiğer siber tehditlerle beraber IT altyapınızı anlık monitör edebileceğiniz, güvenlik yapılandırmalarını tek bir ekrandan yapabileceğiniz, bunun yanında Kişisel Verileri Koruma Kanunu ve 5651 sayılı Kanun kapsamında verilerinizi koruyabileceğiniz Berqnet firewall cihazını kullanın.\n\nWeb Sitesi Açıklarına Genel Bakış\nSiber güvenlik şirketlerinin yaptığı araştırmalarda web sitelerinde bilinen belli başlı açıklar olduğu anlaşılıyor. Web sitelerinin veya web tabanlı çalışan uygulamaların zafiyetlere açık olması kurumsal verilerin her an çalınabileceği riskini ortaya koyuyor. SQL injection açığı konusunu detaylı bir şekilde okudunuz. Gelin diğer en yaygın 4 adet web sitesi açıklarına genel bakış atın:\n\nBozuk erişim kontrolü, en yaygın web sitesi açıklarından biridir. Bir kullanıcının yetkisi olmadığı halde hassas verinin olduğu sayfaya erişmesi sonucu gerçekleşen güvenlik açığıdır. Bozuk erişim kontrolüaçığını tespit eden hackerlar, web sitenizin verilerine erişmek için çok beklemeyecektir.\nŞifreleme hataları, hem kullanıcılara hem de yöneticilere bakan yönü vardır. Kullanıcılar, şifrelerini oluştururken kolay, tahmin edilebilir şifre tercih edebiliyorlar. Bu da kullanıcı seviyesinde veri ihlaline neden olur. Diğer taraftan sisteme kaydedilen şifre, kredi kartı bilgileri gibi hassas verilerin açık bir şekilde saklanması da web uygulamasını zafiyete açık hale getirir. Olası bir veri ihlalinde hassas verilerin erişilmesi zararı daha da artırır.\nGüvensiz tasarım sahibi web siteleri de saldırganların değerlendirebileceği açıklar arasından yer alır. Tasarımdaki güvenlik eksiklikleri diğer web sitesi açıklarını da gün yüzüne çıkarır.\nYanlış güvenlik yapılandırmasıkaynaklı web açıkları, web sitelerini ve uygulamaları güvensiz hâle getirir. Web uygulamanızın altyapısındaki güncel olmayan yazılımlar, web tabanlı güvenlik duvarının eksik yapılandırılması, DDOS korumasının etkin olmaması gibi birçok sebep yanlış güvenlik yapılandırması açığının oluşmasına sebep olacaktır.\n\nŞirket olarak çalışanlarınıza, müşterilerinize değer verdiğinizi göstermek istersiniz. Bunun için ürünlerinizde kalite, çalışma koşullarında iyileştirme gibi konularda adımlar atarsınız. Ayrıca size emanet ettikleri kişisel verilerinin güvende olduğunu düşünmeleri ve bu şekilde olduğunu görmeleri verilen hizmeti daha da değerli hissettirecektir. Bu açıdan her şirket için özel çözümler sunan, şirketinizin verilerini güncel siber tehditlere karşı etkin koruma yapan, KVKK’ya ve 5651 sayılı Kanun’a uyumlu Berqnet firewall cihazı, web ve uygulama filtreleme özellikleri ile SQL injection ve diğer web sitesi açıklarına karşı kurumsal verilerinizi korur. Saldırganlara karşı bir adım önde olmak için ürün hakkında bilgi alabilir, demo talep edebilirsiniz.\n\n1 Kasım 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Beyaz Şapkalı Hacker kimdir?",
  "url": "https://berqnet.com/blog/beyaz-sapkali-hacker",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nBeyaz Şapkalı Hacker kimdir?\n\nBilgisayar korsanları, siber dünyada var olan en kötü türlerden biridir. Sistemlerinize girebilir, verilerinize erişebilir, sizi hacklemek ve tehlikeye atmak için elde ettikleri tüm bilgileri kötüye kullanabilirler. Ancak hepsi aynı takımda değildir. Bazı hackerlar, verileriniz ve sürdürülebilirliğiniz için bir tehdit oluştururken, bazı hackerlar ise güvenlik sistemlerinizdeki boşlukları bulur ve kuruluşunuzu korumak için bunları düzeltirler.\n\n\n\n\nBir hackerı başarılı bir şekilde yakalama olasılığı en yüksek olan kişi; onun taktiklerini, zihniyetini ve alışkanlıklarını bilen biridir. Bu nedenle siyah şapkalı hackerlara karşı en iyi savunma, hack yeteneklerini savunma amaçlı kullanan bir grup beyaz şapkalı hacker tarafından yapılabilmektedir. Beyaz şapkalı hackerlar hakkında bilmeniz gereken birçok konuyu yazı içeriğinde bulabilirsiniz.\nBir kuruluş veya bireysel bir kullanıcıysanız; gizliliğinizi korumak için bir kişiye güvenmek yerine, siber güvenliğinize kendi aldığınız önlemlerle dikkat etmelisiniz. Gerçek zamanlı tüm ağ trafiğinin kontrolü sağlanarak siber güvenlik koruması, ihlal tespiti ve uzman desteği gibi özelliklerle Berqnet firewall cihazı, size bu açıdan çok yönlü bir siber güvenlik çözümü sunar.\nBeyaz Şapkalı Hacker Nedir ve Amaçları Nelerdir?\n\nEtik hacker olarak da adlandırılan beyaz şapkalı hacker; güvenliklerini test etmek, kusurlarını belirlemek, değerlendirmek ve iyileştirme önerilerinde bulunmak için korumalı sistemlere ve ağlara, izin ve bilgi dahilinde giren bir bilgisayar güvenlik uzmanıdır. Aynı zamanda bu işlemleri siyah şapkalı hackerların sistem verilerine yasa dışı bir şekilde erişememesini sağlamak içinde yaparlar.\nEtik hackerlar genellikle siber güvenlik şirketleri tarafından veya daha büyük kuruluşların güvenlik departmanlarında kullanılırlar. Saldırganların nasıl çalıştığını bilmeleri nedeniyle saldırıları nasıl önleyecekleri konusunda onlara değerli bilgiler verirler. Bazı etik hackerlar, bilinen ve uluslararası büyük şirketlerin ağlarında veya sistemlerinde güvenlik açıklarını keşfederek ödül toplamaktadır. Verilen bu ödüller; onları bu açıkları bildirmeye teşvik eder ve suçlular tarafından bulunmadan önce düzeltilmesine izin verir.\nEthical hacking (etik hackleme), sistemin güvenlik açıklarını ve zayıf noktalarını belirlemek ve test etmek için yasal olarak bu bilgilere giriş yapma eylemini içerir. Etik hack işlemi, bir kuruluşun siber güvenlik konumunu test etmenin ve doğrulamanın etkili bir yoludur. Etik hackleme, test sırasında bulunan güvenlik açıklarını düzelterek ağın veya sistemin güvenliğini artırmayı hedefler.\nBeyaz Şapkalı Hacker Olmak İçin Gerekli Eğitim ve Sertifikalar Nelerdir?\n\nSertifikalı Etik Hacker (CEH), BT şirketleri ve diğer kuruluşlar için yasal hizmetler gerçekleştiren bilgisayar korsanları için profesyonel bir tanımdır. Bir CEH, siyah şapkalı korsanları ve potansiyel olarak yasa dışı amaçlara sahip diğer kişiler tarafından yapılan istismarları önlemek için uygulama, sistem güvenlik açıklarını bulma ve onarma için işe alınır.\nBeyaz şapkalı bir hacker olmak için gerekli eğitimi sunan ve sınavlara hazırlayan çok sayıda kurs vardır. CEH eğitimi süresince birçok güvenlik sertifika programına sahip olacak bilgi elde edilir. Eğitimden sonra Ec-Council tarafından uygulanan İngilizce sınavlara girilir. 3 yıl geçerli olan sertifika; tekrar eğitim alarak veya sınava katılarak yenilenir. CEH gözetimi, Uluslararası E-Ticaret Danışmanları Konseyi (EC-Council) tarafından sağlanır.\nCEH sertifika sınavına katılabilmek için aşağıda belirtilen şartlardan en az birinin yerine getirilmesi gerekir:\n\nSadece akredite kurumlardan CEH eğitiminin alınması\nBilgi güvenliği alanında 2 yıllık deneyime sahip olmak\n\nAyrıca CEH eğitimi için Microsoft ve Linux bilgisi de gereklidir. Temel ağ bilgisi, güvenliği, saldırı şekilleri ve açıklar ile ilgili bir altyapı yeterliliği bulunmalıdır.\nTüm bunlar büyük fayda sağlasa da beyaz şapkalı hacker olmanın en iyi yolu; kendinizi siber güvenlik dünyasına adamaktır. Beyaz şapkalı bir hacker olmak, işleri resmileştiren birkaç sertifika ile desteklenebilecek belirli bir uzmanlık eğitimi gerektirir. Bu alanda birçok sertifika programı mevcuttur. Bunlardan bazıları ise şu şekildedir:\n\nSertifikalı Ağ Savunucusu (CND)\n\nBu sertifika, temelden orta ve ileri düzeylere kadar ağlarla ilgili hemen her şeyi içerir. Konular arasında ağ protokolleri, güvenlik duvarları, trafik imzaları, güvenlik açığı taraması, özel ağlar vb. bulunur.\n\nSertifikalı Etik Hacker (CEH)\n\nZorluk seviyesi burada biraz daha yüksektir ve aynı kavramları çok daha detaylı bir şekilde inceler. Kapsanan şeyler arasında ağ taraması, kriptografi saldırıları, SQL enjeksiyonları, nesnelerin interneti, mobil uygulamalar, işletim sistemleri, ayak izi vb. bulunur.\n\nEC-Council Sertifikalı Güvenlik Analisti (ECSA)\n\nBu sertifika, size karşı kullanılabilecek tüm hataları bulmak için siber güvenlik sisteminize yapılan sahte bir saldırı olarak anlaşılabilecek sızma testi ile ilgili içeriği kapsar.\n\nLisanslı Penetrasyon Test Cihazı (LPT) Master\n\nBu sertifika, sızma testi konseptlerini ileri bir düzeye taşır. Gelişmiş bilgisayar korsanlığı yöntemlerini uygular.\nAyrıca beyaz şapkalı bir hacker olabilmek ve gerekli alt yapıyı kazanabilmek için aşağıda belirtilen diğer sertifikalardan da faydalanılır.\n\nSertifikalı Bilgi Sistemleri Güvenliği Uzmanı (CISSP)\nSertifikalı Bilgi Sistemleri Denetçisi (CISA)\nSertifikalı Bilgi Güvenliği Yöneticisi (CISM)\nSertifikalı Bulut Güvenliği Uzmanı (CCSP)\n\nHacker Şapkalarının Anlamları Nedir ve Farkları Nelerdir?\nBu terimler; kötü adamın siyah kovboy şapkası taktığı ve iyi adamın beyaz şapka taktığı batının eski kovboy filmlerinden gelir. Hacker şapka renklerini birbirinden ayıran en önemli iki neden; motivasyon kaynakları ve yasaları ihlal edip etmedikleridir.\nSiyah şapkalı hackerların birincil motivasyon kaynağı; kişisel veya finansal kazançtır. Siber casusluk, protesto veya sadece siber suçların heyecanına da bağımlı olabilirler. Siyah şapkalı hackerlar, sadece kötü amaçlı yazılım yayan amatörlerden; verileri, finansal ve kişisel tüm bilgileri çalmayı amaçlayan deneyimli hackerlara kadar birçok bilgisayar korsanını kapsar. Siyah şapkalı hackerlar, yalnızca verileri çalmaya çalışmaz, aynı zamanda verileri değiştirmeye veya yok etmeye de çalışırlar. Siyah şapkalı, hackerlar yakalanmama ve işledikleri suçların sorumluluğunu almama gibi avantajları nedeniyle isimlerini gizlemeyi tercih ederler.\nBeyaz şapkalı hackerlar, ellerindeki gücü ve bilgiyi iyilik için kullanmayı tercih ederler. Etik bilgisayar hackerları olarak da adlandırılan bu kişiler; bazen güvenlik açıklarını bilgisayar korsanlığı yoluyla bulmaya çalışan güvenlik uzmanları olarak şirketler için çalışırlar. Beyaz şapkalı hackerlar, istisnalar dışında siyah şapkalılarla aynı hackleme yöntemlerini kullanırlar. Sistem sahibinden izin alarak yaptıkları işlemler, süreci tamamen yasal hale getirir. Bu hackerlar, şirketler için güvenlik sistemlerini test eder ve güvenlik açığı denetlemeleri yaparlar.\nGri şapkalı hackerlar, siyah ve beyaz şapkalı hacker faaliyetlerinin bir karışımıdır. Gri şapkalı hackerlar, genellikle şirketin izni ve bilgisi olmadan sistemdeki güvenlik açıklarını arar. Sorun bulursa, şirkete bildirir ve sorunu çözmek için belirli bir miktar ücret talep eder. Şirket yanıt vermez ve iş birliği yapmaz ise, bilgisayar korsanları yeni bulunan istismarı dünyanın görmesi için çevrim içi olarak yayınlar veya şantaj yapar.\nBeyaz şapkalı bir hacker ile siyah şapkalı bir hacker arasında davranışsal ve etik açıdan farklılıklar mevcuttur. Beyaz şapkalı olarak da bilinen etik hacker, aslında siyah şapkalı hackerlar ile aynı işi yapar. Yalnızca kodu yaymak amacıyla güvenlik açıklarından yararlanmak yerine, sorunu başkaları tarafından keşfedilmeden önce düzeltmeye yardımcı olmak için ağ operatörleri ile birlikte çalışırlar.\nSonuç olarak veri çalmaktan sisteminizi tamamen çöpe atmaya kadar, sisteminize erişim sağlandığında bir hackerın yapabileceği çok şey vardır. Bu nedenle doğru yazılımla sisteminizi bu tür saldırılara karşı korumak için birkaç adım atabilirsiniz. Berqnet firewall cihazının amacı, bütünlük, güven ve şeffaflığa dayalı bir şekilde siber saldırılara karşı koruma anlayışına yeni bir yaklaşım getirmektir.\nİster bireysel, ister küçük veya orta ölçekli bir işletme olun; etkili ve güçlü çözümler için önlemleriniz hazır olmalıdır. Siber güvenlik ihtiyaçlarınız için ulusal ve uluslararası alanda sahip olduğu 35 yıllık tecrübesiyle Logo Siber Güvenlik ve Ağ Teknolojileri tarafından geliştirilen, Berqnet firewall cihazı sürdürülebilirliğinize katkı sağlamayı amaçlar.\nLogo Siber Güvenlik ve Ağ Teknolojileri, gelişmiş teknolojiyi kullanarak kuruluşunuzun güvenlik mimarisini korumayı sağlar. Müşteri odaklı yaklaşım ve uzman çalışanları ile güvenlik açıklarınızı tespit ederek sizin için en etkili çözümleri sunar.\n\n19 Ağustos 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Siber İstihbarat nedir? Şirketinizdeki Casusu Engelleyin",
  "url": "https://berqnet.com/blog/siber-istihbarat",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nSiber İstihbarat nedir? Şirketinizdeki Casusu Engelleyin\n\nSiber istihbarat, şirketlerin elektronik ortamdan gelebilecek saldırı risklerini ortaya çıkararak, bu saldırılardan nasıl korunulacağını belirlemek için yapılan faaliyetlerin tamamına verilen isimdir.\n\n\n\n\nDijitalleşmenin getirdiği kolaylıklar nedeniyle hemen hemen gündelik hayattaki tüm faaliyetler bir şekilde online ortam ile bağlantılı durumdadır. İnternetsiz bir hayatı bile hayal etmek neredeyse imkânsızdır. İnternet kullanımı bireysel kullanımın çok ötesine geçerek özel şirketlerden devlet kurumlarına kadar tüm iş alanlarına yayılmış durumdadır. Dolayısıyla internet ile bağlantısı olan tüm bu kişi, şirket ve kurumlar siber tehditlere açık hale gelmektedir.\nDünyanın çeşitli yerlerinde farklı araçlar kullanılarak suç işlenebildiği gibi sanal ortamda da uygun araçlar ile suç işlemek mümkündür. Hatta suç işlemeye meyilli kişiler gerçek hayatta yakalanma korkusu ve ceza alma endişesi ile çok defa suç işlemekten uzak dururken internette durum bunun tersidir. İnternetin getirdiği gizlilik sayesinde yakalanma riski nispeten az olduğundan kötü niyetli bu kişiler çok rahatlıkla suç işlemeye cesaret edebilirler. Suçluların en sık işlediği suçların başında ise siber saldırılar gelmektedir.\nSiber Saldırı Nedir?\nBilişim suçları sadece kişilerin gizliliğini ihlal etmekle kalmaz aynı zamanda şirketlerin kurumsal bilgilerini ve altyapılarını da tehdit eder. Halk arasında hacker olarak bilinen internet korsanları kimi zaman güvenlik açıklarından faydalanarak kimi zamansa çeşitli zararlı yazılımları kullanarak şirketlerin networklerine sızarlar. Bu sızmalar ve girişimler şirketin faaliyet alanına göre bilgi hırsızlığından banka hesaplarının ele geçirilmesine, sistemin yavaşlatılarak zarar verilmesinden güvenlik açıklarını halka göstererek korku yaymaya kadar çok çeşitli amaçlarla yapılabilir. \nÇeşitli amaçlarla farklı yöntemler kullanılarak yapılabilen bu zararlı faaliyetlere genel olarak siber saldırı adı verilmektedir. Siber saldırılar için bazen bir güvenlik açığının tespit edilmesi yeterli iken bazen bir virüs programının kullanılması gerekir. Kimi zaman çeşitli elektronik cihazların kullanımını da içeren siber saldırılar çeşitli amaçlarla gerçekleştirilebilir.\nSiber saldırılar amaçlarına göre çok farklı yöntemler kullanarak gerçekleştirilebilir. Bu yöntemlerden ilki DDoS (Distributed Denial of Service) denilen web sitesinin hizmet vermesini engellemeyi amaçlayan yöntemdir. Bu yöntemde web sitesine çok sayıda bilgisayardan aynı anda istek (request) gönderilerek cevap (response) talep edilir. Bu isteklerin sayısı web sitesinin bağlı bulunduğu sunucunun karşılayabileceği değeri aştığından site çöker ve hizmet veremez duruma gelir.\nCryptojacking’te DDoS yönteminde kullanıldığı gibi ele geçirilen bilgisayarlar başka bilgisayarlara request göndermek için değil arka planda kripto para madenciliği için kullanılır. Bu yüzden işlem yapılmasa bile sürekli yoğun olarak kullanılan bilgisayarlar yavaşlar ve fanları devrede kalır.\nMalware kötü niyetli yazılımlara verilen genel isimdir. Virüsler kendi kendine bilgisayarınıza zarar verebilirken truva atı olarak bilinen trojanlar ise hackerların bilgisayarınızı uzaktan kontrol etmesine imkân sağlar. Bilgisayarlar uzaktan kontrol edilerek banka hesaplarınız boşaltılabilir, bilgileriniz çalınabilir hatta bazı durumlarda kişiler ifşa ile tehdit edilerek şantaj için bile kullanılabilir. Keylogger olarak bilinen yöntemde ise klavyede tıkladığınız tuşlar kaydedilerek kullanıcı adı ve şifreniz ele geçirilerek hesaplarınızdan para çalmak amaçlanır. Ransomware olarak bilinen yöntemde ise bilgisayarınızdaki verilere şifre konarak erişiminiz engellenir. Şifrenin kilidini açmak için ise bitcoin gibi nispeten takip edilemeyen para birimleri ile fidye istenir.\nOltalama ya da phishing yönteminde ise kişilerin gerçek web sitelerinin kopyasına girmesi sağlanır. Böylece kişiye ait banka, kart bilgileri, önemli kimlik bilgileri gibi bilgiler elde edilerek dolandırmak amaçlanır. Bu yöntemde benzerleri yapılan siteler genelde bankaların ve çeşitli finans kurumlarının siteleridir. Böylece kişiye güven sağlanarak siteye istenen bilgileri vermesi hedeflenir. Mail adresine ya da telefona gönderilen linklerle sahte sitelere yönlendirme yapan hackerlar bunun için gönderdikleri içeriği kişiyi cezbedecek avantajlarla doldurur. “Anında düşük faizli kredi” ya da “kart aidatı iadesini hemen alın” tarzında cezbedici ifadelerle kart bilgilerinizi alıp kartınızdan harcamalar yaparlar.\nMan in The Middle denilen yöntemde bilgisayarınızın bağlı olduğu modem hacklenerek bilgisayarınızda yaptığınız işlemler izlenir. Bu tarz işlemler genelde halka açık kullanılabilen modemler hacklenerek yapılır. Böylece internete bağlanan kişinin yaptığı tüm işlemler hacker tarafından da görülür. Hacker banka şifresi benzeri kullanabileceği bir şeye ulaştığı anda bunu kullanarak amacına ulaşır.\nSiber Saldırılardan Korunma Yöntemleri\nSiber saldırılardan nasıl korunulur denildiğinde pek çok kişinin aklına ilk olarak antivirüs programları gelir. Siber saldırılardan korunmanın diğer yöntemleri olarak firewall, proxy ve VPN hizmetleri, cloudware ve proaktif yöntemler sayılabilir. Bu yöntemlerden en çok işe yarayanlardan biri firewall kullanmaktır. Kişisel bilgisayarlarda yazılımlar, serverlarda ise firewall cihazları kullanılarak zararlı yazılımların sisteminize daha giriş yapmadan engel olunarak sizi zararlı yazılımlardan korur. Server'ınızı korumak için en başarılı firewall cihazlarını berqnet.com üzerinden temin edebilirsiniz.\nSiber İstihbarat Nedir?\nSiber istihbarat, şirketlerin elektronik ortamdan gelebilecek saldırı risklerini ortaya çıkararak, bu saldırılardan nasıl korunulacağını belirlemek için yapılan faaliyetlerin tamamına verilen isimdir. Çeşitli yöntemlerle yapılabilen siber saldırıların nereden geleceğini kestirmek ve bu saldırıları engellemek oldukça zor ve özel bir alandır. Şirketlerin bünyelerinde barındırdığı IT çalışanları siber güvenlik konularında bilgi sahibi olsalar dahi siber istihbarat denilen bütüncül süreci yönetmek için alanda uzmanlaşmış kişilere ihtiyaç duyulmaktadır. Elektronik ortamdan toplanan veriler işlenerek, şirketin açıkları ve suçluların saldırma yöntemleri bağlamında değerlendirilir. Değerlendirme sonucunda olası saldırı yöntemlerine göre tedbirler alınarak saldırılardan alınacak hasar en aza indirilir.\nSiber İstihbaratın Önemi\nSiber istihbaratın ilk ve en önemli amacı siber tehdit gelmeden önce gerekli hazırlıkların yapılmasıdır. Yapılan araştırmalara göre Cybersecurity Ventures’in[1] araştırmasına göre siber suçların 2021 yılında 6 trilyon dolara varan zarar verdiği tahmin edilmektedir. Ayrıca her yıl %15’lik artışla 2025 yılına kadar bu zararın 10 trilyon dolara çıkması beklenmektedir. Siber saldırılardan kazanılan kolay parayı gören suçluların bu alana yönelmesi ile siber güvenlik için her geçen gün daha önemli hale gelmektedir. Tam da bu nedenle günümüzde siber istihbarat bir seçenek olmaktan çıkarak bir zorunluluk haline gelmektedir.\n\nİşletmenizi ve İtibarınızı Siber Tehditlere Karşı Berqnet'le Koruyun!\n\n\n\n\n\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n\nAydınlatma metnini kabul ediyorum.\n\n\n\n\n\n\nWeb Sitesi Gizlilik Koşulları\nBu Web Sitesi Gizlilik Koşulları (“Gizlilik Koşulları”) www.berqnet.com’dan (“Web Sitesi”) faydalandığınız süreçte paylaştığınız ve/veya elde edilen bilgilerinizin gizliliğine ilişkindir.\nWeb Sitesi’ni kullanmanız, Gizlilik Koşulları’nı okuduğunuz ve kabul ettiğiniz anlamına gelir. Gizlilik Koşulları’nda öngörülen yükümlülükleri yerine getiremeyeceğinizi düşünüyorsanız, Web Sitesi’ni kullanmayınız. Bu Gizlilik Koşulları, Web Sitesi Kullanım Koşulları’nın (“Kullanım Koşulları”) eki ve ayrılmaz bir parçasıdır.\nBu Gizlilik Koşulları’nda; Logo Siber, aşağıda künye bilgileri yer alan şirketi ifade eder.\nVeri Sorumlusu : Logo Siber Güvenlik ve Ağ Teknolojileri A.Ş.\nAdres : Gebze Organize Sanayi Bölgesi, Şahabettin Bilgisu Cad. No:\n609 Gebze/Kocaeli\nMERSİS No : 0609048425600015\nTicaret Sicil No : 19067\nTelefon : +90 850 577 23 77\nWeb Sitesi : www.berqnet.com\n \n     1. KULLANICI BİLGİLERİ\nWeb Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen kimlik ve iletişim bilgisi dahil her türlü bilgiye ilişkin sorumluluk münhasıran ilgili Kullanıcı’ya aittir. Kullanıcı, Web Sitesi’ne ilettiği/gönderdiği her türlü bilginin güvenilirliğini, doğruluğunu, üçüncü şahısların haklarını ihlal etmediğini, yasalara aykırı olmadığını beyan ve garanti etmiştir.\n     2. BİLGİLERİN KORUNMASI\nLogo Siber, Web Sitesi’ndeki tüm sayfaların güvenliği için azami gayret göstermektedir. Web Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen verilerin gizliliğini, güvenliğini ve bütünlüğünü korumak için çeşitli teknik ve yönetimsel uygulamalardan yararlanılmaktadır.\n     3. KİŞİSEL VERİLER\n3.1 Toplanan ve İşlenen Kişisel Veriler\n6698 sayılı Kişisel Verilerin Korunması Kanunu (“Kanun”) uyarınca, kimliği belirli veya belirlenebilir gerçek kişiye ilişkin her türlü bilgi kişisel veridir (“Kişisel Veri”). Kullanıcıların Web Sitesi’ni ziyaret etmesi, kullanması, Web Sitesi üzerinden sunulan Hizmetler’den faydalanması ya da Web Sitesi’nin güvenliğinin sağlanması için ad, soyad, telefon numarası, e-posta adresi, firma, veri numarası, fatura bilgileri ve görev bilgisi, IP bilgileri, Cihaz Donanım ve Lisans Bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, cihaz tipi, kullanım tarih ve saati ve benzeri Kişisel Verileri Web Sitesi’ne iletilmiş, gönderilmiş, yüklenmiş, kaydedilmiş ve/veya girilmiş olabilir. Kullanıcılar; bu Kişisel Verilerin, Kullanım Koşulları’nda belirtilen şartlarla Logo Siber’e açık olacağını dikkate alarak bu bilgileri açıklamış olduklarını ve Web Sitesi’ne bizzat Kullanıcı tarafından iletilmiş ya da çerezler aracılığıyla toplanan her tür Kişisel Veri’nin Logo Siber’e karşı gizliliğini yitirdiğini kabul etmiş sayılırlar.\n3.2 Özel Nitelikli Kişisel Veriler\nLogo Siber, Kullanıcılar’dan yasalar gerektirmediği sürece herhangi bir şekilde ve kesinlikle; ırk, etnik köken, siyasi düşünce, felsefi inanç, din, mezhep veya diğer inançlar, kılık ve kıyafet, dernek, vakıf ya da sendika üyeliği, sağlık, cinsel hayat, ceza mahkûmiyeti ve güvenlik tedbirleriyle ilgili veriler ile biyometrik ve genetik verileri talep etmemektedir. Bu bilgilerin Web Sitesi’ne veya Web Sitesi üzerinden verilmiş, kaydedilmiş veya ifşa edilmiş olmasından dolayı Logo Siber’in bir sorumluluğu yoktur.\n3.3 Kişisel Verilerin Toplanması ve Kaydedilmesi\nLogo Siber Kişisel Verileri; bizzat Kullanıcılar’ın Web Sitesi üzerinden/aracılığıyla iletmesi, yüklemesi veya kaydetmesi suretiyle ve/veya çerezler aracılığıyla toplayabilmektedir.\n3.4 Kişisel Veri İşleme Amaçları ve Faaliyeti\nLogo Siber Kişisel Verileri,\n\nWeb Sitesi’ne erişimin sağlanması, Kullanıcılar’ın Kullanım Koşulları’na uygun olarak Web Sitesi ve Hizmetler’den yararlanmasının temin edilmesi,\nWeb Sitesi’nin ve Hizmetler’in geliştirilmesi,\nWeb Sitesi’nin güvenliğinin sağlanması, Web Sitesi’ne yönelik potansiyel risklerin tespiti ve engellenmesi,\nKullanıcılar’ın kullanım analizi, Web Sitesi ve Hizmetler’in kullanım analizine ve Kullanıcılar’ın tercihlerine göre kişiselleştirilmesi;\nWeb Sitesi’nin reklamlar yoluyla geliştirilmesi amacıyla, kişiselleştirilmiş reklam imkanlarının sunulması,\nHizmetler ve Logo Siber’in faaliyet alanıyla ilgili olarak reklam, pazarlama vb. faaliyetlerin gerçekleştirilmesi,\nKullanıcılar ile Web Sitesi kullanımı ve Hizmetler’den yararlanılması kapsamında iletişim sağlanması, elektronik ileti veya ticari elektronik ileti gönderilmesi,\nBaşvuru, bildirim, soru ve/veya taleplere cevap verilmesi, cevap sürecinde gerekli iç araştırmaların yapılması, başvuru kayıtlarının tutulması\nTelefonla pazarlama, tanıtım, iletişim vb. faaliyetlerde kullanılması\n\ngibi Kullanıcılar’ın Web Sitesi’nden etkin bir biçimde faydalanmasına yönelik amaçlar doğrultusunda kullanabilir, işleyebilir, saklayabilir, veri tabanlarında tasnif edebilir, Logo Siber’in faaliyet alanındaki işlerin ve/veya hizmetlerin amaçlarıyla uyumlu olarak kullanabilir, mevzuata uygun olarak yurt içine ya da yurt dışına transfer edebilir, üçüncü şahıslarla paylaşabilir, veri tabanında tasnif edebilir, veri tabanındaki verilerden yararlanabilir.\n     3.5 Kişisel Verilerin Aktarılabileceği Üçüncü Kişiler ve Aktarım Amaçları\n\nHukuken Yetkili Özel Hukuk Kişileri: Hukuken Logo Siber’den bilgi ve/veya belge talep etmeye yetkili özel hukuk kişilerine, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olarak Kişisel Veri aktarılabilir.\nKamu Kurum ve Kuruluşları: Yasal olarak yetkili kamu kurum ve kuruluşlarına, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olmak üzere Kişisel Veri aktarılabilir.\nWeb Sitesi Aracılığıyla Bağlantı Sağlanan Üçüncü Taraflar: Web Sitesi; üçüncü şahıslar tarafından işletilen web sitesi, ürün ve hizmetler içerebilir ve bunlara bağlantı sağlanabilir. Kullanıcılar’ın kendi tercihi ile bu web sitesi, ürün ve hizmetlerden faydalanmayı seçmesi durumunda Kişisel Verileri, ilgili üçüncü şahıs kişi ve/veya kuruluşlara aktarılabilir.\n\n     3.6 Logo Siber Tarafından İşlenen Kişisel Verilere ve Kişisel Verileri İşlenen Gerçek Kişilere İlişkin Kategorizasyon\nLogo Siber tarafından işlenebilecek Kişisel Veriler ve bu verilerin sahibi gerçek kişiler aşağıda detaylı olarak açıklanmış ve kategorize edilmiştir.\nBu kategorizasyonda Başvuran; Logo Siber’e yazılı veya elektronik olarak başvurarak soru, talep, öneri, şikayet, başvuruları ileten gerçek kişi Kullanıcılar’ı ifade eder. Bu madde anlamında başvurular Kişisel Verilere yönelik hakların kullanılması amacıyla yapılabileceği gibi, Web Sitesi üzerindeki formlar doldurularak Logo Siber ile iletişime geçilmesi, bunlar üzerinden Hizmet talep edilmesi suretiyle de gerçekleşebilir.\nKişisel Veri\n \nAçıklama\nVeri Sahibi\nKimlik Bilgisi\n:\nNüfus cüzdanı, ehliyet, pasaport gibi belgeler üzerinde yer alan ad-soyad gibi bilgilerdir.\nBaşvuran\nİletişim Bilgisi\n:\nVeri sahibi ile iletişim kurulmasını sağlayacak telefon numarası, adres, e-posta adresi gibi bilgilerdir.\nBaşvuran\nTemsilci Bilgisi\n:\nVeri sahibinin varsa veli, vasi, vekil, avukat gibi her türlü yasal temsilcilerine ilişkin bilgilerdir.\nBaşvuran\nDijital Veriler\n:\nVeri sahibinin Web Sitesi üzerinden veya aracılığıyla iletilmiş, göndermiş, yüklemiş, kaydetmiş ve/veya girmiş ve/veya çerezler aracılığıyla toplanan;  IP bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, kullanım tarih ve saati gibi verileridir.\nKullanıcılar\nBaşvuru Bilgisi\n:\nVeri sahibinin Logo Siber’e ilettiği herhangi bir soru, talep, öneri, şikayet veya başvurusu sebebiyle verdiği bilgiler, bunlara ilişkin değerlendirmeler ve Logo Siber nezdinde tutulan kayıtlardır.\nBaşvuran\n     4. GİZLİLİK KOŞULLARININ İHLALİ\n4.1 Logo Siber, Gizlilik Koşulları’na uyulmaması ya da kuralları ihlal etme girişiminde bulunulması durumunda, ihlal tam olarak gerçekleşsin ya da gerçekleşmesin, önceden haber vermeksizin Kullanıcıların Web Sitesi’ne erişimini askıya alma, sonlandırma veya varsa üyeliği iptal etme hakkını saklı tutar. Bu kural, Gizlilik Koşulları’nın Kullanıcılar tarafından dolaylı ihlali ya da ihlal girişimi olması durumu için de geçerlidir.\n4.2 Logo Siber’in burada yazılı herhangi bir hukuki hakkı ya da tedbiri kullanmaması ya da uygulamaması, Logo Siber’in Gizlilik Koşulları ya da yasadan doğan haklarından vazgeçtiği ya da ihlali kabul ettiği anlamına gelmez.\n     5. GİZLİLİK KOŞULLARININ TAKİBİ/DEĞİŞİKLİK\nLogo Siber, herhangi bir zamanda önceden haber vermeksizin Gizlilik Koşulları’nda değişiklik yapma ya da ek koşullar getirme hakkına sahiptir. Kullanım sırasında toplanan bilgilerin niteliklerinden, nasıl kullanıldığından, bu bilgilerin üçüncü şahıslar ile hangi durumlarda paylaşıldığından ve gerekli tüm gizlilik koşullarından haberdar olunması için yapılan değişiklikler Web Sitesi’nde sunulacak ve yayınladıkları tarihte yürürlüğe girecektir.  Gizlilik Koşulları’nın düzenli olarak takibi ve okunması Kullanıcıların sorumluluğundadır. Web Sitesi’ni yapılabilecek bu tarz bir değişiklikten sonraki kullanım, Gizlilik Koşulları’ndaki değişiklilerin kabul edildiği anlamına gelir.\n     6. AÇIK SİSTEM\nKullanıcılar; internet ortamının güvenilir bir ortam olmadığını, internet ortamında iletişimin riskli olduğunu, kişisel veriler, şifreler vb. de dâhil her türlü bilginin üçüncü şahısların hukuka aykırı fiillerinin muhatabı olabileceğini bilmekte ve kabul etmektedir. Logo Siber, Web Sitesi’nin güvenli olduğu yönünde ve/veya kötü niyetli hareketlerle ilgili olarak hiçbir garanti vermemektedir.\n     7. WEB SİTESİ YARDIMCI PROGRAMLARI\nWeb Sitesi’nden daha kolay yararlanabilmeniz için bazı “çerez”lerden yararlanılabilir, bunlar vasıtasıyla Kullanıcılar’a bazı bilgiler gönderilebilir veya bazı Kullanıcı bilgileri toplanabilir. Çerezlerle ilgili veri toplanmasının istenmediği durumlarda, kullanıcıların veri toplanmasını engelleme hakkı mevcuttur.\n     8. BİLGİ VE İLETİŞİM\nGizlilik Koşullarına ilişkin sorularınız için bize 0850 577 23 77 nolu telefondan ulaşabilirsiniz.\n\n\n\n\n\n\n\n\n\n\nÜrünle ilgili önemlli gelişme ve haberleri almak istiyorum.\n\n\n\n\n\n\n\n\nGÖNDER\n\n\n\n\n\nSiber İstihbaratın Yararları\nSiber istihbaratın belki de en önemli faydalarından biri kişi veya kurumlar için son derece değerli olan verilerin korunmasıdır. Verilerin korunması iki şekilde fayda sağlar. Birincisi kişi veya kurumlar için son derece önemli olan verilerin kaybedilmesinin önlemesidir. Diğeri ise bazen ticari bazen de manevi değeri olan bu verilerin kötü niyetli kişilerin eline geçmesinin önlenmesidir. Diğer bir fayda ise veri ihlalinin en kısa zamanda tespit edilmesidir. Veri başkasının eline geçtikten ya da silindikten sonra kim tarafından yapıldığı öğrenilse dahi bunun pek bir önemi kalmaz. Veri ihlalinin anında fark edilmesi ise önlenmesine imkân verir. Sistemin farklı kısımlarında gerçekleşen ihlallerin incelenmesi sonucunda alınan tedbirler ile yeni ihlallerin gerçekleştirilmesinin önüne geçilir. Saldırı ve tehditlerin oluşturduğu veri birikimi sayesinde tehditler analiz edilerek yeni tedbirler gündeme getirilir.\n\n12 Ekim 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Güvenlik Açığı Nedir? Güvenlik Açıklarından Korunma Yolları Nelerdir?",
  "url": "https://berqnet.com/blog/guvenlik-acigi",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nGüvenlik Açığı Nedir? Güvenlik Açıklarından Korunma Yolları Nelerdir?\n\nHer türlü donanımsal ya da yazılımsal hata güvenlik açığı olarak tanımlanır.\n\n\n\n\nHerhangi bir güvenlik açığını tespit eden kötü amaçlı kullanıcılar bu durumdan yararlanmaya çalışırlar. Bu nedenle hem bireysel kullanıcılar hem de firmalar güvenlik açıklarına karşı siber önlemler alarak verilerinin korunmasını sağlayabilirler. Aksi halde istismar olarak bilinen exploit saldırıları veri güvenliğinizi tehdit edebilir. Exploit, güvenlik açıklarından yararlanmayı sağlayan programlar için kullanılan bir tabirdir. Bu tür saldırılar hem donanımsal aygıtları hem de e-ticaret sitesi gibi dijital platformları risk altında bırakır. Kişisel kaynaklarınızı ya da şirket verilerinizi kötü amaçlı siber saldırılardan korumak için bazı dijital güvenlik önlemleri alabilirsiniz. Güvenlik duvarı araçlarından yararlanarak siber güvenlik konusunda etkin bir koruma sağlayabilirsiniz.\nGüvenlik Açıkları Nelerdir?\nYazılımsal güvenlik açıkları genellikle uygulama kodlarındaki ya da işletim sistemindeki hatalardan kaynaklanır. Üretici firmalar yazılım açıklarını bulmak için geliştirici çalışmalar yapsa da sürekli yeni açıkların ortaya çıkması sıklıkla yaşanan bir sorundur. İşletim sistemi üreticileri hemen hemen her gün yeni güncellemeler yayımlayarak yazılımsal güvenlik açıklarının önüne geçmeyi amaçlamaktadır. Aynı şekilde uygulama güncellemeleri de geliştirilmeye devam etmektedir. Mobil uygulamalar, web sunucuları ve tarayıcıları çoğunlukla üretici kuruluşlar tarafından güncellenir. Bu güncellemelerin temel amacı, kullanıcıları yeni bir deneyimle buluşturmak ve güvenlik açıklarını kapatmaktır.\nGoogle bu bağlamda Project Zero isimli bir ekip kurmuştur. Çeşitli yazılımlarda bazı güvenlik açıklarını tespit eden Google, yazılımsal açıklar üzerinde de çalışmaktadır. Google gibi şirketler kendi siber güvenlik takımlarını kurmanın yanı sıra kendi ürünlerinde açık bulan kişileri de ödüllendirmektedir. Bug Bounty adı verilen bu ödül programları Apple, Yandex, Microsoft ve Uber gibi büyük şirketler tarafından da desteklenmektedir. Ödül avcılığı sistemlerine göre bir web sitesi ve yazılımda bulduğunuz açıkları uygun bir şekilde raporlayıp bildirerek binlerce dolara varan ödüller kazanabilirsiniz.\nGüvenlik açıkları donanımsal sorunlardan da kaynaklanabilir. Genellikle donanım tasarımı hataları olarak adlandırılan bu açıklar, verilerinizin kötü amaçlı kişilerin eline geçmesine neden olabilir. Örneğin bir RAM bellekte birbirine çok yakın olarak entegre edilen kapasitörler, bu şekilde konumlandıkları için komşu kapasitörleri etkileyebilir. Bu tasarım kusuru baz alınarak Rowhammer isimli bir exploit (istismar) oluşturulmuştur. Bu exploit, aynı adreslerdeki bellekleri defalarca yazarak verilerin çalınmasına olanak tanır.\nDonanımsal güvenlik açıkları, cihaz modellerine özgüdür. Genellikle rastgele girişimler bu açıkların istismar edilmesine neden olmaz. Hedefli ve planlı siber saldırılara açık hale gelen donanımsal istismarlar, kişisel verilerinizin korunması konusunda tehdit oluşturabilir.\nGüvenlik Açıkları Nasıl Tespit Edilir?\nKötü amaçlı kişiler öncelikli olarak yönetici bilgisayarı, açık yönlendirmeler, zayıf ve eski şifreler gibi seçeneklere yönelerek siber saldırılar gerçekleştirirler. Deneyimli hackerler için bu tür uygulamalar ile verilere erişmek oldukça kolaydır. Bu tür siber saldırılardan korunmak için bazı önlemler alabilirsiniz. Örneğin yönetici sistemlerinde virüs olup olmadığını kontrol edebilirsiniz. Bunun için çeşitli virüs koruma programlarını ya da AV tarayıcılarını kullanabilirsiniz. Kötü amaçlı yazılımlar virüs algılamasında kullanılan yöntemlerden gizlenebilmek için sürekli güncellenirler. Bu nedenle bu yöntemler her zaman etkili bir virüs koruması sunmayabilir. AV tarayıcıları bazen yanlış pozitif sonuçlar verebilir. Birden fazla tarayıcıdan yararlanmak daha güvenilir sonuçlar verecektir. Virüs tespiti için site, sunucu ve içerik yayımlamada kullanılan tüm araçları taramayı tercih etmelisiniz.\nGüvenlik Açıkları Nasıl Kapatılabilir?\nYazılımsal ve donanımsal zafiyetler güvenlik açıklarına neden olabilir. Aynı şekilde dijital platformlar da siber saldırılara uğrayabilir. E-ticaret platformları bu açıdan siber güvenlik konusundaki çalışmalarını geliştirmeye ihtiyaç duyar. Bazı kriterlere dikkat ederek güvenlik açıklarına karşı çok yönlü önlemler alabilirsiniz.\n\nEski yazılımlar kullanmak bilgisayar korsanlarının güvenlik açığı yakalamasına neden olabilir. Kullandığınız uygulama ve yazılımlar için yeni bir güvenlik önerisi olup olmadığını takip etmeniz gerekir. Uygulama ve yazılımların güncel sürümlerini tercih ederek olası güvenlik açığı problemlerini en aza indirebilirsiniz. Ayrıca yazılımda “açık yönlendirmelere izin ver” ayarının varsayılan olarak seçilmiş olup olmadığına dikkat etmelisiniz. Alan dışı yönlendirmeleri kapatmak güvenlik açıklarını kontrol altına almaya yardımcı olabilir.\nHackerların SQL yerleştirme işlemiyle veri tabanınıza kullanıcı girişi sağlaması ve hileli komutlar ekleyememeleri için de bazı önlemler alabilirsiniz. Bu bağlamda kullanıcı girişi doğrulanmış, çıkış karakterleri doğru bir şekilde kullanılmış ya da tanımlı olarak yazılabilir. Bu kriterleri kontrol ettikten sonra kullanıcı girişinin veri tabanına işlenmiş olup olmadığına dikkat etmelisiniz. Bu kontrolleri yapmadığınız durumlarda bilgisayar korsanları SQL yerleştirme tekniğinden yararlanarak güvenlik açığı yakalayabilir.\nSite, uygulama ya da cihazlarda kullanılan zayıf şifreleri kırmak hacker olarak bilenen bilgisayar korsanları için genellikle kolaydır. Farklı platformlar için tahmin edilmesi zor ve güçlü şifreler kullanmayı tercih ederek güvenlik açıklarını engelleyebilirsiniz. Aynı şifreleri farklı uygulamalarda kullanmak yerine her uygulama için yeni bir şifre oluşturabilirsiniz. E-ticaret gibi kullanıcı profili oluşturmanız gereken sitelerde güçlü şifreler kullanmak kişisel verilerinizin korunması açısından oldukça önemlidir.\nFirewall (güvenlik duvarı) araçları iş yerleri ve kişisel kullanım için siber saldırıların önüne geçmeye yardımcı olur. Üçüncü kişilerin eline geçmemesi gereken şifre ve adres bilgileri gibi veriler bu sayede korunabilir.\n\nKişisel Verilerinizi Hacker Saldırılarından Koruyun\n‘’Hacklemek’’ tabiri siber güvenlik söz konusu olduğunda dilimizde sıklıkla kullanılan bir tanım haline gelmiştir. Hack olarak bilinen kötü amaçlı eylem, güvenlik açıklarından yararlanılmasıyla bir sisteme farklı yöntemler denenerek erişilmesini ifade eder. Hack sürecinde güvenlik açıkları aracılığı ile ikinci bir erişim yolu elde edilmiş olur. Hack eylemini gerçekleştiren, teknik beceri ve bilgi sahibi olan kişiler ise hacker olarak bilinmektedir. Hacker’lar yazılım, ağ bağlantısı ve sistem konularında uzman olan kişilerdir. Bu sayede internet üzerindeki hesapların ve elektronik tabanlı sistemlerin açıklarından yararlanarak pek çok bilgiye erişebilirler.\nSiyah şapkalı hacker olarak bilinen kişiler yetenek, beceri ve bilgilerini kötü amaçlı olarak kullanırlar. Siyah şapkalı hacker eylemleri siber suçlar kapsamındadır. Bu kişiler hem şirket verilerinize hem de kişisel verilerinize erişim sağlayabilirler. Bu bağlamda kötü amaçlı yazılımlar, sosyal mühendislik saldırıları, Zero Day saldırıları ve hacktivist eylemlerini tercih edebilir. Her an siber saldırılara maruz kalma riskinizin olduğu bilincinde olarak yazılımsal ve donanımsal güvenlik açıklarına dair etkili önlemler almalısınız. Veri güvenliğinizi sağlamak için güvenlik duvarı araçları gibi etkili koruma sistemlerini tercih etmelisiniz.\n\nİşletmenizi ve İtibarınızı Siber Tehditlere Karşı Berqnet'le Koruyun!\n\n\n\n\n\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n\nAydınlatma metnini kabul ediyorum.\n\n\n\n\n\n\nWeb Sitesi Gizlilik Koşulları\nBu Web Sitesi Gizlilik Koşulları (“Gizlilik Koşulları”) www.berqnet.com’dan (“Web Sitesi”) faydalandığınız süreçte paylaştığınız ve/veya elde edilen bilgilerinizin gizliliğine ilişkindir.\nWeb Sitesi’ni kullanmanız, Gizlilik Koşulları’nı okuduğunuz ve kabul ettiğiniz anlamına gelir. Gizlilik Koşulları’nda öngörülen yükümlülükleri yerine getiremeyeceğinizi düşünüyorsanız, Web Sitesi’ni kullanmayınız. Bu Gizlilik Koşulları, Web Sitesi Kullanım Koşulları’nın (“Kullanım Koşulları”) eki ve ayrılmaz bir parçasıdır.\nBu Gizlilik Koşulları’nda; Logo Siber, aşağıda künye bilgileri yer alan şirketi ifade eder.\nVeri Sorumlusu : Logo Siber Güvenlik ve Ağ Teknolojileri A.Ş.\nAdres : Gebze Organize Sanayi Bölgesi, Şahabettin Bilgisu Cad. No:\n609 Gebze/Kocaeli\nMERSİS No : 0609048425600015\nTicaret Sicil No : 19067\nTelefon : +90 850 577 23 77\nWeb Sitesi : www.berqnet.com\n \n     1. KULLANICI BİLGİLERİ\nWeb Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen kimlik ve iletişim bilgisi dahil her türlü bilgiye ilişkin sorumluluk münhasıran ilgili Kullanıcı’ya aittir. Kullanıcı, Web Sitesi’ne ilettiği/gönderdiği her türlü bilginin güvenilirliğini, doğruluğunu, üçüncü şahısların haklarını ihlal etmediğini, yasalara aykırı olmadığını beyan ve garanti etmiştir.\n     2. BİLGİLERİN KORUNMASI\nLogo Siber, Web Sitesi’ndeki tüm sayfaların güvenliği için azami gayret göstermektedir. Web Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen verilerin gizliliğini, güvenliğini ve bütünlüğünü korumak için çeşitli teknik ve yönetimsel uygulamalardan yararlanılmaktadır.\n     3. KİŞİSEL VERİLER\n3.1 Toplanan ve İşlenen Kişisel Veriler\n6698 sayılı Kişisel Verilerin Korunması Kanunu (“Kanun”) uyarınca, kimliği belirli veya belirlenebilir gerçek kişiye ilişkin her türlü bilgi kişisel veridir (“Kişisel Veri”). Kullanıcıların Web Sitesi’ni ziyaret etmesi, kullanması, Web Sitesi üzerinden sunulan Hizmetler’den faydalanması ya da Web Sitesi’nin güvenliğinin sağlanması için ad, soyad, telefon numarası, e-posta adresi, firma, veri numarası, fatura bilgileri ve görev bilgisi, IP bilgileri, Cihaz Donanım ve Lisans Bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, cihaz tipi, kullanım tarih ve saati ve benzeri Kişisel Verileri Web Sitesi’ne iletilmiş, gönderilmiş, yüklenmiş, kaydedilmiş ve/veya girilmiş olabilir. Kullanıcılar; bu Kişisel Verilerin, Kullanım Koşulları’nda belirtilen şartlarla Logo Siber’e açık olacağını dikkate alarak bu bilgileri açıklamış olduklarını ve Web Sitesi’ne bizzat Kullanıcı tarafından iletilmiş ya da çerezler aracılığıyla toplanan her tür Kişisel Veri’nin Logo Siber’e karşı gizliliğini yitirdiğini kabul etmiş sayılırlar.\n3.2 Özel Nitelikli Kişisel Veriler\nLogo Siber, Kullanıcılar’dan yasalar gerektirmediği sürece herhangi bir şekilde ve kesinlikle; ırk, etnik köken, siyasi düşünce, felsefi inanç, din, mezhep veya diğer inançlar, kılık ve kıyafet, dernek, vakıf ya da sendika üyeliği, sağlık, cinsel hayat, ceza mahkûmiyeti ve güvenlik tedbirleriyle ilgili veriler ile biyometrik ve genetik verileri talep etmemektedir. Bu bilgilerin Web Sitesi’ne veya Web Sitesi üzerinden verilmiş, kaydedilmiş veya ifşa edilmiş olmasından dolayı Logo Siber’in bir sorumluluğu yoktur.\n3.3 Kişisel Verilerin Toplanması ve Kaydedilmesi\nLogo Siber Kişisel Verileri; bizzat Kullanıcılar’ın Web Sitesi üzerinden/aracılığıyla iletmesi, yüklemesi veya kaydetmesi suretiyle ve/veya çerezler aracılığıyla toplayabilmektedir.\n3.4 Kişisel Veri İşleme Amaçları ve Faaliyeti\nLogo Siber Kişisel Verileri,\n\nWeb Sitesi’ne erişimin sağlanması, Kullanıcılar’ın Kullanım Koşulları’na uygun olarak Web Sitesi ve Hizmetler’den yararlanmasının temin edilmesi,\nWeb Sitesi’nin ve Hizmetler’in geliştirilmesi,\nWeb Sitesi’nin güvenliğinin sağlanması, Web Sitesi’ne yönelik potansiyel risklerin tespiti ve engellenmesi,\nKullanıcılar’ın kullanım analizi, Web Sitesi ve Hizmetler’in kullanım analizine ve Kullanıcılar’ın tercihlerine göre kişiselleştirilmesi;\nWeb Sitesi’nin reklamlar yoluyla geliştirilmesi amacıyla, kişiselleştirilmiş reklam imkanlarının sunulması,\nHizmetler ve Logo Siber’in faaliyet alanıyla ilgili olarak reklam, pazarlama vb. faaliyetlerin gerçekleştirilmesi,\nKullanıcılar ile Web Sitesi kullanımı ve Hizmetler’den yararlanılması kapsamında iletişim sağlanması, elektronik ileti veya ticari elektronik ileti gönderilmesi,\nBaşvuru, bildirim, soru ve/veya taleplere cevap verilmesi, cevap sürecinde gerekli iç araştırmaların yapılması, başvuru kayıtlarının tutulması\nTelefonla pazarlama, tanıtım, iletişim vb. faaliyetlerde kullanılması\n\ngibi Kullanıcılar’ın Web Sitesi’nden etkin bir biçimde faydalanmasına yönelik amaçlar doğrultusunda kullanabilir, işleyebilir, saklayabilir, veri tabanlarında tasnif edebilir, Logo Siber’in faaliyet alanındaki işlerin ve/veya hizmetlerin amaçlarıyla uyumlu olarak kullanabilir, mevzuata uygun olarak yurt içine ya da yurt dışına transfer edebilir, üçüncü şahıslarla paylaşabilir, veri tabanında tasnif edebilir, veri tabanındaki verilerden yararlanabilir.\n     3.5 Kişisel Verilerin Aktarılabileceği Üçüncü Kişiler ve Aktarım Amaçları\n\nHukuken Yetkili Özel Hukuk Kişileri: Hukuken Logo Siber’den bilgi ve/veya belge talep etmeye yetkili özel hukuk kişilerine, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olarak Kişisel Veri aktarılabilir.\nKamu Kurum ve Kuruluşları: Yasal olarak yetkili kamu kurum ve kuruluşlarına, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olmak üzere Kişisel Veri aktarılabilir.\nWeb Sitesi Aracılığıyla Bağlantı Sağlanan Üçüncü Taraflar: Web Sitesi; üçüncü şahıslar tarafından işletilen web sitesi, ürün ve hizmetler içerebilir ve bunlara bağlantı sağlanabilir. Kullanıcılar’ın kendi tercihi ile bu web sitesi, ürün ve hizmetlerden faydalanmayı seçmesi durumunda Kişisel Verileri, ilgili üçüncü şahıs kişi ve/veya kuruluşlara aktarılabilir.\n\n     3.6 Logo Siber Tarafından İşlenen Kişisel Verilere ve Kişisel Verileri İşlenen Gerçek Kişilere İlişkin Kategorizasyon\nLogo Siber tarafından işlenebilecek Kişisel Veriler ve bu verilerin sahibi gerçek kişiler aşağıda detaylı olarak açıklanmış ve kategorize edilmiştir.\nBu kategorizasyonda Başvuran; Logo Siber’e yazılı veya elektronik olarak başvurarak soru, talep, öneri, şikayet, başvuruları ileten gerçek kişi Kullanıcılar’ı ifade eder. Bu madde anlamında başvurular Kişisel Verilere yönelik hakların kullanılması amacıyla yapılabileceği gibi, Web Sitesi üzerindeki formlar doldurularak Logo Siber ile iletişime geçilmesi, bunlar üzerinden Hizmet talep edilmesi suretiyle de gerçekleşebilir.\nKişisel Veri\n \nAçıklama\nVeri Sahibi\nKimlik Bilgisi\n:\nNüfus cüzdanı, ehliyet, pasaport gibi belgeler üzerinde yer alan ad-soyad gibi bilgilerdir.\nBaşvuran\nİletişim Bilgisi\n:\nVeri sahibi ile iletişim kurulmasını sağlayacak telefon numarası, adres, e-posta adresi gibi bilgilerdir.\nBaşvuran\nTemsilci Bilgisi\n:\nVeri sahibinin varsa veli, vasi, vekil, avukat gibi her türlü yasal temsilcilerine ilişkin bilgilerdir.\nBaşvuran\nDijital Veriler\n:\nVeri sahibinin Web Sitesi üzerinden veya aracılığıyla iletilmiş, göndermiş, yüklemiş, kaydetmiş ve/veya girmiş ve/veya çerezler aracılığıyla toplanan;  IP bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, kullanım tarih ve saati gibi verileridir.\nKullanıcılar\nBaşvuru Bilgisi\n:\nVeri sahibinin Logo Siber’e ilettiği herhangi bir soru, talep, öneri, şikayet veya başvurusu sebebiyle verdiği bilgiler, bunlara ilişkin değerlendirmeler ve Logo Siber nezdinde tutulan kayıtlardır.\nBaşvuran\n     4. GİZLİLİK KOŞULLARININ İHLALİ\n4.1 Logo Siber, Gizlilik Koşulları’na uyulmaması ya da kuralları ihlal etme girişiminde bulunulması durumunda, ihlal tam olarak gerçekleşsin ya da gerçekleşmesin, önceden haber vermeksizin Kullanıcıların Web Sitesi’ne erişimini askıya alma, sonlandırma veya varsa üyeliği iptal etme hakkını saklı tutar. Bu kural, Gizlilik Koşulları’nın Kullanıcılar tarafından dolaylı ihlali ya da ihlal girişimi olması durumu için de geçerlidir.\n4.2 Logo Siber’in burada yazılı herhangi bir hukuki hakkı ya da tedbiri kullanmaması ya da uygulamaması, Logo Siber’in Gizlilik Koşulları ya da yasadan doğan haklarından vazgeçtiği ya da ihlali kabul ettiği anlamına gelmez.\n     5. GİZLİLİK KOŞULLARININ TAKİBİ/DEĞİŞİKLİK\nLogo Siber, herhangi bir zamanda önceden haber vermeksizin Gizlilik Koşulları’nda değişiklik yapma ya da ek koşullar getirme hakkına sahiptir. Kullanım sırasında toplanan bilgilerin niteliklerinden, nasıl kullanıldığından, bu bilgilerin üçüncü şahıslar ile hangi durumlarda paylaşıldığından ve gerekli tüm gizlilik koşullarından haberdar olunması için yapılan değişiklikler Web Sitesi’nde sunulacak ve yayınladıkları tarihte yürürlüğe girecektir.  Gizlilik Koşulları’nın düzenli olarak takibi ve okunması Kullanıcıların sorumluluğundadır. Web Sitesi’ni yapılabilecek bu tarz bir değişiklikten sonraki kullanım, Gizlilik Koşulları’ndaki değişiklilerin kabul edildiği anlamına gelir.\n     6. AÇIK SİSTEM\nKullanıcılar; internet ortamının güvenilir bir ortam olmadığını, internet ortamında iletişimin riskli olduğunu, kişisel veriler, şifreler vb. de dâhil her türlü bilginin üçüncü şahısların hukuka aykırı fiillerinin muhatabı olabileceğini bilmekte ve kabul etmektedir. Logo Siber, Web Sitesi’nin güvenli olduğu yönünde ve/veya kötü niyetli hareketlerle ilgili olarak hiçbir garanti vermemektedir.\n     7. WEB SİTESİ YARDIMCI PROGRAMLARI\nWeb Sitesi’nden daha kolay yararlanabilmeniz için bazı “çerez”lerden yararlanılabilir, bunlar vasıtasıyla Kullanıcılar’a bazı bilgiler gönderilebilir veya bazı Kullanıcı bilgileri toplanabilir. Çerezlerle ilgili veri toplanmasının istenmediği durumlarda, kullanıcıların veri toplanmasını engelleme hakkı mevcuttur.\n     8. BİLGİ VE İLETİŞİM\nGizlilik Koşullarına ilişkin sorularınız için bize 0850 577 23 77 nolu telefondan ulaşabilirsiniz.\n\n\n\n\n\n\n\n\n\n\nÜrünle ilgili önemlli gelişme ve haberleri almak istiyorum.\n\n\n\n\n\n\n\n\nGÖNDER\n\n\n\n\n\nBerqnet Firewall ile Siber Saldırıları Engelleyin\nFirma verilerinin kötü amaçlı kişilerden korunması için siber saldırılara karşı etkin koruma sağlayan bir firewall (güvenlik duvarı) aracı kullanmanız gerekir. Berqnet Firewall, orta ve büyük ölçekli işletmelerin siber güvenlik ihtiyaçlarına yönelik çözümler üretir. KVKK ve 5651 sayılı yasa hükümleri göz önünde bulundurularak hazırlanan bu siber güvenlik aracı IPS (Saldırı Engelleme Sistemi) sayesinde şirket verilerinizin üçüncü kişilere onayınız dışında sunulmasına engel olur. Berqnet’in VPN özelliğinden yararlanarak şubeler arası ve personel ile merkez arası güvenli bir iletişim kanalı oluşturabilirsiniz. Web ve uygulama filtreleme özellikleriyle siber saldırıların önüne geçebileceğiniz gibi çalışanlarınızın iş saatlerini verimli bir şekilde geçirmesini sağlayabilirsiniz. Berqnet’in sağladığı Hotspot özelliği işletmenizi ziyaret eden misafirlerin güvenli kanallar aracılığıyla internet kullanımına yardımcı olur. Böylece kendi kişisel bilgileri ile internet erişimi sağlayan misafirlerinizin sanal platformlarda gerçekleştirdiği olumsuz eylemlerden dolayı şirketiniz hiçbir sorumluluk almaz. Şirketiniz veya firmanızın siber güvenlik ihtiyaçlarına hitap eden çok yönlü bir güvenlik aracına sahip olmak için Berqnet’i tercih edebilirsiniz. Kolay kurulum ve geniş alanlarda siber güvenlik koruması sunan Berqnet ile veri güvenliğini etkili bir şekilde sağlayabilirsiniz. \n\n8 Ekim 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}{
  "baslik": "Dikkat Coin cüzdanınız hacklenmesin! Kripto paralarınızı oltalama saldırılarından koruyun",
  "url": "https://berqnet.com/blog/kripto-paralar-icin-bilgi-guvenligi",
  "metin": "\n\n\nYazıyı Paylaş\n\n\n\n\n\nYazıyı Paylaş\n\n\n\nDikkat Coin cüzdanınız hacklenmesin! Kripto paralarınızı oltalama saldırılarından koruyun\n\nTeknoloji, paranın mülkiyetinin ve hareketinin elektronik ortama taşınmasına fırsat vermektedir. Dijital ortamda ticari işlemler, ödemeler, para transferleri gerçekleştirilmektedir\n\n\n\n\n\nİşletmenizi ve İtibarınızı Siber Tehditlere Karşı Korumak İçin Berqnet Firewall Teklifi Alın\n\n\n\n\n\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n*\n\n\n\n\n\n\n\n\n\nAydınlatma metnini kabul ediyorum.\n\n\n\n\n\n\nWeb Sitesi Gizlilik Koşulları\nBu Web Sitesi Gizlilik Koşulları (“Gizlilik Koşulları”) www.berqnet.com’dan (“Web Sitesi”) faydalandığınız süreçte paylaştığınız ve/veya elde edilen bilgilerinizin gizliliğine ilişkindir.\nWeb Sitesi’ni kullanmanız, Gizlilik Koşulları’nı okuduğunuz ve kabul ettiğiniz anlamına gelir. Gizlilik Koşulları’nda öngörülen yükümlülükleri yerine getiremeyeceğinizi düşünüyorsanız, Web Sitesi’ni kullanmayınız. Bu Gizlilik Koşulları, Web Sitesi Kullanım Koşulları’nın (“Kullanım Koşulları”) eki ve ayrılmaz bir parçasıdır.\nBu Gizlilik Koşulları’nda; Logo Siber, aşağıda künye bilgileri yer alan şirketi ifade eder.\nVeri Sorumlusu : Logo Siber Güvenlik ve Ağ Teknolojileri A.Ş.\nAdres : Gebze Organize Sanayi Bölgesi, Şahabettin Bilgisu Cad. No:\n609 Gebze/Kocaeli\nMERSİS No : 0609048425600015\nTicaret Sicil No : 19067\nTelefon : +90 850 577 23 77\nWeb Sitesi : www.berqnet.com\n \n     1. KULLANICI BİLGİLERİ\nWeb Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen kimlik ve iletişim bilgisi dahil her türlü bilgiye ilişkin sorumluluk münhasıran ilgili Kullanıcı’ya aittir. Kullanıcı, Web Sitesi’ne ilettiği/gönderdiği her türlü bilginin güvenilirliğini, doğruluğunu, üçüncü şahısların haklarını ihlal etmediğini, yasalara aykırı olmadığını beyan ve garanti etmiştir.\n     2. BİLGİLERİN KORUNMASI\nLogo Siber, Web Sitesi’ndeki tüm sayfaların güvenliği için azami gayret göstermektedir. Web Sitesi’ne iletilen, gönderilen, yüklenen, kaydedilen ve/veya girilen verilerin gizliliğini, güvenliğini ve bütünlüğünü korumak için çeşitli teknik ve yönetimsel uygulamalardan yararlanılmaktadır.\n     3. KİŞİSEL VERİLER\n3.1 Toplanan ve İşlenen Kişisel Veriler\n6698 sayılı Kişisel Verilerin Korunması Kanunu (“Kanun”) uyarınca, kimliği belirli veya belirlenebilir gerçek kişiye ilişkin her türlü bilgi kişisel veridir (“Kişisel Veri”). Kullanıcıların Web Sitesi’ni ziyaret etmesi, kullanması, Web Sitesi üzerinden sunulan Hizmetler’den faydalanması ya da Web Sitesi’nin güvenliğinin sağlanması için ad, soyad, telefon numarası, e-posta adresi, firma, veri numarası, fatura bilgileri ve görev bilgisi, IP bilgileri, Cihaz Donanım ve Lisans Bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, cihaz tipi, kullanım tarih ve saati ve benzeri Kişisel Verileri Web Sitesi’ne iletilmiş, gönderilmiş, yüklenmiş, kaydedilmiş ve/veya girilmiş olabilir. Kullanıcılar; bu Kişisel Verilerin, Kullanım Koşulları’nda belirtilen şartlarla Logo Siber’e açık olacağını dikkate alarak bu bilgileri açıklamış olduklarını ve Web Sitesi’ne bizzat Kullanıcı tarafından iletilmiş ya da çerezler aracılığıyla toplanan her tür Kişisel Veri’nin Logo Siber’e karşı gizliliğini yitirdiğini kabul etmiş sayılırlar.\n3.2 Özel Nitelikli Kişisel Veriler\nLogo Siber, Kullanıcılar’dan yasalar gerektirmediği sürece herhangi bir şekilde ve kesinlikle; ırk, etnik köken, siyasi düşünce, felsefi inanç, din, mezhep veya diğer inançlar, kılık ve kıyafet, dernek, vakıf ya da sendika üyeliği, sağlık, cinsel hayat, ceza mahkûmiyeti ve güvenlik tedbirleriyle ilgili veriler ile biyometrik ve genetik verileri talep etmemektedir. Bu bilgilerin Web Sitesi’ne veya Web Sitesi üzerinden verilmiş, kaydedilmiş veya ifşa edilmiş olmasından dolayı Logo Siber’in bir sorumluluğu yoktur.\n3.3 Kişisel Verilerin Toplanması ve Kaydedilmesi\nLogo Siber Kişisel Verileri; bizzat Kullanıcılar’ın Web Sitesi üzerinden/aracılığıyla iletmesi, yüklemesi veya kaydetmesi suretiyle ve/veya çerezler aracılığıyla toplayabilmektedir.\n3.4 Kişisel Veri İşleme Amaçları ve Faaliyeti\nLogo Siber Kişisel Verileri,\n\nWeb Sitesi’ne erişimin sağlanması, Kullanıcılar’ın Kullanım Koşulları’na uygun olarak Web Sitesi ve Hizmetler’den yararlanmasının temin edilmesi,\nWeb Sitesi’nin ve Hizmetler’in geliştirilmesi,\nWeb Sitesi’nin güvenliğinin sağlanması, Web Sitesi’ne yönelik potansiyel risklerin tespiti ve engellenmesi,\nKullanıcılar’ın kullanım analizi, Web Sitesi ve Hizmetler’in kullanım analizine ve Kullanıcılar’ın tercihlerine göre kişiselleştirilmesi;\nWeb Sitesi’nin reklamlar yoluyla geliştirilmesi amacıyla, kişiselleştirilmiş reklam imkanlarının sunulması,\nHizmetler ve Logo Siber’in faaliyet alanıyla ilgili olarak reklam, pazarlama vb. faaliyetlerin gerçekleştirilmesi,\nKullanıcılar ile Web Sitesi kullanımı ve Hizmetler’den yararlanılması kapsamında iletişim sağlanması, elektronik ileti veya ticari elektronik ileti gönderilmesi,\nBaşvuru, bildirim, soru ve/veya taleplere cevap verilmesi, cevap sürecinde gerekli iç araştırmaların yapılması, başvuru kayıtlarının tutulması\nTelefonla pazarlama, tanıtım, iletişim vb. faaliyetlerde kullanılması\n\ngibi Kullanıcılar’ın Web Sitesi’nden etkin bir biçimde faydalanmasına yönelik amaçlar doğrultusunda kullanabilir, işleyebilir, saklayabilir, veri tabanlarında tasnif edebilir, Logo Siber’in faaliyet alanındaki işlerin ve/veya hizmetlerin amaçlarıyla uyumlu olarak kullanabilir, mevzuata uygun olarak yurt içine ya da yurt dışına transfer edebilir, üçüncü şahıslarla paylaşabilir, veri tabanında tasnif edebilir, veri tabanındaki verilerden yararlanabilir.\n     3.5 Kişisel Verilerin Aktarılabileceği Üçüncü Kişiler ve Aktarım Amaçları\n\nHukuken Yetkili Özel Hukuk Kişileri: Hukuken Logo Siber’den bilgi ve/veya belge talep etmeye yetkili özel hukuk kişilerine, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olarak Kişisel Veri aktarılabilir.\nKamu Kurum ve Kuruluşları: Yasal olarak yetkili kamu kurum ve kuruluşlarına, talepleriyle ve yasal olarak iletilmesi gerekenle sınırlı olmak üzere Kişisel Veri aktarılabilir.\nWeb Sitesi Aracılığıyla Bağlantı Sağlanan Üçüncü Taraflar: Web Sitesi; üçüncü şahıslar tarafından işletilen web sitesi, ürün ve hizmetler içerebilir ve bunlara bağlantı sağlanabilir. Kullanıcılar’ın kendi tercihi ile bu web sitesi, ürün ve hizmetlerden faydalanmayı seçmesi durumunda Kişisel Verileri, ilgili üçüncü şahıs kişi ve/veya kuruluşlara aktarılabilir.\n\n     3.6 Logo Siber Tarafından İşlenen Kişisel Verilere ve Kişisel Verileri İşlenen Gerçek Kişilere İlişkin Kategorizasyon\nLogo Siber tarafından işlenebilecek Kişisel Veriler ve bu verilerin sahibi gerçek kişiler aşağıda detaylı olarak açıklanmış ve kategorize edilmiştir.\nBu kategorizasyonda Başvuran; Logo Siber’e yazılı veya elektronik olarak başvurarak soru, talep, öneri, şikayet, başvuruları ileten gerçek kişi Kullanıcılar’ı ifade eder. Bu madde anlamında başvurular Kişisel Verilere yönelik hakların kullanılması amacıyla yapılabileceği gibi, Web Sitesi üzerindeki formlar doldurularak Logo Siber ile iletişime geçilmesi, bunlar üzerinden Hizmet talep edilmesi suretiyle de gerçekleşebilir.\nKişisel Veri\n \nAçıklama\nVeri Sahibi\nKimlik Bilgisi\n:\nNüfus cüzdanı, ehliyet, pasaport gibi belgeler üzerinde yer alan ad-soyad gibi bilgilerdir.\nBaşvuran\nİletişim Bilgisi\n:\nVeri sahibi ile iletişim kurulmasını sağlayacak telefon numarası, adres, e-posta adresi gibi bilgilerdir.\nBaşvuran\nTemsilci Bilgisi\n:\nVeri sahibinin varsa veli, vasi, vekil, avukat gibi her türlü yasal temsilcilerine ilişkin bilgilerdir.\nBaşvuran\nDijital Veriler\n:\nVeri sahibinin Web Sitesi üzerinden veya aracılığıyla iletilmiş, göndermiş, yüklemiş, kaydetmiş ve/veya girmiş ve/veya çerezler aracılığıyla toplanan;  IP bilgileri, ziyaret edilen bölüm, domain tipi, tarayıcı tipi, kullanım tarih ve saati gibi verileridir.\nKullanıcılar\nBaşvuru Bilgisi\n:\nVeri sahibinin Logo Siber’e ilettiği herhangi bir soru, talep, öneri, şikayet veya başvurusu sebebiyle verdiği bilgiler, bunlara ilişkin değerlendirmeler ve Logo Siber nezdinde tutulan kayıtlardır.\nBaşvuran\n     4. GİZLİLİK KOŞULLARININ İHLALİ\n4.1 Logo Siber, Gizlilik Koşulları’na uyulmaması ya da kuralları ihlal etme girişiminde bulunulması durumunda, ihlal tam olarak gerçekleşsin ya da gerçekleşmesin, önceden haber vermeksizin Kullanıcıların Web Sitesi’ne erişimini askıya alma, sonlandırma veya varsa üyeliği iptal etme hakkını saklı tutar. Bu kural, Gizlilik Koşulları’nın Kullanıcılar tarafından dolaylı ihlali ya da ihlal girişimi olması durumu için de geçerlidir.\n4.2 Logo Siber’in burada yazılı herhangi bir hukuki hakkı ya da tedbiri kullanmaması ya da uygulamaması, Logo Siber’in Gizlilik Koşulları ya da yasadan doğan haklarından vazgeçtiği ya da ihlali kabul ettiği anlamına gelmez.\n     5. GİZLİLİK KOŞULLARININ TAKİBİ/DEĞİŞİKLİK\nLogo Siber, herhangi bir zamanda önceden haber vermeksizin Gizlilik Koşulları’nda değişiklik yapma ya da ek koşullar getirme hakkına sahiptir. Kullanım sırasında toplanan bilgilerin niteliklerinden, nasıl kullanıldığından, bu bilgilerin üçüncü şahıslar ile hangi durumlarda paylaşıldığından ve gerekli tüm gizlilik koşullarından haberdar olunması için yapılan değişiklikler Web Sitesi’nde sunulacak ve yayınladıkları tarihte yürürlüğe girecektir.  Gizlilik Koşulları’nın düzenli olarak takibi ve okunması Kullanıcıların sorumluluğundadır. Web Sitesi’ni yapılabilecek bu tarz bir değişiklikten sonraki kullanım, Gizlilik Koşulları’ndaki değişiklilerin kabul edildiği anlamına gelir.\n     6. AÇIK SİSTEM\nKullanıcılar; internet ortamının güvenilir bir ortam olmadığını, internet ortamında iletişimin riskli olduğunu, kişisel veriler, şifreler vb. de dâhil her türlü bilginin üçüncü şahısların hukuka aykırı fiillerinin muhatabı olabileceğini bilmekte ve kabul etmektedir. Logo Siber, Web Sitesi’nin güvenli olduğu yönünde ve/veya kötü niyetli hareketlerle ilgili olarak hiçbir garanti vermemektedir.\n     7. WEB SİTESİ YARDIMCI PROGRAMLARI\nWeb Sitesi’nden daha kolay yararlanabilmeniz için bazı “çerez”lerden yararlanılabilir, bunlar vasıtasıyla Kullanıcılar’a bazı bilgiler gönderilebilir veya bazı Kullanıcı bilgileri toplanabilir. Çerezlerle ilgili veri toplanmasının istenmediği durumlarda, kullanıcıların veri toplanmasını engelleme hakkı mevcuttur.\n     8. BİLGİ VE İLETİŞİM\nGizlilik Koşullarına ilişkin sorularınız için bize 0850 577 23 77 nolu telefondan ulaşabilirsiniz.\n\n\n\n\n\n\n\n\n\n\nÜrünle ilgili önemlli gelişme ve haberleri almak istiyorum.\n\n\n\n\n\n\n\n\nGÖNDER\n\n\n\n\n\nTeknolojik gelişmeler kripto para birimlerinin bir katma değer olarak karşımıza çıkmasını sağlamaktadır. Dünya kripto para borsalarında ilk kez Bitcoin kabul görmüştür. Bunun ardından günümüzde halen yeni kripto para birimleri ortaya çıkmaya devam etmektedir. Kişilerin küçük bir meblağ ile de olsa içinde olmak istedikleri ve alternatif yatırım araçlarından biri olarak gördükleri dijital para borsaları her geçen gün yeni yatırımcılara ev sahipliği yapmaktadır. Kripto para alış veya satış işlemleri, kripto para birimleri veya gerçek para birimleri aracılığıyla kripto borsalarında gerçekleştirilir. Yatırımcıların işlemlerini geleneksel borsa sisteminden farklı olarak, kendi banka ve kripto para borsası hesaplarından yaptığı bu süreç sadece internet siteleri üzerinden yürütülmektedir. Bu sebeple dijital ortamda alınması gereken siber güvenlik önlemlerinin Bitcoin ve kripto paralar için de uygulanması gerekir. Kripto varlıkların kullanıcılar tarafından aracısız şekilde yönetilebilir olması, kripto paraların kişinin farkındalığı kadar siber güvenlik tehditlerinden korunacağını göstermektedir.\nKripto varlıkların güvenli biçimde saklanması, farklı ihtiyaçlara göre şekillenen güvenlik yaklaşımlarıyla mümkün olur. Kripto paralarınızı güvence altına almanın yollarından bazıları şöyledir:\n\n1- İnternet Bağlantınızın Güvenli Olduğundan Emin Olun\nKripto para işlemlerinizi yaparken güvenli bir internet bağlantısı kullanmanız önemlidir. Özellikle halka açık Wi-Fi ağlarını kullanmaktan kaçının. Wi-Fi ağlarına herkesin erişim sağlaması özellikle siber saldırganların da bu ağlarda olabileceği ihtimalini doğurur. Ayrıca, ağa bağlı cihazlardan biri virüs kapmışsa bu cihaz sayesinde diğer bilgisayarlara da virüs bulaşması olasıdır. Ev ve iş yeri ağlara cihazların güvenle bağlanabilmesi için güvenli modlardan birini kullanmanız iyi bir seçenek olabilir. WPA2 Kişisel (AES), bu noktada kullanabileceğiniz bir moddur. Kurulumda şifreleme veya şifre türü olarak da AES'yi seçebilirsiniz. Böylece, siber saldırılara karşı daha güvende olursunuz.\nEv ve iş yerindeki internet bağlantısında modemde Firewall’un etkin olması, bu ağlar üzerinden gelen istenmeyen trafikleri engelleyerek, ağa bağlı cihazların korunmasını sağlar. Güvenli olduğunu bildiğiniz ev veya iş yeri ağınıza erişirken de VPN kullanmanız konumunuzu ve IP adresinizi değiştirerek taramalarınızı güvenli tutmanıza yardımcı olur.\n2- Kripto para cüzdanı ile daha güvende olun!\nKripto para cüzdanları veya coin cüzdanları, ayrıca halk deyimi ile soğuk cüzdanlar, paranın dijital varlığını ispatlayan verileri depolarıdır. Farklı bir hesaba para transferi vb. işlemlerin yapıldığı sırada blockchain ağı etkileşime girer. Bu etkileşim sırasında özel anahtar ve açık anahtar bilgileri kullanılır. Kısacası, özel ve açık anahtarlar, blockchain ağı üzerindeki işlemlerde hesabın varlığını ispat eder. Kripto para cüzdanında özel anahtar en kritik şifre olarak görülebilir. Bu sebeple özel anahtarın saklanması, korunması ve erişiminin engellenmesi önemlidir.\nKripto varlıklarda karşılaşılabilecek sorunlardan biri cüzdanın çalınması ya da kaybolmasıdır. Kripto para cüzdanları paranın kendisini değil adresleri (anahtarları) ve bu adreslerin sahibini ispatlayan özel anahtarı barındırır. Kripto para transferinde gönderici ve alıcının adresleri (anahtarları), işlem ücreti, gönderim zamanı ve gönderim tutarının yer aldığı işlem, göndericinin özel anahtarı ile onaylanarak transferin gerçekleşmesini sağlar. Blockchain ise bu işlemlerin kaydını tutar.\nKripto para cüzdanlarının kullanıcı bilgisayarlarında saklanması hard diskin bozulmasıyla ya da kötü amaçlı yazılımlar aracılığıyla oluşacak siber saldırılar için risk oluşturur. Kripto para cüzdanı, özel anahtarları barındıran cüzdan dosyalarına erişim için gerekli kelime grubunu oluşturarak özel anahtarın yapılmasını sağlar. Bu anahtar kelime grubuna tohum (seed) adı verilir. Tohumun sadece sizde olduğundan ve kripto para göndermeden önce de tohumlarınızı yedeklediğinizden emin olun.\nKripto para cüzdanlarının şifresini unutan ve parasına ulaşamayan Alman yazılımcı Stefan Thomas, karşılığı yaklaşık 220 milyon dolar olan hesabını kaybetme korkusunu yaşayarak bu konuya çarpıcı bir örnek olmuştur (https://www.trthaber.com/haber/dunya/bitcoin-sifresini-unuttu-220-milyon-dolarina-ulasamiyor-546996.html).\nKripto para cüzdanları yazılım, donanım ve kâğıt olmak üzere farklı şekillerde bulunur. Yazılım cüzdanları, kullanıcının akıllı cihazlarına veya bilgisayarlarına kurulan uygulama ile kripto para işleminin yapılmasını sağlar. Ancak kullanımı kolay ve ücretsiz olsa da internete bağlı olması sebebiyle bu cüzdan türü siber güvenlik tehditlerine karşı zayıftır. Kâğıt cüzdan ise çevrim içi siber saldırılara karşı dirençlidir. Kripto adresi ve kâğıt cüzdan sitelerinde üretilmiş QR kod ile oluşturulan özel anahtar bir kâğıtta yer alır.\nKripto para saklamada en iyi çözümlerden biri donanım (offline) cüzdanlarıdır. Donanım cüzdanları, soğuk depolama veya soğuk cüzdan adını da alırlar. Donanım cüzdanları içinde bulunan güvenli çip, özel anahtarı barındırır. Böylece, kullanıcı hem anahtarını hem de kripto para işlemini yaptıktan sonra kripto varlıklarını offline halde güvenle saklar.\n3- Kişisel Verilerinizin Oltalama Saldırıları ile Hacklenmesini Önleyin\nKripto para işlemlerinde kimlik avı hırsızlık olayları oldukça fazla görülmektedir. Siber saldırıyı düzenleyenler, sanal cüzdan hizmeti sağlayan veya kripto para alım satım işlemlerinin yapıldığı platformların asıl sitesiymiş gibi oluşturdukları sahte internet siteleri ile oltalama saldırıyı gerçekleştirirler. Sahte internet siteleri asıl siteler ile benzerdirler. Arama motorlarını kullanan ve adres çubuğunda yazan adrese dikkatle bakmayan kullanıcılar sahte internet sitelerinde hesaplarına girmek için kişisel verilerini paylaşırlar. Bu paylaşım ile siber saldırıyı düzenleyenler öncelikle kişisel verileri çalarlar. Ardından gerçek internet sitesinde kullanıcıların hesaplarına giriş yaparak kripto para varlıklarının transferlerini gerçekleştirirler.\nAyrıca siber saldırıyı düzenleyenler, kripto para ile ilgili kurumları taklit ederek oluşturdukları sahte e-mailler ile kişisel verilerin ve kripto para varlıklarının elde edilmesine çalışırlar. Sahte e-postalar, genelde kullanıcıları şifre değiştirmeye veya bilgi güncellemeye davet eden linklerden oluşan iletileri içerir. Kullanıcı e-mailin gönderildiği e-mail adresine dikkat etmediyse oltalama saldırısını fark edemez. İlgili linke tıklayarak giriş işlemleri için kişisel verilerini ve şifrelerini paylaşır. Bu da siber saldırıyı düzenleyenlerin bu verileri elde etmesine sebep olur.\nBu noktada kullanıcının, giriş yaptığı sitelerin adres satırlarını dikkatle okuması,arama motorlarında siteyi aratmak yerine adres satırına elle yazması, kendisine gönderilen e-mail adresini ve güvenilir olup olmadığını kontrol etmesi gerekir. Kullanıcı e-mail güvenliği için gerekli önlemleri almalıdır. Bu önlemler siber saldırılar için alınan tedbirler arasında yer almaktadır.\n 4- Güvenli Giriş Yapmak için İki Faktörlü Doğrulamayı (2FA) Kullanın\nWeb sitelerinin arka kapısına erişim sağlayarak şifrelerini kıran ve önemli verileri ele geçiren Brute force (kaba kuvvet saldırıları) önemli şifre hackleme yöntemlerinden biridir. Bu saldırıları engellemek için güçlü ve karmaşık şifreler oluşturun. Şifreyi düzenli olarak değiştirin. Eğer kripto para cüzdanlarınız birden fazla ise her biri için ayrı parola kullanın. Şifre dışında ikinci bir güvenlik katmanı iki faktörlü doğrulama ile mümkündür. Hesabınıza ek bir güvenlik katmanının eklenmesini sağlayan 2FA, kullanıcılara telefonda iki adımlı doğrulama sağlamasıyla güvenlik ihlali ve/veya hack riskini azaltır.\nKullanıcıya önerilen her zaman iki faktörlü doğrulama (2FA) kullanmasıdır. Ayrıca, 2FA’yı desteklemeyen platformları kullanmamanız siber güvenlik tehditlerini azaltacaktır.\nBunların dışında, sosyal mühendislik saldırılarında uygulanan ve kullanıcıları korku duygusuyla panikleterek, 2FA kodunu almak isteyen siber suçlulara karşı da dikkatli olunması gerekir.\n5- Kaynağına Güvenmediğiniz Yazılımlardan Uzak Durun\nBilgisayarınıza ve diğer akıllı cihazlarınıza kaynağını bilmediğiniz ve güvenmediğiniz yazılımları kurmayın. Kaynağı bilinmeyen yazılımlar kötü amaçlı olabilir ve siber saldırıya uğramanızı kolaylaştırır. Kaynağını bilmediğiniz programları bilgisayarınıza yüklerken bu programla birlikte örneğin casus yazılımı ya da izleme yazılımı olarak adlandırılan keylogger yazılımı da yüklenebilir. Böylece, siber saldırıyı düzenleyenler klavyede ne yazdığınızı görebilir. Hesap ve kredi kart bilgilerinizin öğrenilebileceği bu saldırı türünden korunmak için öncelikle lisanslı uygulamaları tercih edin. Ayrıca antivirüs koruma programlarıyla bu tür yazılımların önceden tespit edilmesini sağlayabilirsiniz.\nAyrıca, masaüstü işletim sisteminizin ve mobil cihazlarınızın güncellemelerini zamanında yapın. Üreticinin işletim sisteminden başka bir işletim sistemi kullanmayın.\n6- Farklı Borsalar Kullanın\nKripto para transferlerinizi herhangi bir dijital para borsası üzerinden yapacaksanız, küçük işlemler yapmayı tercih edin. Farklı borsalar kullanarak, alacağınız riski bölmüş olursunuz. Eğer çok büyük miktarda para transferi gerçekleştirecekseniz, küçük işlemlere bölerek de riskin azalmasını sağlayabilirsiniz.\n Farklı Kripto Para Hırsızlığı Vaka Örnekleri\n\nKripto para borsa seçiminde dikkatli olunması gerektiğini anlatan bir örnek 2018 yılından geliyor. Kripto para borsalarının hacklendiği örnekte saatte 25 milyon dolarlık Bitcoin çalınmıştır. Ancak tarihteki kripto para borsalarının hack olaylarına bakıldığında tekrar eden süreçler söz konusudur. Bu noktada gerekli güvenlik önlemlerinin ilgili borsalar tarafından alınmadığı söylenebilir. Ancak kendi kripto varlıklarını kendilerinin koruması gereken kullanıcılar, güvenilir ve bilindik kripto borsa seçimiyle paralarını güvende tutabilirler. \nOltalama saldırısına örnek COINTELEGRAPH’dan geliyor. 2020 yılında Corona virüsün artmasıyla sahtekârlık ve panik duygusunun kullanıldığı oltalama saldırısında Dünya Sağlık Örgütü, Kızıl Haç ve Hastalık Kontrol Merkezi gibi kurumlar taklit edilerek dolandırıcılık gerçekleştirilmiştir.\nSitede yer alan bilgiye göre 2020 yılında çalınan 1,36 milyar dolarlık kripto paranın %98’i sahtekarlık ve suistimalden kaynaklanmıştır \nKripto para cüzdanı seçiminin öneminin görüldüğü örnekte soğuk cüzdanın avantajı bir kez daha vurgulanıyor. BBC’nin haberine göre, Coincheck sistemlerinin hacklenmesi ile siber saldırıyı gerçekleştirenler kendi hesaplarına 534 milyon dolar değerindeki kripto parayı aktarmışlardır. Çalınan Coincheck varlıklarının, çevrimdışı olarak güvenli bir şekilde saklandığı “soğuk cüzdan”da değil, çevrimiçi borsanın bir parçası olan “sıcak cüzdan”da tutulduğu belirtilmiştir. Sıcak cüzdanda varlıklar yalnızca çevrimiçi olarak kaydedilip transfer edilirken, soğuk cüzdanda çevrimdışı bir sunucuda yedeklenerek tutulduğu kaydedilmiştir \nKişisel verilerin çalınmasıyla ilgili örnek, 2020 yılında 6 milyondan fazla takipçisi olan YouTuber Ajey Nagar’ın Carrylive YouTube kanalının Bitcoin dolandırıcılığında kullanılmasında görülmüştür. Siber saldırıyı düzenleyenler YouTube kanalı aracılığıyla, izleyicilere gönderilen Bitcoin’lerin iki katını geri yollayacaklarını söylemişlerdir. Sorunun tespit edilmesi ve YouTube ve Ajey’in müdahalesi ile YouTube kanalı geri alındığında siber saldırı son bulmuş ve durumu Ajey Nagar, Twitter hesabından bildirilmiştir.\n\nAjey Nagar / Twitter\n\n19 Ağustos 2021\n\n\n\n\n\n\n\nÖNCEKİ YAZI\n\n\n\n\n\n\nSONRAKİ YAZI\n\n\n\n\n\n\n"
}