{
  "baslik": "Hackers Target Bank Networks with new Rootkit to Steal Money from ATM Machines",
  "url": "https://thehackernews.com/2022/03/hackers-target-bank-networks-with-new.html",
  "metin": "\nA financially motivated threat actor has been observed deploying a previously unknown rootkit targeting Oracle Solaris systems with the goal of compromising Automatic Teller Machine (ATM) switching networks and carrying out unauthorized cash withdrawals at different banks using fraudulent cards.\nThreat intelligence and incident response firm Mandiant is tracking the cluster under the moniker UNC2891, with some of the group's tactics, techniques, and procedures sharing overlaps with that of another cluster dubbed UNC1945.\nThe intrusions staged by the actor involve \"a high degree of OPSEC and leverage both public and private malware, utilities, and scripts to remove evidence and hinder response efforts,\" Mandiant researchers said in a new report published this week.\n\nEven more concerningly, the attacks spanned several years in some cases, during the entirety of which the actor remained undetected by leveraging a rootkit called CAKETAP, which is designed to conceal network connections, processes, and files.\nMandiant, which was able to recover memory forensic data from one of the victimized ATM switch servers, noted that one variant of the kernel rootkit came with specialized features that enabled it to intercept card and PIN verification messages and use the stolen data to perform fraudulent cash withdrawals from ATM terminals.\n\nAlso put to use are two backdoors known as SLAPSTICK and TINYSHELL, both attributed to UNC1945 and are used to gain persistent remote access to mission-critical systems as well as shell execution and file transfers via rlogin, telnet, or SSH.\n\"In line with the group's familiarity with Unix and Linux based systems, UNC2891 often named and configured their TINYSHELL backdoors with values that masqueraded as legitimate services that might be overlooked by investigators, such as systemd (SYSTEMD), name service cache daemon (NCSD), and the Linux at daemon (ATD),\" the researchers pointed out.\n\nAdditionally, the attack chains have employed a variety of malware and publicly-available utilities, including –\n\nSTEELHOUND – A variant of the STEELCORGI in-memory dropper that's used to decrypt an embedded payload and encrypt new binaries\nWINGHOOK – A keylogger for Linux and Unix based operating systems that captures the data in an encoded format\nWINGCRACK – A utility that's used to parse the encoded content generated by WINGHOOK\nWIPERIGHT – An ELF utility that erases log entries pertaining to a specific user on Linux and Unix based systems\nMIGLOGCLEANER – An ELF utility that wipes logs or remove certain strings from logs on Linux and Unix based systems\n\n\"[UNC2891] uses their skill and experience to take full advantage of the decreased visibility and security measures that are often present in Unix and Linux environments,\" the researchers said. \"While some of the overlaps between UNC2891 and UNC1945 are notable, it is not conclusive enough to attribute the intrusions to a single threat group.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "TrickBot Malware Abusing MikroTik Routers as Proxies for Command-and-Control",
  "url": "https://thehackernews.com/2022/03/trickbot-malware-abusing-hacked-iot.html",
  "metin": "\nMicrosoft on Wednesday detailed a previously undiscovered technique put to use by the TrickBot malware that involves using compromised Internet of Things (IoT) devices as a go-between for establishing communications with the command-and-control (C2) servers.\n\"By using MikroTik routers as proxy servers for its C2 servers and redirecting the traffic through non-standard ports, TrickBot adds another persistence layer that helps malicious IPs evade detection by standard security systems,\" Microsoft's Defender for IoT Research Team and Threat Intelligence Center (MSTIC) said.\n\nTrickBot, which emerged as a banking trojan in 2016, has evolved into a sophisticated and persistent threat, with its modular architecture enabling it to adapt its tactics to suit different networks, environments, and devices as well as offer access-as-a-service for next-stage payloads like Conti ransomware.\nThe expansion to TrickBot's capabilities comes amid reports of its infrastructure going offline, even as the botnet has continually refined its features to make its attack framework durable, evade reverse engineering, and maintain the stability of its C2 servers.\n\nSpecifically, the new method identified by MSTIC involves leveraging hacked IoT devices such as routers from MikroTik to \"create a line of communication between the TrickBot-affected device and the C2 server.\"\n\nThis also entails breaking into the routers by using a combination of methods, namely default passwords, brute-force attacks, or exploiting a now-patched flaw in MikroTik RouterOS (CVE-2018-14847), followed by changing the router's password to maintain access.\nIn the next step, the attackers then issue a network address translation (NAT) command that's designed to redirect traffic between ports 449 and 80 in the router, establishing a path for the TrickBot-infected hosts to communicate with the C2 server.\nWhile potential connections between TrickBot and compromised MikroTik hosts were hinted before in November 2018, this is the first time the exact modus operandi has been laid bare open. With the malware reaching its limits last month and no new C2 servers registered since December 2021, it remains to be seen how the operators intend to take the operation forward.\n\"As security solutions for conventional computing devices continue to evolve and improve, attackers will explore alternative ways to compromise target networks,\" the researchers said. \"Attack attempts against routers and other IoT devices are not new, and being unmanaged, they can easily be the weakest links in the network.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "German Government Warns Against Using Russia's Kaspersky Antivirus Software",
  "url": "https://thehackernews.com/2022/03/german-government-warns-against-using.html",
  "metin": "\nRussian cybersecurity firm Kaspersky on Tuesday responded to an advisory released by Germany's Federal Office of Information Security (BSI) against using the company's security solutions in the country over \"doubts about the reliability of the manufacturer.\"\nCalling that the decision was made on \"political grounds,\" the company said it will \"continue to assure our partners and customers of the quality and integrity of our products, and we will be working with the BSI for clarification on its decision and for the means to address its and other regulators' concerns.\"\n\nThe statement from Kaspersky follows a warning from Germany's cybersecurity authority, the Bundesamt für Sicherheit in der Informationstechnik aka BSI, which recommended \"replacing applications from Kaspersky's portfolio of antivirus software with alternative products\" due to risks that they could be exploited by Russia for a cyber attack.\n\"Companies and authorities with special security interests and operators of critical infrastructures are particularly at risk,\" the BSI said, adding the company's tools could be used for attacks against its own customers or be compelled to strike systems against its will amidst Russia's military invasion of Ukraine.\nAlthough not an outright ban, the announcement adds to similar restrictions put in place by the U.S., U.K., and Dutch governments in 2017 and 2018 to phase out the use of antivirus software made by Kaspersky Labs.\n\nThe Moscow-based company, however, noted that it had shifted its cyberthreat-related data processing infrastructure to the Swiss city of Zurich in 2018 and that its data services and engineering practices have been subjected to independent third-party assessments.\nEarlier this month, Eugene Kaspersky, CEO of the namesake company, struck a neutral tone, hoping that negotiations between Ukraine and Russia would lead to \"a compromise,\" in an attempt to distance the organization from being branded as siding with Russia.\n\"We believe that peaceful dialogue is the only possible instrument for resolving conflicts,\" Kaspersky tweeted on March 1. \"War isn't good for anyone.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "'Dirty Pipe' Linux Flaw Affects a Wide Range of QNAP NAS Devices",
  "url": "https://thehackernews.com/2022/03/dirty-pipe-linux-flaw-affects-wide.html",
  "metin": "\nNetwork-attached storage (NAS) appliance maker QNAP on Monday warned of a recently disclosed Linux vulnerability affecting its devices that could be abused to elevate privileges and gain control of affected systems.\n\"A local privilege escalation vulnerability, also known as 'Dirty Pipe,' has been reported to affect the Linux kernel on QNAP NAS running QTS 5.0.x and QuTS hero h5.0.x,\" the company said. \"If exploited, this vulnerability allows an unprivileged user to gain administrator privileges and inject malicious code.\"\n\nThe Taiwanese firm said it's continuing to thoroughly investigate its product line for the vulnerability and that QNAP NAS devices running QTS versions 4.x are immune to the Dirty Pipe flaw.\n\nTracked as CVE-2022-0847 (CVSS score: 7.8), the shortcoming resides in the Linux kernel that could permit an attacker to overwrite arbitrary data into any read-only files and allow for a complete takeover of vulnerable machines.\n\"An unprivileged local user could use the Dirty Pipe flaw to write to pages in the page cache backed by read-only files and as such, escalate their privileges on the system,\" Kaspersky researchers said earlier this week. \"This vulnerability happens due to usage of partially uninitialized memory of the pipe buffer structure during its construction.\"\nSuccessful exploitation of the high-severity flaw could enable an attacker to create unauthorized cron jobs, modify sensitive files such as /etc/passwd, and even break out of containers. The issue has since been fixed in Linux versions 5.16.11, 5.15.25, and 5.10.102 as of February 23, 2022, three days after it was reported to the Linux kernel security team.\n\"Currently there is no mitigation available for this vulnerability,\" the company added. \"We recommend users to check back and install security updates as soon as they become available.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Russian Pushing New State-run TLS Certificate Authority to Deal With Sanctions",
  "url": "https://thehackernews.com/2022/03/russian-pushing-its-new-state-run-tls.html",
  "metin": "\nThe Russian government has established its own TLS certificate authority (CA) to address issues with accessing websites that have arisen in the wake of sanctions imposed by the west following the country's unprovoked military invasion of Ukraine.\nAccording to a message posted on the Gosuslugi public services portal, the Ministry of Digital Development is expected to provide a domestic replacement to handle the issuance and renewal of TLS certificates should they get revoked or expired.\nThe service is offered to all legal entities operating in Russia, with the certificates delivered to site owners upon request within 5 working days.\nTLS certificates are used to digitally bind a cryptographic key to an organization's details, enabling web browsers to confirm the domain's authenticity and ensure that the communication between a client computer and the target website is secure.\n\nThe proposal comes as companies like DigiCert have been restricted from doing business in Russia following sanctions by Western nations. Cybersecurity firms Avast, ESET, Fortinet, and Imperva have also suspended operations in Russia and Belarus over the Kremlin's invasion of Ukraine.\n\"In response to the evolving geopolitical situation in Ukraine, DigiCert is pausing issuance and reissuance of all certificate types affiliated with Russia and Belarus. This includes suspending issuance and reissuance of certificates to TLDs related to Russia and Belarus, as well as to organizations with addresses in Russia or Belarus,\" the public key infrastructure (PKI) provider noted in an advisory.\nThe list of Belarusian and Russian top-level domains (TLDs) for which certificate issuance and reissuance have been suspended consists of .by, .moscow, .ru, .ru.com, .ru.net, .su, .tatar, .бел, .москва, .рус, and .рф.\nWhat's not clear is whether web browsers such as Google Chrome, Microsoft Edge, Mozilla Firefox, and Apple Safari, intend to accept the certificates issued by the new Russian certificate authority so that safe connections to the certified servers can work as intended.\nBut according to a tweet shared by Juan Andres Guerrero-Saade, principal threat researcher at SentinelOne, the public services agency is recommending the use of Russian browsers like Yandex and Atom. \"To have access to all sites and the necessary online services, including public services, we recommend installing browsers that support the Russian certificate,\" the email reads.\n\nThis also poses significant risks in that it could be potentially weaponized to carry out man-in-the-middle (MitM) on HTTPS sessions originating from internet users in the nation, enabling the relevant authorities to intercept, decrypt, and re-encrypt the traffic passing through its systems.\n\"This is insane. Is this the full totalitarian Man-in-the-Middle?,\" Guerrero-Saade tweeted.\nThe development also comes close on the heels of disclosures from Cisco Talos that opportunistic cybercriminals are cashing in on the ongoing conflict to target unwitting users seeking tools to carry out their own cyberattacks against Russian entities by offering malware purporting to be offensive cyber tools.\n\"The global interest in the conflict creates a massive potential victim pool for threat actors and also contributes to a growing number of people interested in carrying out their own offensive cyber operations,\" the researchers said.\n\"These observations serve as reminders that users must be on heightened alert to increased cyber threat activity as threat actors look for new ways to incorporate the Russia-Ukraine conflict into their operations.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Critical Bugs Could Let Attackers Remotely Hack, Damage APC Smart-UPS Devices",
  "url": "https://thehackernews.com/2022/03/critical-bugs-could-let-attackers.html",
  "metin": "\nThree high-impact security vulnerabilities have been disclosed in APC Smart-UPS devices that could be abused by remote adversaries as a physical weapon to access and control them in an unauthorized manner.\nCollectively dubbed TLStorm, the flaws \"allow for complete remote takeover of Smart-UPS devices and the ability to carry out extreme cyber-physical attacks,\" Ben Seri and Barak Hadad, researchers from IoT security company Armis, said in a report published Tuesday.\n\nUninterruptible power supply (UPS) devices function as emergency backup power providers in mission-critical environments such as medical facilities, server rooms, and industrial systems. Most of the afflicted devices, totaling over 20 million, have been identified so far in healthcare, retail, industrial, and government sectors.\n\nTLStorm consists of a trio of critical flaws that can be triggered via unauthenticated network packets without requiring any user interaction, meaning it's a zero-click attack, with two of the issues involving a case of faulty TLS handshake between the UPS and the APC cloud –\n\nCVE-2022-22805 (CVSS score: 9.0) – TLS buffer overflow\nCVE-2022-22806 (CVSS score: 9.0) – TLS authentication bypass\nCVE-2022-0715 (CVSS score: 8.9) – Unsigned firmware upgrade that can be updated over the network\n\nSuccessful exploitation of any of the flaws could result in remote code execution (RCE) attacks on vulnerable devices, which in turn could be weaponized to tamper with the operations of the UPS to physically damage the device or other assets connected to it.\n\n\"By using our RCE vulnerability we were able to bypass the software protection and let the current spike periods run over and over until the DC link capacitor heated up to ~150 degrees celsius (~300F), which caused the capacitor to burst and brick the UPS in a cloud of electrolyte gas, causing collateral damage to the device,\" the researchers explained.\nTo make matters worse, the flaw in the firmware upgrade mechanism could be leveraged to plant a malicious update on UPS devices, enabling the attackers to establish persistence for extended periods of time and use the compromised host as a gateway for further attacks.\n\n\"Abusing flaws in firmware upgrade mechanisms is becoming a standard practice of APTs, as has been recently detailed in the analysis of the Cyclops Blink malware, and improper signing of firmwares of embedded devices is a recurring flaw in various embedded systems,\" the researchers said.\nFollowing responsible disclosure to Schneider Electric on October 31, 2021, fixes have been released as part of Patch Tuesday updates on March 8, 2022. Customers are recommended to install the updates provided to reduce the risk of successful exploitation of these vulnerabilities.\n\"UPS devices, like many other digital infrastructure appliances, are often installed and forgotten,\" the researchers concluded. \"Since these devices are connected to the same internal networks as the core business systems, exploitation attempts can have severe implications.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Google Buys Cybersecurity Firm Mandiant for $5.4 Billion",
  "url": "https://thehackernews.com/2022/03/google-buys-cybersecurity-firm-mandiant.html",
  "metin": "\nGoogle is officially buying threat intelligence and incident response company Mandiant in an all-cash deal approximately valued at $5.4 billion, the two technology firms announced Tuesday.\nMandiant is expected to be folded into Google Cloud upon the closure of the acquisition, which is slated to happen later this year, adding to the latter's growing portfolio of security offerings such as BeyondCorp Enterprise, VirusTotal, Chronicle, and the Cybersecurity Action Team.\n\n\"Today, organizations are facing cybersecurity challenges that have accelerated in frequency, severity and diversity, creating a global security imperative,\" Google said in a statement.\n\"To address these risks, enterprises need to be able to detect and respond to adversaries quickly; analyze and automate threat intelligence to scale threat detection across organizations; orchestrate and automate remediation; validate their protection against known threats; and visualize their IT environment in order to identify and simulate new threats.\"\nMandiant became a standalone entity again in June 2021 when FireEye, which acquired the company in 2013, sold its products business and the FireEye brand for $1.2 billion to a consortium led by private-equity firm Symphony Technology Group.\n\nSymphony, which also acquired McAfee Enterprise for $4 billion in March 2021, combined the two businesses to launch Trellix earlier this year.\nThe cybersecurity firm is best known for uncovering and investigating the supply chain compromise of SolarWinds, a devastating cyber attack that affected thousands of its downstream customers and went unnoticed for months until its discovery in December 2020.\n\"The acquisition will complement Google Cloud's existing strengths in security,\" Mandiant said, stating the deal will \"deliver an end-to-end security operations suite with even greater capabilities as well as advisory services helping customers address critical security challenges and stay protected at every stage of the security lifecycle.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Understanding How Hackers Recon",
  "url": "https://thehackernews.com/2022/03/understanding-how-hackers-recon.html",
  "metin": "\nCyber-attacks keep increasing and evolving but, regardless of the degree of complexity used by hackers to gain access, get a foothold, cloak their malware, execute their payload or exfiltrate data, their attack will begin with reconnaissance. They will do their utmost to uncover exposed assets and probe their target's attack surface for gaps that can be used as entry points.\nSo, the first line of defense is to limit the potentially useful information available to a potential attacker as much as possible. As always, the tug of war between operational necessity and security concerns needs to be taken into account, which requires a better understanding of the type of information typically leveraged.\nWhat information are hackers looking for during recon?\nWhen running recon on an organization, hackers – whether white or black hats - are \"casing a joint.\" To plan their attack, they will try and uncover as much information as possible about:\nYour infrastructure\n\nThe types of technologies you use – As there is no flawless technology, learning about those used to build and manage your infrastructure is hackers' first step. They aim to find vulnerabilities to penetrate your infrastructure and shield themselves from detection. Hackers can gain information about your technologies and how they are used through listening to conversations in tech forums. DevOps participating in such discussions should refrain from divulging their real identity or information that might identify the organization.\nYour internet-facing servers - servers hold your organization's vital information. Hackers will attempt to find vulnerabilities ranging from unused or unpatched services to open ports.\nAny system used as a server on a public network is a target, so system administrators must be extra vigilant in:\n\nKeeping all services current \nOpting for secure protocols whenever possible \nLimiting the type of network per machine to a strict minimum, preferably one per machine \nMonitoring all servers for suspicious activity\n\nYour Operating System (OS) – Each OS has its own vulnerabilities. Windows, Linux, Apple, and other OS regularly publish newly uncovered vulnerabilities and patches. This publicly available information is exploited by cyber-attackers once they know what OS you use.\nFor example, a forum conversation where Joe Blog, your accountant, explains how to use a function on a Windows 8 Excel Spreadsheet tells the hacker that Joe Blog uses Windows and has not updated his OS for ages. \nThis tidbit encourages the cyber-attacker to dig further as, if an employee with access to your organization's financial information is allowed to work on an endpoint that is rarely, if ever, updated, employees' endpoint security is lax.\nYour security maturity – Hackers are humans and, as such, tend to be lazy. A hacker on a recon mission who finds out that you are using an XSPM (Extended Security Posture Management) platform knows that, even if there is an exploitable entry point, escalation will be hampered at every step, and achieving the malicious action will require a superior level of planning. This discourages most potential cyber-attackers.\n\nCredentials\n\nEmail addresses – as the human mind is the hardest software to upgrade and patch, phishing remains the number one penetration vector for hackers. Though some email addresses, such as info, support, sales, etc., must be public, employees' personal email can be leveraged by hackers for generic phishing messages and spear phishing.\nUsernames & passwords – Darknet hackers' shopping malls are full of credentials for sale at ridiculously low prices, hence the recommendation to change your password regularly.\nFor system admin and other users with high privilege access, maintaining stellar password hygiene – and MFA! - is an absolute must as, should their credentials fall into the hands of a hacker, the entire system could be irremediably compromised.\n\nCan you spot a hacker recon?\nForewarned is fore-armed, so it might be a clever idea to listen for signs of hostile recon activity. Recon activity can be classified into two categories:\n\nActive recon: hackers using tools or spyware to peak into your system. This should trigger alerts from properly configured detection tools, informing security information teams that hackers are \"casing\" them. \nThis should prompt launching a security validation exercise to ensure that potential security gaps are adequately monitored and scheduled for priority patching.\nPassive recon: hackers \"stalking\" you by collecting publicly available information about your infrastructure's technological details or email addresses. This is, in effect, undetectable.\n\nWhat Does a Hacker do with the information Gathered During Recon? \nCyber-attackers' goals fall under four broad categories:\n\nTheft – by far the largest category in terms of numbers, attacks aimed at stealing can be subdivided into more categories matching what the theft aim is:\n\nData – data is 21st century's currency, and any data in the right hand can be translated into value. From Credit Card details to users' personal information to generic data such as traveling habits, all data can be misappropriated for commercial, strategic, or even military purposes.\nIntellectual Property – IP gives an edge to many organizations and businesses. Competitors, for example, have an immediate interest in obtaining that information.\nComputing resources – the resources used to power your infrastructure are costly, therefore attractive. Today, stolen resources' main usage is crypto mining.\n\nExtortion – best known as ransomware, ransomware hijacks parts or all the infrastructure, encrypts the data, and requires payment in crypto-currency to decrypt the affected data. Exfiltrating data and threatening to sell them is also part of ransomware threats. \nInformation gathering – a stealthy type of attack that might remain undetected for extended periods. Typically, those are commandeered by nation-states, political opponents, or business competitors.\nDestruction / taking over the infrastructure – attacks aimed at overtaking or destroying are typically led by nation-states targeting critical infrastructure, particularly aggressive competitors, or hacktivists.\n\nGiven the range of damages that can result from a cyber-attack, making recon as fruitless or daunting as possible for scouting cyber-attackers is a good policy. This explains the current trend toward better Attack Surface Management (ASM).Note: This article is written by Sasha Gohman, VP Research at Cymulate.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Both Sides in Russia-Ukraine War Heavily Using Telegram for Disinformation and Hacktivism",
  "url": "https://thehackernews.com/2022/03/both-sides-in-russia-ukraine-war.html",
  "metin": "\nCyber criminals and hacktivist groups are increasingly using the Telegram messaging app to coordinate their activities, leak data, and spread disinformation, as the Russia-Ukraine conflict enters its eighth day.\nA new analysis by Israeli cybersecurity company Check Point Research has found that \"user volume grew a hundred folds daily on Telegram related groups, peaking at 200,000 per group.\"\nProminent among the groups are anti-Russian cyber attack groups, including the Ukraine government-backed IT Army, which has urged its more 270,000 members to conduct distributed denial-of-service (DDoS) attacks against Russian entities.\nOther hacktivist-oriented Telegram groups used to coordinate the attacks on Russian targets via DDoS, SMS or call-based attacks are Anna_ and Mark_, Check Point researchers noted.\n\nThat said, there may be more to these attacks than meets the eye. \"It seems that many of the hacktivist groups are more focused on building self-reputation and receiving credit for supporting Ukraine or Russia, than to cause real damage to the countries,\" the researchers said.\nFurthermore, cyber criminals are looking to capitalize on the conflict through Telegram groups containing tens of thousands of users that aim to \"raise funds for Ukraine\" and broadcast unverified news reports in an attempt to circumvent mainstream media.\nTelegram, for its part, said it may potentially consider partially or fully restricting certain channels so as to prevent malicious actors from abusing the platform to \"deepen conflicts.\"\nThe messaging app, which has over 500 million active users, has been used for black market activities in the past. In September 2021, more than 10,000 vendors were uncovered selling counterfeit COVID-19 vaccine certificates pertaining to over 25 countries for anywhere between $85 and $200, with some Telegram groups peaking at a follower size as large as 300,000.\n\nThe spike in the use of Telegram in Ukraine hasn't escaped the notice of Moxie Marlinspike, the founder of privacy-oriented messaging Signal, who called the former's \"decade of misleading marketing\" for making most people in the country believe \"it's an encrypted app.\"\n\"The reality is the opposite – Telegram is by default a cloud database with a plaintext copy of every message everyone has ever sent/received,\" Marlinspike tweeted last week. \"Every message, photo, video, document sent/received for the past 10 years; all contacts, group memberships, etc are all available to anyone with access to that database.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Report: Nearly 75% of Infusion Pumps Affected by Severe Vulnerabilities",
  "url": "https://thehackernews.com/2022/03/report-nearly-75-of-infusion-pumps.html",
  "metin": "\nAn analysis of data crowdsourced from more than 200,000 network-connected infusion pumps used in hospitals and healthcare entities has revealed that 75% of those medical devices contain security weaknesses that could put them at risk of potential exploitation.\n\"These shortcomings included exposure to one or more of some 40 known cybersecurity vulnerabilities and/or alerts that they had one or more of some 70 other types of known security shortcomings for IoT devices,\" Unit 42 security researcher Aveek Das said in a report published Wednesday.\n\nPalo Alto Networks' threat intelligence team said it obtained the scans from seven medical device manufacturers. On top of that, 52.11% of all infusion pumps scanned were susceptible to two known vulnerabilities that were disclosed in 2019 as part of 11 flaws collectively called \"URGENT/11\" –\n\nCVE-2019-12255 (CVSS score: 9.8) – A buffer overflow flaw in the TCP component of Wind River VxWorks\nCVE-2019-12264 (CVSS score: 7.1) – An issue with incorrect access control in the DHCP client component of Wind River VxWorks\n\nOther important flaws impacting infusion pumps are listed below –\n\nCVE-2016-9355 (CVSS score: 5.3) – An unauthorized user with physical access to an Alaris 8015 Point of Care units may be able to disassemble the device to access the removable flash memory, allowing read-and-write access to device memory\nCVE-2016-8375 (CVSS score: 4.9) – A credential management error in Alaris 8015 Point of Care units that could be exploited to gain unencrypted wireless network authentication credentials and other sensitive technical data\nCVE-2020-25165 (CVSS score: 7.5) – An improper session authentication vulnerability in Alaris 8015 Point of Care units that could be abused to perform a denial-of-service attack on the devices\nCVE-2020-12040 (CVSS score: 9.8) – Cleartext transmission of sensitive information in Sigma Spectrum Infusion System\nCVE-2020-12047 (CVSS score: 9.8) – Use of hard-coded FTP credentials in Baxter Spectrum WBM\nCVE-2020-12045 (CVSS score: 9.8) – Use of hard-coded Telnet credentials in Baxter Spectrum WBM\nCVE-2020-12043 (CVSS score: 9.8) – Baxter Spectrum WBM FTP service remains operational after its expected expiry time until it's rebooted\nCVE-2020-12041 (CVSS score: 9.8) – Baxter Spectrum Wireless Battery Module (WBM) permits data transmission and command-line interfaces over Telnet\n\nSuccessful exploitation of the aforementioned vulnerabilities could result in leakage of sensitive information pertaining to patients and allow an attacker to gain unauthorized access to the devices, necessitating that health systems are proactively protected against threats.\n\nLast year, McAfee disclosed security vulnerabilities affecting B. Braun's Infusomat Space Large Volume Pump and SpaceStation that could be abused by malicious parties to tamper with medication doses without any prior authentication.\nThe discovery \"highlights the need for the healthcare industry to redouble efforts to protect against known vulnerabilities, while diligently following best practices for infusion pumps and hospital networks,\" Das said.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "TeaBot Android Banking Malware Spreads Again Through Google Play Store Apps",
  "url": "https://thehackernews.com/2022/03/teabot-android-banking-malware-spreads.html",
  "metin": "\nAn Android banking trojan designed to steal credentials and SMS messages has been observed once again sneaking past Google Play Store protections to target users of more than 400 banking and financial apps, including those from Russia, China, and the U.S.\n\"TeaBot RAT capabilities are achieved via the device screen's live streaming (requested on-demand) plus the abuse of Accessibility Services for remote interaction and key-logging,\" Cleafy researchers said in a report. \"This enables Threat Actors (TAs) to perform ATO (Account Takeover) directly from the compromised phone, also known as 'On-device fraud.'\"\n\nAlso known by the names Anatsa and Toddler, TeaBot first emerged in May 2021, camouflaging its malicious functions by posing as seemingly innocuous PDF document and QR code scanner apps that are distributed via the official Google Play Store instead of third-party apps stores or via fraudulent websites.\nFurther research published by Swiss cyber threat intelligence company PRODAFT in July 2021 established that the banking malware had already \"infected more than 7,632 devices and stolen over 1023 banking credentials,\" with the compromised users belonging to 18 financial institutions.\n\nThese apps, also known as dropper applications, act as a conduit to deliver a second-stage payload that retrieves the malware strain to take control of the infected devices. In November 2021, Dutch security firm ThreatFabric disclosed that it had identified six Anatsa droppers on the Play Store since June last year.\nThen earlier this January, Bitdefender researchers identified TeaBot lurking in the official Android app marketplace as a \"QR Code Reader - Scanner App,\" gaining more than 100,000 downloads within a span of a month before it was taken down.\n\nThe latest version of TeaBot dropper spotted by Cleafy on February 21, 2022, is also a QR code reader app named \"QR Code & Barcode - Scanner\" which has been downloaded roughly 10,000 times from the Play Store.\nOnce installed, the modus operandi is the same: prompt users to accept a fake add-on update, which, in turn, leads to the installation of a second app hosted on GitHub that actually contains the TeaBot malware. It's, however, worth noting that users need to allow installs from unknown sources for this attack chain to be successful.\n\nThe last phase of the infection involves the banking trojan seeking Accessibility Services permissions to capture sensitive information like login credentials and two-factor authentication codes with the goal of taking over the accounts to carry out on-device fraud.\n\"In less than a year, the number of applications targeted by TeaBot have grown more than 500%, going from 60 targets to over 400,\" the researchers said, adding the malware now strikes several apps related to personal banking, insurance, crypto wallets, and crypto exchanges.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "CISA adds recently disclosed Zimbra bug to its Exploited Vulnerabilities Catalog",
  "url": "https://thehackernews.com/2022/02/cisa-adds-recently-disclosed-zimbra-bug.html",
  "metin": "\nThe U.S. Cybersecurity and Infrastructure Security Agency (CISA) expanded its Known Exploited Vulnerabilities Catalog to include a recently disclosed zero-day flaw in the Zimbra email platform citing evidence of active exploitation in the wild.\nTracked as CVE-2022-24682 (CVSS score: 6.1), the issue concerns a cross-site scripting (XSS) vulnerability in the Calendar feature in Zimbra Collaboration Suite that could be abused by an attacker to trick users into downloading arbitrary JavaScript code simply by clicking a link to exploit URLs in phishing messages.\n\nThe Known Exploited Vulnerabilities Catalog is a repository of security flaws that have been seen abused by threat actors in attacks and that are required to be patched by Federal Civilian Executive Branch (FCEB) agencies.\nThe vulnerability came to light on February 3, 2022, when cybersecurity firm Volexity identified a series of targeted spear-phishing campaigns aimed at European government and media entities that leveraged the aforementioned flaw to gain unauthorized access to victim's mailboxes and plant malware.\nVolexity is tracking the actor under the moniker \"TEMP_HERETIC,\" with the attacks impacting the open-source edition of Zimbra running version 8.8.15. Zimbra has since pushed out a hotfix (version 8.8.15 P30) to remediate the flaw.\n\nDue to the potential impact of this vulnerability, CISA has given federal agencies until March 11, 2022, to apply the security updates. In addition to CVE-2022-24682, CISA has also added the following three vulnerabilities to the catalog –\n\nCVE-2017-8570 (CVSS score: 7.8) – Microsoft Office Remote Code Execution Vulnerability\nCVE-2017-0222 (CVSS score: 7.5) – Microsoft Internet Explorer Memory Corruption Vulnerability\nCVE-2014-6352 (CVSS score: N/A) – Microsoft Windows Code Injection Vulnerability\n\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Russia-Ukraine War: Phishing, Malware and Hacker Groups Taking Sides",
  "url": "https://thehackernews.com/2022/02/russia-ukraine-war-phishing-malware-and.html",
  "metin": "\nUkraine's Computer Emergency Response Team (CERT-UA) has warned of Belarusian state-sponsored hackers targeting its military personnel and related individuals as part of a phishing campaign mounted amidst Russia's military invasion of the country.\n\"Mass phishing emails have recently been observed targeting private 'i.ua' and 'meta.ua' accounts of Ukrainian military personnel and related individuals,\" the CERT-UA said. \"After the account is compromised, the attackers, by the IMAP protocol, get access to all the messages.\"\nSubsequently, the attacks leverage the contact information stored in the victim's address book to propagate the phishing messages to other targets.\n\nThe Ukrainian government attributed the activities to a threat actor tracked as UNC1151, a Minsk-based group whose \"members are officers of the Ministry of Defence of the Republic of Belarus.\" In a follow-up update, the agency said the nation-state group also targets its own citizens, while simultaneously setting its sights on Russian entities –\n\nAssociation of Belarusians of the World (International Social Union)\nBelarusian Music Festival\nSamara Oblasna Public Organization \"Russian-Belarusian Fraternity 2000\"\nDzêâslov, a Belarusian literary magazine\nSoviet Belarus (Sovetskaya Belorussiya), a daily newspaper in Belarus\nEmployees of the National Academy of the Republic of Kazakhstan, and\nVoice of the Motherland, a local newspaper in Belarus\n\nUNC1151 is the Mandiant-assigned moniker to an uncategorized threat cluster, which operates with objectives that are aligned with Belarusian government interests. The hacking group is believed to have been active since at least 2016.\n\n\"UNC1151 has targeted a wide variety of governmental and private sector entities, with a focus in Ukraine, Lithuania, Latvia, Poland, and Germany,\" Mandiant researchers said in a November 2021 report. \"The targeting also includes Belarusian dissidents, media entities, and journalists.\"\nThe state-backed cyber espionage group has also been linked to the Ghostwriter disinformation campaign that promulgated anti-NATO and corruption-themed narratives aimed at Lithuania, Latvia, and Poland with the likely goal of undermining the governments and creating tensions in the region.\nWhat's more, the January defacement attacks of several Ukrainian government websites with threatening messages are believed to be the handiwork of UNC1151 as well.\nHacking Groups Take Sides\nThe development follows a barrage of data wiper and distributed-denial-of-service (DDoS) attacks against Ukrainian government agencies, even as various hacking groups and ransomware syndicates are capitalizing on the chaos to take sides and further their activities.\n\n\"The Anonymous collective is officially in cyber war against the Russian government,\" the decentralized hacktivist group tweeted, adding it \"leaked the database of the Russian Ministry of Defense website.\"\n\nAnother group that has declared its fealty to Ukraine is the vigilante group known as GhostSec (short for Ghost Security), which announced it had flooded Russian military websites with DDoS attacks \"in support of the people in Ukraine.\"\n\nThe Conti ransomware cartel, which recently absorbed the now-shuttered TrickBot trojan, rallied its \"full support\" behind the Russian government, threatening to \"strike back at the critical infrastructures of an enemy\" should \"anybody will decide to organize a cyber attack or any war activities against Russia.\"\nThe group, however, later rephrased its statement to state that \"we do not ally with any government and we condemn the ongoing war.\" But the Conti team also maintained that it \"will use our full capacity to deliver retaliatory measures in case the Western warmongers attempt to target critical infrastructure in Russia or any Russian-speaking region of the world.\"\nOther hacking entities to declare allegiance to Russia are the RedBanditsRU cybercrime group and the lesser-known CoomingProject ransomware program, which pledged to \"help the Russian government if cyber attacks and conduct against Russia.\"\nThe ripple effects from the war have also prompted the Ukrainian government to form a volunteer \"IT Army\" to conduct operational tasks against Russia on the cyber frontline. \"We are creating an IT army,\" Ukraine's Minister for Digital Transformation Mykhaylo Fedorov said Friday. \"We need digital talents.\"\nThe tasks encouraged more than 195,000 members of a newly set up Telegram group to \"use any vectors of cyber and DDoS attacks\" on the websites of Russian and Belarusian business corporations, banks, and government entities, as well as media websites and YouTube channels that \"openly lie about the war in Ukraine.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "From Pet Systems to Cattle Farm — What Happened to the Data Center?",
  "url": "https://thehackernews.com/2022/02/from-pet-systems-to-cattle-farm-what.html",
  "metin": "\nThere's something about craftsmanship. It's personal, its artistry, and it can be incredibly effective in achieving its goals. On the other hand, mass-market production can be effective in other ways, through speed, efficiency, and cost savings.\nThe story of data centers is one of going from craftsmanship – where every individual machine is a pet project, maintained with great care – to mass production with big server farms where individual units are completely disposable.\nIn this article, we take a look at how data centers have changed shape over the decades. We examine the implications for data center workloads, and for the people that run them – who have now lost their pet systems. We'll also review the cybersecurity implications of the new data center landscape.\nPet system with a big purpose\nFor any sysadmin who started their career before the advent of virtualization and other cloud and automation technologies, systems were finely crafted pieces of hardware – and treated with the same love as a pet.\nIt starts with the 1940s emergence of computer rooms – where big machines manually connected by miles of wires were what could only be called a labor of love. These computer rooms contained the steam engines of the computing age, soon to be replaced with more sophisticated equipment thanks to the silicon revolutions. As for security? A big lock on the door was all that was needed.\nMainframes, the precursors to today's data centers, were finely crafted solutions too, with a single machine taking up an entire room and needing continuous, expert craftsmanship to continue operating. That involved both hardware skills and coding skills where mainframe operators must code on the fly to keep their workloads running.\nFrom a security perspective, mainframes were reasonably easy to manage. It was (way) before the dawn of the internet age, and IT managers' pet systems were at reasonably limited risk of breach. The first computer viruses emerged in the 1970s, but these were hardly of risk to mainframe operations.\nPrefab computing power with unique management requirements\nBring on the 1990s and the emergence of data centers. Individual, mass-produced machines offered off-the-shelf computing power that was much more affordable than mainframe units. A data center simply consisted of a collection of these computers – all hooked up to each other. Later in the decade, the data center was also connected to the internet.\nThough the individual machines required minimal physical maintenance, the software that drove the workloads for these machines required continuous maintenance. The 1990's data center was very much composed of pet systems. That counted for every machine, which was an act of server management craftsmanship.\nFrom manual software updates to running backups and maintaining the network, IT admins had their work cut out – if not in physically maintaining machines, then certainly in managing the software that supports their workloads.\nIt's also an era that first exposed corporate workloads to external security vulnerabilities. With data centers now linked up to the internet, there was suddenly a doorway for attackers to enter into data centers. It puts IT admin's pet systems at risk – the risk of data theft, risk of equipment misuse, etc.\nSo, security became a major concern. Firewalls, threat detection, and regular patching against vulnerabilities are the sort of security tools that IT admins had to adopt to protect their pet systems through the turn of the millennium.\nServer farms – mass-produced, mass managed\nThe 2000s saw a major change in the way that workloads were handled in the data center. The core drive behind this change was efficiency and flexibility. Given the huge demand for computing workloads, solutions including virtualization, and containerization a bit further after that, quickly gained ground.\nBy loosening the strict link between hardware and operating system, virtualization meant that workloads became relatively speaking independent from the machines that run them. The net result brought a wide range of benefits. Load balancing, for example, ensures that tough workloads always have access to computing power, without the need for excessive financial investment in computing power. High availability, in turn, is designed to eliminate downtime.\nAs for individual machines – well, these are now completely disposable. The technologies in use in modern data centers mean that individual machines have essentially no meaning – they're just cogs in a much larger operation.\nThese machines no longer had nice individual names and simply became instances – e.g., the webserver service is no longer provided by the incredibly powerful \"Aldebaran\" server, but rather by a cadre of \"webserver-001\" to \"webserver-032\". Tech teams could no longer afford to spend the time to adjust each one as precisely as before, but the large numbers used and efficiency gained thanks to virtualization meant that the overall computing power in the room would still surpass the results of pet systems.\nLimited opportunity for craftsmanship\nContainer technologies like Docker, and Kubernetes more recently, have taken this process even further. You no longer need to dedicate full systems to perform a given task, you just need the basic infrastructure provided by the container to run a service or application. It's even faster and more efficient to have countless containers underpinning a service rather than specific, dedicated systems for each task.\nDeploying a new system no longer requires the manual installation of an operating system or a labor-intensive configuration and service deployment process. Everything now resides in \"recipe\" files, simple text-based documents that describe how a system should behave, using tools like Ansible, Puppet or Chef.\nIT admins could still include some tweaks or optimizations in these deployments but, because each server is no longer unique, and because there are so many of them supporting each service, it hardly makes sense to spend the effort to do so. Admins that need more performance can always reuse the recipe to fire up a few more systems.\nWhile a few core services, like identity management servers or other systems storing critical information would still remain as pets, the majority were now regarded as cattle - sure, you didn't want any of them to fail, but if one did, it could quickly get replaced with another, equally unremarkable, system performing a specific task.\nTake into account the fact that workloads are increasingly operating on rented computing resources residing in large cloud facilities and it's clear that the days of running servers as a pet system are over. It's now about mass production – in an almost extreme way. Is that a good thing?\nMass production is great: but there are new risks\nFlexibility and efficiency brought along by mass production are good things. In the computing environment, little is lost by no longer needing to \"handcraft\" and \"nurture\" computing environments. It's a much sleeker, faster way to make workloads go live and to make sure that they stay live.\nBut there are a number of security implications. While security could be \"crafted\" into pet systems, cattle environments require a slightly different approach – and certainly still requires a strong focus on security. For example, cattle systems are spawned from the same recipe files, so any intrinsic flaws in the base images used for them will be also deployed at scale. This directly translates to a larger attack surface when a vulnerability surfaces, as there are just many more possible targets. In this situation, it doesn't really matter if you can fire up a new system within minutes or even seconds - do that over thousands of servers at once and your workloads will be impacted regardless of the time it takes, and that will impact your bottom line.\nTo a large degree, automation is now the answer to security in server farms. Think about tools like automated penetration scanning, and automated live patching tools. These tools provide more airtight security against an equally automated threat, and reduce the administrative overhead of managing these systems.\nA changed computing landscape\nThe evolving environment in IT has changed the architecture of the data center, and the approach of the people who make data centers work. It's simply not feasible to rely on old practices and expect to have the best results - and this is a tough challenge, as it requires a considerable amount of effort by sysadmins and other IT practitioners - it's a significant mindset change and it takes a conscious effort to change the way you reason about system administration, but some underlying principles, like security, still apply. Given how vulnerability numbers don't seem to go down - quite the opposite, in fact - it will continue to apply in the foreseeable future, regardless of other evolutionary changes affecting your data center.\nRather than opposing it, IT admins should accept that their pet systems are now, for all intents and purposes, gone – replaced by mass production delivery. It also means accepting that the security challenges are still here – but in a changed shape.\nIn making server workloads run efficiently, IT admins rely on a new toolset, with adapted methods that rely on automating tasks that can no longer be performed manually. So, similarly, in running server farm security operations, IT admins need to take a look at patching automation tools like TuxCare's KernelCare Enterprise, and see how they fit into their new toolset.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "9-Year-Old Unpatched Email Hacking Bug Uncovered in Horde Webmail Software",
  "url": "https://thehackernews.com/2022/02/9-year-old-unpatched-email-hacking-bug.html",
  "metin": "\nUsers of Horde Webmail are being urged to disable a feature to contain a nine-year-old unpatched security vulnerability in the software that could be abused to gain complete access to email accounts simply by previewing an attachment.\n\"This gives the attacker access to all sensitive and perhaps secret information a victim has stored in their email account and could allow them to gain further access to the internal services of an organization,\" SonarSource vulnerability researcher, Simon Scannell, said in a report.\nAn \"all volunteer\" initiative, the Horde Project is a free, browser-based communication suite that allows users to read, send, and organize email messages as well as manage and share calendars, contacts, tasks, notes, files, and bookmarks.\n\nThe flaw, which was introduced as part of a code change pushed on November 30, 2012, relates to a case of an \"unusual\" stored cross-site scripting flaw (aka persistent XSS) that allows an adversary to craft an OpenOffice document in such a manner that when it's previewed, it automatically executes arbitrary JavaScript payload.\nStored XSS attacks arise when a malicious script is injected directly into a vulnerable web application's server, such as a comment field of a website, causing the untrusted code to be retrieved and transmitted to the victim's browser every time the stored information is requested.\n\"The vulnerability triggers when a targeted user views an attached OpenOffice document in the browser,\" Scannell said. \"As a result, an attacker can steal all emails the victim has sent and received.\"\nEven worse, should an administrator account with a personalized, malicious email is successfully compromised, the attacker could abuse this privileged access to take over the entire webmail server.\n\nThe shortcoming was originally reported to the project maintainers on August 26, 2021, but to date no fixes have been shipped despite confirmation from the vendor acknowledging the flaw. We have reached out to Horde for further comment, and we will update if we hear back.\nIn the interim, Horde Webmail users are advised to disable the rendering of OpenOffice attachments by editing the config/mime_drivers.php file to add the 'disable' => true configuration option to OpenOffice mime handler.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "A Free Solution to Protect Your Business from 6 Biggest Cyber Threats in 2022",
  "url": "https://thehackernews.com/2022/02/a-free-solution-to-protect-your.html",
  "metin": "\nFor the last few years, the cybersecurity threat landscape has gotten progressively more complex and dangerous. The online world is now rife with data thieves, extortionists, and even state actors looking to exploit vulnerabilities in businesses' digital defenses. \nAnd unfortunately — the bad guys have the upper hand at the moment. Part of the reason for that is the fallout from the rapid digitization made necessary by the COVID-19 pandemic.\nAccording to research on the subject, more than half of businesses have yet to mitigate the risks created by that digitization. And when you add a persistent shortage of cybersecurity workers to that fact, you have the makings of a scary situation.\nBut businesses aren't helpless. There are plenty of things they can do to augment their defenses as they look to mitigate cyber risks. And best of all, some of those options won't cost them a thing.\nA great example of that is the open-source security platform Wazuh. It offers businesses a free solution to the following top six cyber threats — and then some.\nRansomware and Malware\nOf all of the digital threats businesses now face, there's one that most experts agree is the most pressing. It's the threat of ransomware. Ransomware is a type of malware designed to hold business systems and data hostage using sophisticated encryption technology. \nOnce it gets into a business network, it will encrypt valuable data and demand payment to return access to that data to the business.\n\nThe trouble is — there's never any guarantee that a payment will result in the data getting released. And 80% of businesses that do pay to get their data back end up getting retargeted for a second attack. So, the only surefire way to deal with ransomware is to avoid it in the first place. And that's the first thing Wazuh can help with.\nThere are a few ways that Wazuh accomplishes this on the machines it's running on. First, it uses a \"Scanless Vulnerability Detection\" module that works with a CVE (Common Vulnerabilities and Exposures) database to search for vulnerabilities in the software and hardware. Then, it looks for misconfigurations that could allow malicious software to propagate. And finally, it conducts file system surveillance using the \"File integrity monitoring\" feature to look for the telltale signs of a ransomware attack in real-time.\nNetwork-Based Intrusions\nOne of the reasons that threats like ransomware, backdoor and malware are so dangerous is their ability to spread within a compromised business network. That means a security flaw on a single machine could end up leading to a company-wide cyber attack. And the only way to spot something like that is to monitor network traffic to look for unusual activity.\nWazuh does this by integrating with another industry-leading open-source solution called Suricata. It's a sophisticated intrusion detection, prevention, and network security monitoring platform that can detect cyber-attacks and halt them in their tracks. And with the addition of another free component — OwlH — network managers can see a complete visualization of network utilization to spot potential threats before they can do real damage.\nVulnerable and Outdated Software\nBelieve it or not, the majority of cyber-attacks exploit vulnerabilities that software vendors are already aware of. The reason they can do that is the fact that computer users — and particularly business users — don't do a very good job of keeping their software up to date. And just by doing that, businesses can gain an instant upgrade to their cyber defenses.\nWazuh helps them with that by performing network-wide vulnerability scans that can identify known security flaws. And through a single interface, it identifies missing security patches that will fix the problems when available. That makes it easier for administrators to patch known vulnerabilities and keep track of those for which patches aren't yet available.\nDDoS Attacks\nAnother common cyber threat involves the use of internet traffic to paralyze a targeted system or network. \nIt's known as a distributed denial of service (DDoS) attack, and while not typically destructive, it can lead to hours of downtime for a target. Cybercriminals carry out such attacks by harnessing the power of thousands of compromised computers and devices to direct a wave of meaningless internet traffic toward their target. \n\nEventually, the affected system runs out of resources to deal with it and is effectively knocked offline.\nThere are built-in out-of-the-box rules in Wazuh that can identify brute-force and DDoS attacks by correlating multiple authentication failure events. In this way, the platform can help network administrators to short-circuit ongoing DDoS attacks and stop brute-force hack attempts aimed at open SSH and RDP ports.\nData Leaks\nOne of the biggest cyber threats businesses have to deal with every day is the chance that their proprietary or other sensitive data will fall into the wrong hands. \nSometimes, it happens when an unauthorized user gains access to a protected system and exfiltrates data. And other times it happens through the carelessness — or malice — of an employee or other insider.\nIn order to protect against the former, Wazuh has a range of real-time monitoring features that can detect unauthorized access via custom rules, alerting managers when malicious commands are executed. And to guard against the latter, it can monitor employees' use of external storage devices like USB drives and the like to help administrators enforce the business's data security policy. It can even run audits of any command-line use by authorized users, to look for attempts at bypassing GUI-based restrictions on data access.\nRegulatory Compliance\nCybercriminals aren't the only digital threat that businesses have to deal with. They may also face repercussions from failing to abide by regulatory standards they're subject to. And as the number of those standards continues to grow, so too does the burden businesses face in guaranteeing their compliance.\nThe good news is that Wazuh is built with compliance in mind. Its built-in detection and logging rules are mapped to various major compliance requirements. That means it can automatically attach compliance information to the alerts it generates.\nThe regulatory frameworks it supports out of the box include:\n\nTrust Services Criteria (TSC SOC2)\nPayment Card Industry Data Security Standard (PCI DSS)\nNIST Special Publication 800-53 (NIST 800-53)\nGeneral Data Protection Regulation (GDPR)\nGood Practice Guide 13 (GPG13)\nHealth Insurance Portability and Accountability Act (HIPAA)\n\nThose features aid administrators in the complex task of compliance and in fulfilling their reporting requirements as necessary.\nThe Bottom Line\nThe cyber threat landscape is continuing to evolve and presents an ever greater security challenge to businesses. And for that reason, they must use all of the tools at their disposal to defend themselves.\nFortunately, Wazuh offers businesses a sophisticated security platform without the need for massive technology investment. And given its versatility — it should be a go-to solution for any business racing to meet the challenge of modern cybersecurity.\nIf you haven't tried it yet, you should. Wazuh is a fully open-source solution that is free to download and easy to use. There is also extensive documentation describing its features, capabilities and usage.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "PseudoManuscrypt Malware Spreading the Same Way as CryptBot Targets Koreans",
  "url": "https://thehackernews.com/2022/02/pseudomanuscrypt-malware-spreading-same.html",
  "metin": "\nNumerous Windows machines located in South Korea have been targeted by a botnet tracked as PseudoManuscrypt since at least May 2021 by employing the same delivery tactics of another malware called CryptBot.\n\"PseudoManuscrypt is disguised as an installer that is similar to a form of CryptBot, and is being distributed,\" South Korean cybersecurity company AhnLab Security Emergency Response Center (ASEC) said in a report published today.\n\"Not only is its file form similar to CryptBot, but it is also distributed via malicious sites exposed on the top search page when users search commercial software-related illegal programs such as Crack and Keygen,\" it added.\nAccording to ASEC, around 30 computers in the country are being consistently infected on a daily basis on average.\n\nPseudoManuscrypt was first documented by Russian cybersecurity firm Kaspersky in December 2021, when it disclosed details of a \"mass-scale spyware attack campaign\" infecting more than 35,000 computers in 195 countries globally.\nTargets of PseudoManuscrypt attacks, which it originally uncovered in June 2021, included a significant number of industrial and government organizations, including enterprises in the military-industrial complex and research laboratories, in Russia, India, and Brazil, among others.\n\nThe main payload module is equipped with extensive and varied spying functionality that provides the attackers with virtually full control of the infected system. It includes stealing VPN connection details, recording audio with the microphone, and capturing clipboard contents and operating system event log data.\n\nFurthermore, PseudoManuscrypt can access a remote command-and-control server under the attacker's control to carry out various nefarious activities such as file download, execute arbitrary commands, log keypresses, and capture screenshots and videos of the screen.\n\"As this malware is disguised as an illegal software installer and is distributed to random individuals via malicious sites, users must be careful not to download relevant programs,\" the researchers said. \"As malicious files can also be registered to service and perform continuous malicious behaviors without the user knowing, periodic PC maintenance is necessary.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Getting Your SOC 2 Compliance as a SaaS Company",
  "url": "https://thehackernews.com/2022/02/getting-your-soc-2-compliance-as-saas.html",
  "metin": "\nIf you haven't heard of the term, you will soon enough. SOC 2, meaning System and Organization Controls 2, is an auditing procedure developed by the American Institute of CPAs (AICPA). Having SOC 2 compliance means you have implemented organizational controls and practices that provide assurance for the safeguarding and security of client data. In other words, you have to show (e.g., document and demonstrate) that you are acting in good faith with other people's information. In its simplest definition, it's a report card from an auditor. \nAt Rewind, before SOC 2, we had some processes in place, such as change management procedures for when emergency fixes need to be released to production quickly. But after beginning our SOC 2 journey we realized that we did not have a great way to track the reasoning behind a required emergency change, and this was required for our SOC 2 audit. So we worked with our auditor to set up a continuous auditing system for these requests, providing a long-term solution and a massive procedural improvement, offering this solution to other companies in our position. Achieving SOC 2 compliance signals to a market, that you are willing to provide assurance in the form of a third-party audit report that you will protect customer information. Information your business relies on. \nWhy Have SOC 2 at All? \nIn short, more data is collected by more organizations today, than at any point in history. As a whole, private and public sector groups are becoming more conscious about how their proprietary data is handled by other parties. For highly regulated industries such as finance, healthcare, or publicly traded companies, SOC 2 has essentially become a cost of doing business. For any SaaS companies that want to \"grow up\" and sell to big brands, the question \"Do you have your SOC2?\" will be one of the first things your sales team gets asked.\nSOC 2 reports also give companies a leg up in providing assurance to customers in today's cybersecurity landscape. The volume of cyberattacks is increasing every year. A breach can trigger fines, damage a company's reputation, cause an exodus of customers, and much more. SOC 2 compliance goes a long way in mitigating losses from these scenarios by providing assurance that you have key processes in place. A compliant business is more likely to respond to a breach quickly, thus limiting its impact.\nGetting SOC2 the Swift and Smart Way \nBefore I joined Rewind, and similarly for most growing SaaS companies, SOC 2 seemed like an intimidating task to achieve. We had processes in place, but we had work to do to formalize them to be SOC 2 compliant and audit ready. The sales team was also consistently getting asked about Rewind and our plans for SOC 2 compliance because our customers wanted that assurance, and getting SOC 2 became a priority. The next step is understanding your company's SOC2 goals, priorities, and identifying what steps need to be taken to become compliant. \nI've spent my entire career as an Information Security Professional with a focus on governance, risk and compliance. Much of this is second nature to me. For newcomers it can be a daunting and overwhelming process. So here is a quick framework to help you get prepared for the road ahead.\n1 — Choosing your scope\n\nThe first step is to decide on the scope of your audit, what service or product will be the focus,\nand what Trust Service Principles you want to be audited. For example, Security is a mandatory principle, but you can also include confidentiality, availability, processing integrity, or privacy principles. \nHere's an easy way to think about this: the service you provide to your customers, can determine what Trust Service Principles to focus on. For example, if your company processes financial data, \"processing integrity\" may be an important principle to showcase. An ecommerce or marketing service would likely focus on security and privacy because of the sheer amounts of personal data that they handle. \nRewind provides SaaS backups, so the scope was our own software platform. For our first SOC 2 rodeo, within this scope, the focus was on security and confidentiality controls. Confidentiality was an important principle, since customers are trusting us with their backup data, and we want to demonstrate how we ensure the confidentiality of the information entrusted to us. \nIt's also important to remember that if you want to pursue other Trust Service Principles in the future, you can nourish and grow your SOC2 compliance program and internal processes to meet that goal down the line.\n2 — Assessing Your Level of Controls\n\nRequests from the sales team can definitely help you determine what Trust Service Principles to focus on, but that doesn't mean you can start the audit process tomorrow. I always recommend companies complete readiness assessments. This helps establish the benchmark of how many controls you may already have in place, and for those that you may not, you can identify what areas to focus on. Once you get to 100%, you can prepare for your audit. \nYou can find various readiness assessment documents on the web from various third parties or visit the AICPA website. Auditors can also help you with your readiness assessment as part of your engagement.\nAs an added bonus, a readiness assessment can help you understand how to better budget for your SOC2 program going forward.. For example, you could identify that you need to perform a third-party penetration test on your application periodically, or invest in an employee background check process, all of which have ongoing costs to budget for.\n3 — Organizing Controls and Evidence Collection\n\nThere is no wrong way to organize your SOC2 compliance program and controls. Yet in the long run, there are ways that make it more difficult and ways that make it easier. Spreadsheets are fine to list out all of your controls, assign owners, record notes and add links to where your evidence is stored for audits. Over time though, this gets messy and difficult to monitor. \nAt Rewind, we wanted to focus on the longevity of our SOC2 compliance program. Control ownership and evidence collection needed to be centralized and accessible to all stakeholders. To help with this, we invested in a Security Assurance Platform to help us manage our compliance program. I'd recommend as part of your SOC2 budget to consider a tool that can help you organize your controls and monitor them going forward. \nThe difficulty here is finding the right solution that fits your needs. You'll commonly see companies advertise their solutions with promises of \"Get SOC2 in two months!\". Your compliance program should be a machine that keeps going. It's not a shiny medal to win in record time. We wanted a tool that shared that mission also.\n4 — Choose and Train Control Owners\nThese are individuals in your business responsible for the implementation and ongoing compliance of your controls. The main challenge here is that on the surface you're essentially asking people to do more work. Yet it shouldn't be seen this way. This is a collaborative effort to design controls and processes to be SOC2 compliant, that become woven into each team's everyday processes. \nAny new process added should be an improvement to the security (or other Trust Service Principle related process/control) of your company. Rewind's approach was to go with a collaborative approach led by our \"Trust Team\" but at the same time, empowering control owners to be responsible for their own areas of compliance. SOC2 should be a common goal for your entire company, not just the security team.\n5 — Choose your auditors\n\nThere are many reputable CPA's out there to perform your audit for you, but different auditing companies offer a variety of services. At Rewind, our choice of auditor (Moss Adams) is recommended and trained to use our Security Assurance Platform (Tugboat Logic), which we use to manage our SOC2 program. This means we can manage the compliance of our entire program including providing evidence to our auditors in the same tool. This reduces the workload of our control auditors and means we can have a centralized place to manage our controls, evidence collection and audits.\nA hurdle here could be really knowing where to start. You don't want to tie yourself to a specific security assurance tool or CPA if it doesn't work out for you in the long run. Choose a reputable CPA that is open to working with you and your workflows. You want a collaborative relationship where you can also ask for advice and know that they also want to be a part of your success.\n6 — Consider a Type 1 report before a Type 2 \n\nA SOC2 Type 1 audit can be incredibly beneficial to get your feet wet in the SOC2 audit process. A Type 1 audit gives you an opportunity to get experience with the SOC2 audit process and build a rapport and develop a working relationship with your auditor. You also get a report to provide customers which signals your commitment to your compliance program. This is the approach we took at Rewind and I am happy we did. \nThere is obviously much more to this process than what I've provided. However, based on my experience, I think this can help you set the stage for the next steps. Thinking about how SOC 2 controls fit into your business today, will save you a world of headaches in the future.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "VMware Issues Security Patches for High-Severity Flaws Affecting Multiple Products",
  "url": "https://thehackernews.com/2022/02/vmware-issues-security-patches-for-high.html",
  "metin": "\nVMware on Tuesday patched several high-severity vulnerabilities impacting ESXi, Workstation, Fusion, Cloud Foundation, and NSX Data Center for vSphere that could be exploited to execute arbitrary code and cause a denial-of-service (DoS) condition.\nAs of writing, there's no evidence that any of the weaknesses are exploited in the wild. The list of six flaws is as follows –\n\n\nCVE-2021-22040 (CVSS score: 8.4) - Use-after-free vulnerability in XHCI USB controller\nCVE-2021-22041 (CVSS score: 8.4) - Double-fetch vulnerability in UHCI USB controller\nCVE-2021-22042 (CVSS score: 8.2) - ESXi settingsd unauthorized access vulnerability\nCVE-2021-22043 (CVSS score: 8.2) - ESXi settingsd TOCTOU vulnerability\nCVE-2021-22050 (CVSS score: 5.3) - ESXi slow HTTP POST denial-of-service vulnerability\nCVE-2022-22945 (CVSS score: 8.8) - CLI shell injection vulnerability in the NSX Edge appliance component\n\nSuccessful exploitation of the flaws could allow a malicious actor with local administrative privileges on a virtual machine to execute code as the virtual machine's VMX process running on the host. It could also allow the adversary with access to settingsd to escalate their privileges by writing arbitrary files.\nAdditionally, CVE-2021-22050 could be weaponized by an adversary with network access to ESXi to create a DoS condition by overwhelming rhttpproxy service with multiple requests. Last but not least, CVE-2022-22945 could permit an attacker with SSH access to an NSX-Edge appliance (NSX-V) to run arbitrary commands on the operating system as root user.\n\nFour of the issues were originally discovered as part of the Tianfu Cup held last year in China, with the virtualization services provider working with the contest's organizers to review the findings and receive the information privately.\n\"The ramifications of this vulnerability are serious, especially if attackers have access to workloads inside your environments,\" VMware noted in a separate FAQ. \"Organizations that practice change management using the ITIL definitions of change types would consider this an 'emergency change.'\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "New MyloBot Malware Variant Sends Sextortion Emails Demanding $2,732 in Bitcoin",
  "url": "https://thehackernews.com/2022/02/new-mylobot-malware-variant-sends.html",
  "metin": "\nA new version of the MyloBot malware has been observed to deploy malicious payloads that are being used to send sextortion emails demanding victims to pay $2,732 in digital currency.\nMyloBot, first detected in 2018, is known to feature an array of sophisticated anti-debugging capabilities and propagation techniques to rope infected machines into a botnet, not to mention remove traces of other competing malware from the systems.\nChief among its methods to evade detection and stay under the radar included a delay of 14 days before accessing its command-and-control servers and the facility to execute malicious binaries directly from memory.\n\nMyloBot also leverages a technique called process hollowing, wherein the attack code is injected into a suspended and hollowed process in order to circumvent process-based defenses. This is achieved by unmapping the memory allocated to the live process and replacing it with the arbitrary code to be executed, in this case a decoded resource file.\n\"The second stage executable then creates a new folder under C:\\ProgramData,\" Minerva Labs researcher Natalie Zargarov said in a report. \"It looks for svchost.exe under a system directory and executes it in suspended state. Using an APC injection technique, it injects itself into the spawned svchost.exe process.\"\n\nAPC injection, similar to process hollowing, is also a process injection technique that enables the insertion of malicious code into an existing victim process via the asynchronous procedure call (APC) queue.\n\nThe next phase of the infection involves establishing persistence on the compromised host, using the foothold as a stepping stone to establish communications with a remote server to fetch and execute a payload that, in turn, decodes and runs the final-stage malware.\nThis malware is designed to abuse the endpoint to send extortion messages alluding to the recipients' online behaviors, such as visiting porn sites, and threatening to leak a video that was allegedly recorded by breaking into their computers' webcam.\nMinerva Labs' analysis of the malware also reveals its ability to download additional files, suggesting that the threat actor left behind a backdoor for carrying out further attacks.\n\"This threat actor went through a lot of trouble to drop the malware and keep it undetected, only to use it as an extortion mail sender,\" Zargarov said. \"Botnets are dangerous exactly because of this unknown upcoming threat. It could just as easily drop and execute ransomware, spyware, worms, or other threats on all infected endpoints.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Apple Releases iOS, iPadOS, macOS Updates to Patch Actively Exploited Zero-Day Flaw",
  "url": "https://thehackernews.com/2022/02/apple-releases-ios-ipados-macos-updates.html",
  "metin": "\nApple on Thursday released security updates for iOS, iPadOS, macOS, and Safari to address a new WebKit flaw that it said may have been actively exploited in the wild, making it the company's third zero-day patch since the start of the year.\n\nTracked as CVE-2022-22620, the issue concerns a use-after-free vulnerability in the WebKit component that powers the Safari web browser and could be exploited by a piece of specially crafted web content to gain arbitrary code execution. \n\"Apple is aware of a report that this issue may have been actively exploited,\" the company said in a terse statement acknowledging in-the-wild attacks leveraging the flaw.\nThe iPhone maker credited an anonymous researcher for discovering and reporting the flaw, adding it remediated the issue with improved memory management.\nThe updates are available for iPhone 6s and later, iPad Pro (all models), iPad Air 2 and later, iPad 5th generation and later, iPad mini 4 and later, and iPod touch (7th generation), macOS devices running Big Sur and macOS Catalina, and also as a standalone update for Safari.\n\nThe latest fix brings the tally of zero-day patches issued by Apple for 2022 to three, including CVE-2022-22587 and CVE-2022-22594, that could have been exploited to run arbitrary code and track users' online activity in the web browser.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Guide: Alert Overload and Handling for Lean IT Security Teams",
  "url": "https://thehackernews.com/2022/02/guide-alert-overload-and-handling-for.html",
  "metin": "\nAlarming research reveals the stress and strains the average cybersecurity team experiences on a daily basis. As many as 70% of teams report feeling emotionally overwhelmed by security alerts. Those alerts come at such high volume, high velocity, and high intensity that they become an extreme source of stress. So extreme, in fact, that people's home lives are negatively affected. Alert overload is bad for those who work in cybersecurity. But it's even worse for everyone who depends on cybersecurity. \nThis is a gigantic issue in the industry, yet few people even acknowledge it, let alone deal with it. Cynet aims to correct that in this guide (download here), starting by shining a light on the cause of the problem and the full extent of its consequences and then offering a few ways lean security teams can pull their analysts out of the ocean of false positives and get them back to shore. It includes tips on how to reduce alerts using automation and shares guidance for organizations that are considering outsourcing their managed detection and response (MDR). The guide also shares how security teams can detangle the web of security tools necessary for automation.\nSolving alert overload\nSecurity teams of all sizes need to reduce the number of alerts they encounter and refine how they respond to alerts to take action before the damage starts. Below are tactics covered in the guide that security teams, especially lean ones, can use to reduce and respond to thousands of alerts.\n1 — Consider outsourcing to MDR: Outsourcing managed detection and response (MDR) is a good option if you need to scale quickly and don't have the resources. MDRs can help reduce stress and give your team time back. Another consideration is cost. You also will need to invest time in finding an MDR that's right for your business. As the guide shows, outsourcing can absolutely be an asset. But it's never a complete solution.\n2 — Strategize reducing alerts: It starts with strategy. Look at your existing tech and make sure you've optimized their settings and your tools are calibrated. Ultimately, it's not about reducing alerts so much as it's about how you've set your team up to respond.\nFor example, find ways to expedite how you investigate alerts that you can't eliminate or aggregate. One way is to correlate alarms with known activities, like when a planned patch installation disables security tools in bulk as the system recycles. Any other time, the security team would want to know that security tools are going offline, but there's a simple explanation during patching. Calibrating tools to \"quiet\" alerts during known events or scheduled times will give the security team more time to focus on the actual emergencies.\n3 — Introducing automated response: Even the leanest security teams can tackle threats if they use automation. Automation allows security teams to respond to alerts at scale quickly. But one of the biggest challenges with automation is knowing how to set it up in the first place properly.\nOne of the downsides of automated response we need to try to avoid, happens when an automated response, particularly the kind is driven by machine learning, blocks both malicious and legitimate traffic. These unpredictable instances can be annoying for the security team and for users throughout the organization. Problems can also be hard to undo if the actions taken by automation haven't been carefully documented along the way. The guide suggests new ways to solve this problem as well. \n4 — Use tools that facilitate automation: Setting up automation is not a 'walk in the park' because of the abundance of security and IT solutions that need to be integrated (for example, IPS, NDR, EPP, firewalls, DNS filtering, and more.). The key is to know how to put all of these tools in one place – and the guide suggests new ways to do just that.\nIf you want to find out more and learn how to stop alert overload, download the guide here.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Medusa Android Banking Trojan Spreading Through Flubot's Attacks Network",
  "url": "https://thehackernews.com/2022/02/medusa-android-banking-trojan-spreading.html",
  "metin": "\nTwo different Android banking Trojans, FluBot and Medusa, are relying on the same delivery vehicle as part of a simultaneous attack campaign, according to new research published by ThreatFabric.\nThe ongoing side-by-side infections, facilitated through the same smishing (SMS phishing) infrastructure, involved the overlapping usage of \"app names, package names, and similar icons,\" the Dutch mobile security firm said.\nMedusa, first discovered targeting Turkish financial organizations in July 2020, has undergone several iterations, chief among which is the ability to abuse accessibility permissions in Android to siphon funds from banking apps to an account controlled by the attacker.\n\"Medusa sports other dangerous features like keylogging, accessibility event logging, and audio and video streaming — all these capabilities provide actors with almost full access to [a] victim's device,\" the researchers said.\n\nThe malware-ridden apps used in conjunction with FluBot masquerade as DHL and Flash Player apps to infect the devices. In addition, recent attacks involving Medusa have expanded their focus beyond Turkey to include Canada and the U.S., with the operators maintaining multiple botnets for each of its campaigns.\n\nFluBot (aka Cabassous), for its part, has received a novel upgrade of its own: the ability to intercept and potentially manipulate notifications from targeted applications on a victim's Android device by leveraging the direct reply action, alongside auto-replying to messages from apps like WhatsApp to spread phishing links in a worm-like fashion.\n\"With this functionality, this malware is able to provide [command-and-control server] supplied responses to notifications of targeted applications on the victim's device,\" the researchers said, adding the functionality \"can be used by actors to sign fraudulent transactions on victim's behalf.\"\n\nThis is not the first time Android malware has been found to propagate by creating auto-replies to messages in WhatsApp. Last year, ESET and Check Point Research uncovered rogue apps posing as Huawei Mobile and Netflix that employed the same modus operandi to perform the wormable attacks.\n\"More and more actors follow Cabassous' success in distribution tactics, appropriating masquerading techniques, and using the same distribution service,\" the researchers said. \"At the same time, Cabassous keeps evolving, introducing new features and making another step towards being able to perform on-device fraud.\"\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Chinese Hackers Target Taiwanese Financial Institutions with a new Stealthy Backdoor",
  "url": "https://thehackernews.com/2022/02/chinese-hackers-target-taiwanese.html",
  "metin": "\nA Chinese advanced persistent threat (APT) group has been targeting Taiwanese financial institutions as part of a \"persistent campaign\" that lasted for at least 18 months.\nThe intrusions, whose primary intent was espionage, resulted in the deployment of a backdoor called xPack, granting the adversary extensive control over compromised machines, Broadcom-owned Symantec said in a report published last week.\nWhat's notable about this campaign is the amount of time the threat actor lurked on victim networks, affording the operators ample opportunity for detailed reconnaissance and exfiltrate potentially sensitive information pertaining to business contacts and investments without raising any red flags.\n\nIn one of the unnamed financial organizations, the attackers spent close to 250 days between December 2020 and August 2021, while a manufacturing entity had its network under their watch for roughly 175 days.\nAlthough the initial access vector used to the breach the targets remains unclear, it's suspected that Antlion leveraged a web application flaw to gain a foothold and drop the xPack custom backdoor, which is employed to execute system commands, drop subsequent malware and tools, and stage data for exfiltration.\nAdditionally, the threat actor used C++-based custom loaders as well as a combination of legitimate off-the-shelf tools such as AnyDesk and living-off-the-land (LotL) techniques to gain remote access, dump credentials, and execute arbitrary commands.\n\"Antlion is believed to have been involved in espionage activities since at least 2011, and this recent activity shows that it is still an actor to be aware of more than 10 years after it first appeared,\" the researchers said.\n\nThe findings add to a growing list of China-linked nation-state groups that have targeted Taiwan in recent months, what with malicious cyber activities mounted by threat actors tracked as Tropic Trooper and Earth Lusca striking government, healthcare, transportation, and educational institutions in the country.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}{
  "baslik": "Cynet Log4Shell Webinar: A Thorough - And Clear - Explanation",
  "url": "https://thehackernews.com/2022/02/cynet-log4shell-webinar-thorough-and.html",
  "metin": "\nMost security practitioners are now aware of the Log4Shell vulnerability discovered toward the end of 2021. No one knows how long the vulnerability existed before it was discovered. The past couple of months have had security teams scrambling to patch the Log4Shell vulnerability found in Apache Log4j, a Java library widely used to log error messages in applications. Beyond patching, it's helpful and instructive for security practitioners to have a deeper understanding of this most recent critical vulnerability.\nFortunately, Cynet Senior Security Researcher Igor Lahav is hosting a webinar [Register here] to provide \"buzzword free\" insights into Log4Shell. Based on a webinar preview provided by Cynet, the discussion will cover the software bugs in Apache Log4j that permitted the critical vulnerability, the exploits used to take advantage of the vulnerabilities and the remediation options available to protect your organization. This webinar will help make sense of the sometimes overly technical analysis of Log4Shell we've been subject to over the past couple of months.\n— What is Log4j?\nBefore you can really grasp the magnitude of the Log4Shell vulnerability, it's necessary to understand the underlying technology. The Cynet webinar steps through what the Log4j library is and how it's used in Java. It also explains a feature used by the logging system called Java Naming Directory Interface (JDNI) and how it is used by log4j to help understand the vulnerability.\n— The Vulnerabilities\nThe root cause of this vulnerability is the way Log4j processes log messages, and the webinar clearly steps through the software bugs that made the Log4j logging mechanism vulnerable to attackers. This includes a description of how JNDI injection works and why it can lead to issues as well as what remote Log4j configuration is and how attackers can leverage it to gain access.\n— The Exploits \nExactly how do attackers take advantage of the Log4j vulnerabilities? Cynet shares the step-by-step attacks they've seen in the wild, which indicate a high level of attacker expertise. They demonstrate how attackers bypass static detections, how they achieve remote code execution by bypassing two common checking functions (allowedLdapClasses and allowedLdapHosts).\n— The Mitigations\nFinally, Cynet steps through the mitigation actions companies should take, including locating vulnerable applications, patching options, important configuration changes and patching 3rd party applications. You will also learn about the Cynet Log4Shell exploit detections in Windows and Linux.\nWrapping Up\nCynet will also share discoveries from several recent incident response investigations, such as active exploitations of the Log4Shell vulnerability on VMware Horizon Servers by different threat actors who deployed Cobalt Strike beacons, Cryptominers, and fileless reverse shells. While you may have read other reports or attended other webinars covering Log4Shell, this one pulls it all together and steps through the vulnerability, exploits, recommended remediations and latest incidents simply and clearly.\nRegister to the webinar here.\n\n\nFound this article interesting? Follow THN on Facebook, Twitter  and LinkedIn to read more exclusive content we post.\n"
}